[
    {
        "title": "MIRAGE: Scaling Test-Time Inference with Parallel Graph-Retrieval-Augmented Reasoning Chains",
        "abstract": "Large reasoning models (LRMs) have shown significant progress in test-time\nscaling through chain-of-thought prompting. Current approaches like search-o1\nintegrate retrieval augmented generation (RAG) into multi-step reasoning\nprocesses but rely on a single, linear reasoning chain while incorporating\nunstructured textual information in a flat, context-agnostic manner. As a\nresult, these approaches can lead to error accumulation throughout the\nreasoning chain, which significantly limits its effectiveness in medical\nquestion-answering (QA) tasks where both accuracy and traceability are critical\nrequirements. To address these challenges, we propose MIRAGE (Multi-chain\nInference with Retrieval-Augmented Graph Exploration), a novel test-time\nscalable reasoning framework that performs dynamic multi-chain inference over\nstructured medical knowledge graphs. Specifically, MIRAGE 1) decomposes complex\nqueries into entity-grounded sub-questions, 2) executes parallel inference\nchains, 3) retrieves evidence adaptively via neighbor expansion and multi-hop\ntraversal, and 4) integrates answers using cross-chain verification to resolve\ncontradictions. Experiments on three medical QA benchmarks (GenMedGPT-5k,\nCMCQA, and ExplainCPE) show that MIRAGE consistently outperforms GPT-4o,\nTree-of-Thought variants, and other retrieval-augmented baselines in both\nautomatic and human evaluations. Additionally, MIRAGE improves interpretability\nby generating explicit reasoning chains that trace each factual claim to\nconcrete chains within the knowledge graph, making it well-suited for complex\nmedical reasoning scenarios. The code will be available for further research.",
        "url": "http://arxiv.org/abs/2508.18260v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18260v1",
        "arxiv_id": "2508.18260v1",
        "authors": [
            "Kaiwen Wei",
            "Rui Shan",
            "Dongsheng Zou",
            "Jianzhong Yang",
            "Bi Zhao",
            "Junnan Zhu",
            "Jiang Zhong"
        ],
        "submitted": "2025-08-25 17:53:22",
        "source": "arxiv",
        "comment": "10 pages, 8 figures (including tables), plus appendix. Submitted to\n  AAAI 2026"
    },
    {
        "title": "From BERT to LLMs: Comparing and Understanding Chinese Classifier Prediction in Language Models",
        "abstract": "Classifiers are an important and defining feature of the Chinese language,\nand their correct prediction is key to numerous educational applications. Yet,\nwhether the most popular Large Language Models (LLMs) possess proper knowledge\nthe Chinese classifiers is an issue that has largely remain unexplored in the\nNatural Language Processing (NLP) literature.\n  To address such a question, we employ various masking strategies to evaluate\nthe LLMs' intrinsic ability, the contribution of different sentence elements,\nand the working of the attention mechanisms during prediction. Besides, we\nexplore fine-tuning for LLMs to enhance the classifier performance.\n  Our findings reveal that LLMs perform worse than BERT, even with fine-tuning.\nThe prediction, as expected, greatly benefits from the information about the\nfollowing noun, which also explains the advantage of models with a\nbidirectional attention mechanism such as BERT.",
        "url": "http://arxiv.org/abs/2508.18253v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18253v1",
        "arxiv_id": "2508.18253v1",
        "authors": [
            "ZiqiZhang",
            "Jianfei Ma",
            "Emmanuele Chersoni",
            "Jieshun You",
            "Zhaoxin Feng"
        ],
        "submitted": "2025-08-25 17:41:46",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Demographic Biases and Gaps in the Perception of Sexism in Large Language Models",
        "abstract": "The use of Large Language Models (LLMs) has proven to be a tool that could\nhelp in the automatic detection of sexism. Previous studies have shown that\nthese models contain biases that do not accurately reflect reality, especially\nfor minority groups. Despite various efforts to improve the detection of sexist\ncontent, this task remains a significant challenge due to its subjective nature\nand the biases present in automated models. We explore the capabilities of\ndifferent LLMs to detect sexism in social media text using the EXIST 2024 tweet\ndataset. It includes annotations from six distinct profiles for each tweet,\nallowing us to evaluate to what extent LLMs can mimic these groups' perceptions\nin sexism detection. Additionally, we analyze the demographic biases present in\nthe models and conduct a statistical analysis to identify which demographic\ncharacteristics (age, gender) contribute most effectively to this task. Our\nresults show that, while LLMs can to some extent detect sexism when considering\nthe overall opinion of populations, they do not accurately replicate the\ndiversity of perceptions among different demographic groups. This highlights\nthe need for better-calibrated models that account for the diversity of\nperspectives across different populations.",
        "url": "http://arxiv.org/abs/2508.18245v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18245v1",
        "arxiv_id": "2508.18245v1",
        "authors": [
            "Judith Tavarez-Rodríguez",
            "Fernando Sánchez-Vega",
            "A. Pastor López-Monroy"
        ],
        "submitted": "2025-08-25 17:36:58",
        "source": "arxiv",
        "comment": "This work was presented as a poster at the Latin American Meeting in\n  Artificial Intelligence KHIPU 2025, Santiago, Chile, March 10th - 14th 2025,\n  https://khipu.ai/khipu2025/poster-sessions-2025/"
    },
    {
        "title": "Better Language Model-Based Judging Reward Modeling through Scaling Comprehension Boundaries",
        "abstract": "The emergence of LM-based judging reward modeling, represented by generative\nreward models, has successfully made reinforcement learning from AI feedback\n(RLAIF) efficient and scalable. To further advance this paradigm, we propose a\ncore insight: this form of reward modeling shares fundamental formal\nconsistency with natural language inference (NLI), a core task in natural\nlanguage understanding. This reframed perspective points to a key path for\nbuilding superior reward models: scaling the model's comprehension boundaries.\nPursuing this path, exploratory experiments on NLI tasks demonstrate that the\nslot prediction masked language models (MLMs) incorporating contextual\nexplanations achieve significantly better performance compared to mainstream\nautoregressive models. Based on this key finding, we propose ESFP-RM, a\ntwo-stage LM-based judging reward model that utilizes an explanation based slot\nframework for prediction to fully leverage the advantages of MLMs. Extensive\nexperiments demonstrate that in both reinforcement learning from human feedback\n(RLHF) and out-of-distribution (OOD) scenarios, the ESFP-RM framework delivers\nmore stable and generalizable reward signals compared to generative reward\nmodels.",
        "url": "http://arxiv.org/abs/2508.18212v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18212v1",
        "arxiv_id": "2508.18212v1",
        "authors": [
            "Meiling Ning",
            "Zhongbao Zhang",
            "Junda Ye",
            "Jiabao Guo",
            "Qingyuan Guan"
        ],
        "submitted": "2025-08-25 17:11:28",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Why Synthetic Isn't Real Yet: A Diagnostic Framework for Contact Center Dialogue Generation",
        "abstract": "Synthetic transcript generation is critical in contact center domains, where\nprivacy and data scarcity limit model training and evaluation. Unlike prior\nsynthetic dialogue generation work on open-domain or medical dialogues, contact\ncenter conversations are goal-oriented, role-asymmetric, and behaviorally\ncomplex, featuring disfluencies, ASR noise, and compliance-driven agent\nactions. In deployments where transcripts are unavailable, standard pipelines\nstill yield derived call attributes such as Intent Summaries, Topic Flow, and\nQA Evaluation Forms. We leverage these as supervision signals to guide\ngeneration. To assess the quality of such outputs, we introduce a diagnostic\nframework of 18 linguistically and behaviorally grounded metrics for comparing\nreal and synthetic transcripts. We benchmark four language-agnostic generation\nstrategies, from simple prompting to characteristic-aware multi-stage\napproaches, alongside reference-free baselines. Results reveal persistent\nchallenges: no method excels across all traits, with notable deficits in\ndisfluency, sentiment, and behavioral realism. Our diagnostic tool exposes\nthese gaps, enabling fine-grained evaluation and stress testing of synthetic\ndialogue across languages.",
        "url": "http://arxiv.org/abs/2508.18210v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18210v1",
        "arxiv_id": "2508.18210v1",
        "authors": [
            "Rishikesh Devanathan",
            "Varun Nathan",
            "Ayush Kumar"
        ],
        "submitted": "2025-08-25 17:10:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Exploring the Interplay between Musical Preferences and Personality through the Lens of Language",
        "abstract": "Music serves as a powerful reflection of individual identity, often aligning\nwith deeper psychological traits. Prior research has established correlations\nbetween musical preferences and personality traits, while separate studies have\ndemonstrated that personality is detectable through linguistic analysis. Our\nstudy bridges these two research domains by investigating whether individuals'\nmusical preferences are recognizable in their spontaneous language through the\nlens of the Big Five personality traits (Openness, Conscientiousness,\nExtroversion, Agreeableness, and Neuroticism). Using a carefully curated\ndataset of over 500,000 text samples from nearly 5,000 authors with reliably\nidentified musical preferences, we build advanced models to assess personality\ncharacteristics. Our results reveal significant personality differences across\nfans of five musical genres. We release resources for future research at the\nintersection of computational linguistics, music psychology and personality\nanalysis.",
        "url": "http://arxiv.org/abs/2508.18208v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18208v1",
        "arxiv_id": "2508.18208v1",
        "authors": [
            "Eliran Shem-Tov",
            "Ella Rabinovich"
        ],
        "submitted": "2025-08-25 17:10:08",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Unraveling the cognitive patterns of Large Language Models through module communities",
        "abstract": "Large Language Models (LLMs) have reshaped our world with significant\nadvancements in science, engineering, and society through applications ranging\nfrom scientific discoveries and medical diagnostics to Chatbots. Despite their\nubiquity and utility, the underlying mechanisms of LLM remain concealed within\nbillions of parameters and complex structures, making their inner architecture\nand cognitive processes challenging to comprehend. We address this gap by\nadopting approaches to understanding emerging cognition in biology and\ndeveloping a network-based framework that links cognitive skills, LLM\narchitectures, and datasets, ushering in a paradigm shift in foundation model\nanalysis. The skill distribution in the module communities demonstrates that\nwhile LLMs do not strictly parallel the focalized specialization observed in\nspecific biological systems, they exhibit unique communities of modules whose\nemergent skill patterns partially mirror the distributed yet interconnected\ncognitive organization seen in avian and small mammalian brains. Our numerical\nresults highlight a key divergence from biological systems to LLMs, where skill\nacquisition benefits substantially from dynamic, cross-regional interactions\nand neural plasticity. By integrating cognitive science principles with machine\nlearning, our framework provides new insights into LLM interpretability and\nsuggests that effective fine-tuning strategies should leverage distributed\nlearning dynamics rather than rigid modular interventions.",
        "url": "http://arxiv.org/abs/2508.18192v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18192v1",
        "arxiv_id": "2508.18192v1",
        "authors": [
            "Kushal Raj Bhandari",
            "Pin-Yu Chen",
            "Jianxi Gao"
        ],
        "submitted": "2025-08-25 16:49:38",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ST-Raptor: LLM-Powered Semi-Structured Table Question Answering",
        "abstract": "Semi-structured tables, widely used in real-world applications (e.g.,\nfinancial reports, medical records, transactional orders), often involve\nflexible and complex layouts (e.g., hierarchical headers and merged cells).\nThese tables generally rely on human analysts to interpret table layouts and\nanswer relevant natural language questions, which is costly and inefficient. To\nautomate the procedure, existing methods face significant challenges. First,\nmethods like NL2SQL require converting semi-structured tables into structured\nones, which often causes substantial information loss. Second, methods like\nNL2Code and multi-modal LLM QA struggle to understand the complex layouts of\nsemi-structured tables and cannot accurately answer corresponding questions. To\nthis end, we propose ST-Raptor, a tree-based framework for semi-structured\ntable question answering using large language models. First, we introduce the\nHierarchical Orthogonal Tree (HO-Tree), a structural model that captures\ncomplex semi-structured table layouts, along with an effective algorithm for\nconstructing the tree. Second, we define a set of basic tree operations to\nguide LLMs in executing common QA tasks. Given a user question, ST-Raptor\ndecomposes it into simpler sub-questions, generates corresponding tree\noperation pipelines, and conducts operation-table alignment for accurate\npipeline execution. Third, we incorporate a two-stage verification mechanism:\nforward validation checks the correctness of execution steps, while backward\nvalidation evaluates answer reliability by reconstructing queries from\npredicted answers. To benchmark the performance, we present SSTQA, a dataset of\n764 questions over 102 real-world semi-structured tables. Experiments show that\nST-Raptor outperforms nine baselines by up to 20% in answer accuracy. The code\nis available at https://github.com/weAIDB/ST-Raptor.",
        "url": "http://arxiv.org/abs/2508.18190v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18190v1",
        "arxiv_id": "2508.18190v1",
        "authors": [
            "Zirui Tang",
            "Boyu Niu",
            "Xuanhe Zhou",
            "Boxiu Li",
            "Wei Zhou",
            "Jiannan Wang",
            "Guoliang Li",
            "Xinyi Zhang",
            "Fan Wu"
        ],
        "submitted": "2025-08-25 16:48:51",
        "source": "arxiv",
        "comment": "Extension of our SIGMOD 2026 paper. Please refer to source code\n  available at: https://github.com/weAIDB/ST-Raptor"
    },
    {
        "title": "Leveraging Large Language Models for Accurate Sign Language Translation in Low-Resource Scenarios",
        "abstract": "Translating natural languages into sign languages is a highly complex and\nunderexplored task. Despite growing interest in accessibility and inclusivity,\nthe development of robust translation systems remains hindered by the limited\navailability of parallel corpora which align natural language with sign\nlanguage data. Existing methods often struggle to generalize in these\ndata-scarce environments, as the few datasets available are typically\ndomain-specific, lack standardization, or fail to capture the full linguistic\nrichness of sign languages. To address this limitation, we propose Advanced Use\nof LLMs for Sign Language Translation (AulSign), a novel method that leverages\nLarge Language Models via dynamic prompting and in-context learning with sample\nselection and subsequent sign association. Despite their impressive abilities\nin processing text, LLMs lack intrinsic knowledge of sign languages; therefore,\nthey are unable to natively perform this kind of translation. To overcome this\nlimitation, we associate the signs with compact descriptions in natural\nlanguage and instruct the model to use them. We evaluate our method on both\nEnglish and Italian languages using SignBank+, a recognized benchmark in the\nfield, as well as the Italian LaCAM CNR-ISTC dataset. We demonstrate superior\nperformance compared to state-of-the-art models in low-data scenario. Our\nfindings demonstrate the effectiveness of AulSign, with the potential to\nenhance accessibility and inclusivity in communication technologies for\nunderrepresented linguistic communities.",
        "url": "http://arxiv.org/abs/2508.18183v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18183v1",
        "arxiv_id": "2508.18183v1",
        "authors": [
            "Luana Bulla",
            "Gabriele Tuccio",
            "Misael Mongiovì",
            "Aldo Gangemi"
        ],
        "submitted": "2025-08-25 16:36:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Improving End-to-End Training of Retrieval-Augmented Generation Models via Joint Stochastic Approximation",
        "abstract": "Retrieval-augmented generation (RAG) has become a widely recognized paradigm\nto combine parametric memory with non-parametric memories. An RAG model\nconsists of two serial connecting components (retriever and generator). A major\nchallenge in end-to-end optimization of the RAG model is that marginalization\nover relevant passages (modeled as discrete latent variables) from a knowledge\nbase is required. Traditional top-K marginalization and variational RAG (VRAG)\nsuffer from biased or high-variance gradient estimates. In this paper, we\npropose and develop joint stochastic approximation (JSA) based end-to-end\ntraining of RAG, which is referred to as JSA-RAG. The JSA algorithm is a\nstochastic extension of the EM (expectation-maximization) algorithm and is\nparticularly powerful in estimating discrete latent variable models. Extensive\nexperiments are conducted on five datasets for two tasks (open-domain question\nanswering, knowledge-grounded dialogs) and show that JSA-RAG significantly\noutperforms both vanilla RAG and VRAG. Further analysis shows the efficacy of\nJSA-RAG from the perspectives of generation, retrieval, and low-variance\ngradient estimate.",
        "url": "http://arxiv.org/abs/2508.18168v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18168v1",
        "arxiv_id": "2508.18168v1",
        "authors": [
            "Hongyu Cao",
            "Yuxuan Wu",
            "Yucheng Cai",
            "Xianyu Zhao",
            "Zhijian Ou"
        ],
        "submitted": "2025-08-25 16:17:16",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DiscussLLM: Teaching Large Language Models When to Speak",
        "abstract": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nunderstanding and generating human-like text, yet they largely operate as\nreactive agents, responding only when directly prompted. This passivity creates\nan \"awareness gap,\" limiting their potential as truly collaborative partners in\ndynamic human discussions. We introduce $\\textit{DiscussLLM}$, a framework\ndesigned to bridge this gap by training models to proactively decide not just\n$\\textit{what}$ to say, but critically, $\\textit{when}$ to speak. Our primary\ncontribution is a scalable two-stage data generation pipeline that synthesizes\na large-scale dataset of realistic multi-turn human discussions. Each\ndiscussion is annotated with one of five intervention types (e.g., Factual\nCorrection, Concept Definition) and contains an explicit conversational trigger\nwhere an AI intervention adds value. By training models to predict a special\nsilent token when no intervention is needed, they learn to remain quiet until a\nhelpful contribution can be made. We explore two architectural baselines: an\nintegrated end-to-end model and a decoupled classifier-generator system\noptimized for low-latency inference. We evaluate these models on their ability\nto accurately time interventions and generate helpful responses, paving the way\nfor more situationally aware and proactive conversational AI.",
        "url": "http://arxiv.org/abs/2508.18167v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18167v1",
        "arxiv_id": "2508.18167v1",
        "authors": [
            "Deep Anil Patel",
            "Iain Melvin",
            "Christopher Malon",
            "Martin Renqiang Min"
        ],
        "submitted": "2025-08-25 16:16:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "PCR-CA: Parallel Codebook Representations with Contrastive Alignment for Multiple-Category App Recommendation",
        "abstract": "Modern app store recommender systems struggle with multiple-category apps, as\ntraditional taxonomies fail to capture overlapping semantics, leading to\nsuboptimal personalization. We propose PCR-CA (Parallel Codebook\nRepresentations with Contrastive Alignment), an end-to-end framework for\nimproved CTR prediction. PCR-CA first extracts compact multimodal embeddings\nfrom app text, then introduces a Parallel Codebook VQ-AE module that learns\ndiscrete semantic representations across multiple codebooks in parallel --\nunlike hierarchical residual quantization (RQ-VAE). This design enables\nindependent encoding of diverse aspects (e.g., gameplay, art style), better\nmodeling multiple-category semantics. To bridge semantic and collaborative\nsignals, we employ a contrastive alignment loss at both the user and item\nlevels, enhancing representation learning for long-tail items. Additionally, a\ndual-attention fusion mechanism combines ID-based and semantic features to\ncapture user interests, especially for long-tail apps. Experiments on a\nlarge-scale dataset show PCR-CA achieves a +0.76% AUC improvement over strong\nbaselines, with +2.15% AUC gains for long-tail apps. Online A/B testing further\nvalidates our approach, showing a +10.52% lift in CTR and a +16.30% improvement\nin CVR, demonstrating PCR-CA's effectiveness in real-world deployment. The new\nframework has now been fully deployed on the Microsoft Store.",
        "url": "http://arxiv.org/abs/2508.18166v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18166v1",
        "arxiv_id": "2508.18166v1",
        "authors": [
            "Bin Tan",
            "Wangyao Ge",
            "Yidi Wang",
            "Xin Liu",
            "Jeff Burtoft",
            "Hao Fan",
            "Hui Wang"
        ],
        "submitted": "2025-08-25 16:16:06",
        "source": "arxiv",
        "comment": "9 pages, 4 figures, conference"
    },
    {
        "title": "S2Sent: Nested Selectivity Aware Sentence Representation Learning",
        "abstract": "The combination of Transformer-based encoders with contrastive learning\nrepresents the current mainstream paradigm for sentence representation\nlearning. This paradigm is typically based on the hidden states of the last\nTransformer block of the encoder. However, within Transformer-based encoders,\ndifferent blocks exhibit varying degrees of semantic perception ability. From\nthe perspective of interpretability, the semantic perception potential of\nknowledge neurons is modulated by stimuli, thus rational cross-block\nrepresentation fusion is a direction worth optimizing. To balance the semantic\nredundancy and loss across block fusion, we propose a sentence representation\nselection mechanism S\\textsuperscript{2}Sent, which integrates a parameterized\nnested selector downstream of the Transformer-based encoder. This selector\nperforms spatial selection (SS) and nested frequency selection (FS) from a\nmodular perspective. The SS innovatively employs a spatial squeeze based\nself-gating mechanism to obtain adaptive weights, which not only achieves\nfusion with low information redundancy but also captures the dependencies\nbetween embedding features. The nested FS replaces GAP with different DCT basis\nfunctions to achieve spatial squeeze with low semantic loss. Extensive\nexperiments have demonstrated that S\\textsuperscript{2}Sent achieves\nsignificant improvements over baseline methods with negligible additional\nparameters and inference latency, while highlighting high integrability and\nscalability.",
        "url": "http://arxiv.org/abs/2508.18164v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18164v1",
        "arxiv_id": "2508.18164v1",
        "authors": [
            "Jianxiang Zang",
            "Nijia Mo",
            "Yonda Wei",
            "Meiling Ning",
            "Hui Liu"
        ],
        "submitted": "2025-08-25 16:13:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Mirroring Users: Towards Building Preference-aligned User Simulator with User Feedback in Recommendation",
        "abstract": "User simulation is increasingly vital to develop and evaluate recommender\nsystems (RSs). While Large Language Models (LLMs) offer promising avenues to\nsimulate user behavior, they often struggle with the absence of specific domain\nalignment required for RSs and the efficiency demands of large-scale\nsimulation. A vast yet underutilized resource for enhancing this alignment is\nthe extensive user feedback inherent in RSs. However, directly leveraging such\nfeedback presents two significant challenges. First, user feedback in RSs is\noften ambiguous and noisy, which negatively impacts effective preference\nalignment. Second, the massive volume of feedback largely hinders the\nefficiency of preference alignment, necessitating an efficient filtering\nmechanism to identify more informative samples. To overcome these hurdles, we\nintroduce a novel data construction framework that leverages user feedback in\nRSs with advanced LLM capabilities to generate high-quality simulation data.\nOur framework unfolds in two key phases: (1) employing LLMs to generate\ncognitive decision-making processes on constructed simulation samples, reducing\nambiguity in raw user feedback; (2) data distillation based on uncertainty\nestimation and behavior sampling to filter challenging yet denoised simulation\nsamples. Accordingly, we fine-tune lightweight LLMs, as user simulators, using\nsuch high-quality dataset with corresponding decision-making processes.\nExtensive experiments verify that our framework significantly boosts the\nalignment with human preferences and in-domain reasoning capabilities of\nfine-tuned LLMs, and provides more insightful and interpretable signals when\ninteracting with RSs. We believe our work will advance the RS community and\noffer valuable insights for broader human-centric AI research.",
        "url": "http://arxiv.org/abs/2508.18142v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18142v1",
        "arxiv_id": "2508.18142v1",
        "authors": [
            "Tianjun Wei",
            "Huizhong Guo",
            "Yingpeng Du",
            "Zhu Sun",
            "Chen Huang",
            "Dongxia Wang",
            "Jie Zhang"
        ],
        "submitted": "2025-08-25 15:51:24",
        "source": "arxiv",
        "comment": "Github: https://github.com/UserMirrorer/UserMirrorer"
    },
    {
        "title": "Test-Time Scaling Strategies for Generative Retrieval in Multimodal Conversational Recommendations",
        "abstract": "The rapid evolution of e-commerce has exposed the limitations of traditional\nproduct retrieval systems in managing complex, multi-turn user interactions.\nRecent advances in multimodal generative retrieval -- particularly those\nleveraging multimodal large language models (MLLMs) as retrievers -- have shown\npromise. However, most existing methods are tailored to single-turn scenarios\nand struggle to model the evolving intent and iterative nature of multi-turn\ndialogues when applied naively. Concurrently, test-time scaling has emerged as\na powerful paradigm for improving large language model (LLM) performance\nthrough iterative inference-time refinement. Yet, its effectiveness typically\nrelies on two conditions: (1) a well-defined problem space (e.g., mathematical\nreasoning), and (2) the model's ability to self-correct -- conditions that are\nrarely met in conversational product search. In this setting, user queries are\noften ambiguous and evolving, and MLLMs alone have difficulty grounding\nresponses in a fixed product corpus. Motivated by these challenges, we propose\na novel framework that introduces test-time scaling into conversational\nmultimodal product retrieval. Our approach builds on a generative retriever,\nfurther augmented with a test-time reranking (TTR) mechanism that improves\nretrieval accuracy and better aligns results with evolving user intent\nthroughout the dialogue. Experiments across multiple benchmarks show consistent\nimprovements, with average gains of 14.5 points in MRR and 10.6 points in\nnDCG@1.",
        "url": "http://arxiv.org/abs/2508.18132v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18132v1",
        "arxiv_id": "2508.18132v1",
        "authors": [
            "Hung-Chun Hsu",
            "Yuan-Ching Kuo",
            "Chao-Han Huck Yang",
            "Szu-Wei Fu",
            "Hanrong Ye",
            "Hongxu Yin",
            "Yu-Chiang Frank Wang",
            "Ming-Feng Tsai",
            "Chuan-Ju Wang"
        ],
        "submitted": "2025-08-25 15:38:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "HLLM-Creator: Hierarchical LLM-based Personalized Creative Generation",
        "abstract": "AI-generated content technologies are widely used in content creation.\nHowever, current AIGC systems rely heavily on creators' inspiration, rarely\ngenerating truly user-personalized content. In real-world applications such as\nonline advertising, a single product may have multiple selling points, with\ndifferent users focusing on different features. This underscores the\nsignificant value of personalized, user-centric creative generation. Effective\npersonalized content generation faces two main challenges: (1) accurately\nmodeling user interests and integrating them into the content generation\nprocess while adhering to factual constraints, and (2) ensuring high efficiency\nand scalability to handle the massive user base in industrial scenarios.\nAdditionally, the scarcity of personalized creative data in practice\ncomplicates model training, making data construction another key hurdle. We\npropose HLLM-Creator, a hierarchical LLM framework for efficient user interest\nmodeling and personalized content generation. During inference, a combination\nof user clustering and a user-ad-matching-prediction based pruning strategy is\nemployed to significantly enhance generation efficiency and reduce\ncomputational overhead, making the approach suitable for large-scale\ndeployment. Moreover, we design a data construction pipeline based on\nchain-of-thought reasoning, which generates high-quality, user-specific\ncreative titles and ensures factual consistency despite limited personalized\ndata. This pipeline serves as a critical foundation for the effectiveness of\nour model. Extensive experiments on personalized title generation for Douyin\nSearch Ads show the effectiveness of HLLM-Creator. Online A/B test shows a\n0.476% increase on Adss, paving the way for more effective and efficient\npersonalized generation in industrial scenarios. Codes for academic dataset are\navailable at https://github.com/bytedance/HLLM.",
        "url": "http://arxiv.org/abs/2508.18118v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18118v1",
        "arxiv_id": "2508.18118v1",
        "authors": [
            "Junyi Chen",
            "Lu Chi",
            "Siliang Xu",
            "Shiwei Ran",
            "Bingyue Peng",
            "Zehuan Yuan"
        ],
        "submitted": "2025-08-25 15:23:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The AI Data Scientist",
        "abstract": "Imagine decision-makers uploading data and, within minutes, receiving clear,\nactionable insights delivered straight to their fingertips. That is the promise\nof the AI Data Scientist, an autonomous Agent powered by large language models\n(LLMs) that closes the gap between evidence and action. Rather than simply\nwriting code or responding to prompts, it reasons through questions, tests\nideas, and delivers end-to-end insights at a pace far beyond traditional\nworkflows. Guided by the scientific tenet of the hypothesis, this Agent\nuncovers explanatory patterns in data, evaluates their statistical\nsignificance, and uses them to inform predictive modeling. It then translates\nthese results into recommendations that are both rigorous and accessible. At\nthe core of the AI Data Scientist is a team of specialized LLM Subagents, each\nresponsible for a distinct task such as data cleaning, statistical testing,\nvalidation, and plain-language communication. These Subagents write their own\ncode, reason about causality, and identify when additional data is needed to\nsupport sound conclusions. Together, they achieve in minutes what might\notherwise take days or weeks, enabling a new kind of interaction that makes\ndeep data science both accessible and actionable.",
        "url": "http://arxiv.org/abs/2508.18113v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18113v1",
        "arxiv_id": "2508.18113v1",
        "authors": [
            "Farkhad Akimov",
            "Munachiso Samuel Nwadike",
            "Zangir Iklassov",
            "Martin Takáč"
        ],
        "submitted": "2025-08-25 15:21:49",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SentiMM: A Multimodal Multi-Agent Framework for Sentiment Analysis in Social Media",
        "abstract": "With the increasing prevalence of multimodal content on social media,\nsentiment analysis faces significant challenges in effectively processing\nheterogeneous data and recognizing multi-label emotions. Existing methods often\nlack effective cross-modal fusion and external knowledge integration. We\npropose SentiMM, a novel multi-agent framework designed to systematically\naddress these challenges. SentiMM processes text and visual inputs through\nspecialized agents, fuses multimodal features, enriches context via knowledge\nretrieval, and aggregates results for final sentiment classification. We also\nintroduce SentiMMD, a large-scale multimodal dataset with seven fine-grained\nsentiment categories. Extensive experiments demonstrate that SentiMM achieves\nsuperior performance compared to state-of-the-art baselines, validating the\neffectiveness of our structured approach.",
        "url": "http://arxiv.org/abs/2508.18108v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18108v1",
        "arxiv_id": "2508.18108v1",
        "authors": [
            "Xilai Xu",
            "Zilin Zhao",
            "Chengye Song",
            "Zining Wang",
            "Jinhe Qiang",
            "Jiongrui Yan",
            "Yuhuai Lin"
        ],
        "submitted": "2025-08-25 15:17:53",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Detecting and Characterizing Planning in Language Models",
        "abstract": "Modern large language models (LLMs) have demonstrated impressive performance\nacross a wide range of multi-step reasoning tasks. Recent work suggests that\nLLMs may perform planning - selecting a future target token in advance and\ngenerating intermediate tokens that lead towards it - rather than merely\nimprovising one token at a time. However, existing studies assume fixed\nplanning horizons and often focus on single prompts or narrow domains. To\ndistinguish planning from improvisation across models and tasks, we present\nformal and causally grounded criteria for detecting planning and operationalize\nthem as a semi-automated annotation pipeline. We apply this pipeline to both\nbase and instruction-tuned Gemma-2-2B models on the MBPP code generation\nbenchmark and a poem generation task where Claude 3.5 Haiku was previously\nshown to plan. Our findings show that planning is not universal: unlike Haiku,\nGemma-2-2B solves the same poem generation task through improvisation, and on\nMBPP it switches between planning and improvisation across similar tasks and\neven successive token predictions. We further show that instruction tuning\nrefines existing planning behaviors in the base model rather than creating them\nfrom scratch. Together, these studies provide a reproducible and scalable\nfoundation for mechanistic studies of planning in LLMs.",
        "url": "http://arxiv.org/abs/2508.18098v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18098v1",
        "arxiv_id": "2508.18098v1",
        "authors": [
            "Jatin Nainani",
            "Sankaran Vaidyanathan",
            "Connor Watts",
            "Andre N. Assis",
            "Alice Rigg"
        ],
        "submitted": "2025-08-25 14:59:46",
        "source": "arxiv",
        "comment": "9 pages, 4 figures"
    },
    {
        "title": "Agri-Query: A Case Study on RAG vs. Long-Context LLMs for Cross-Lingual Technical Question Answering",
        "abstract": "We present a case study evaluating large language models (LLMs) with\n128K-token context windows on a technical question answering (QA) task. Our\nbenchmark is built on a user manual for an agricultural machine, available in\nEnglish, French, and German. It simulates a cross-lingual information retrieval\nscenario where questions are posed in English against all three language\nversions of the manual. The evaluation focuses on realistic\n\"needle-in-a-haystack\" challenges and includes unanswerable questions to test\nfor hallucinations. We compare nine long-context LLMs using direct prompting\nagainst three Retrieval-Augmented Generation (RAG) strategies (keyword,\nsemantic, hybrid), with an LLM-as-a-judge for evaluation. Our findings for this\nspecific manual show that Hybrid RAG consistently outperforms direct\nlong-context prompting. Models like Gemini 2.5 Flash and the smaller Qwen 2.5\n7B achieve high accuracy (over 85%) across all languages with RAG. This paper\ncontributes a detailed analysis of LLM performance in a specialized industrial\ndomain and an open framework for similar evaluations, highlighting practical\ntrade-offs and challenges.",
        "url": "http://arxiv.org/abs/2508.18093v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18093v1",
        "arxiv_id": "2508.18093v1",
        "authors": [
            "Julius Gun",
            "Timo Oksanen"
        ],
        "submitted": "2025-08-25 14:54:46",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Speech-Based Depressive Mood Detection in the Presence of Multiple Sclerosis: A Cross-Corpus and Cross-Lingual Study",
        "abstract": "Depression commonly co-occurs with neurodegenerative disorders like Multiple\nSclerosis (MS), yet the potential of speech-based Artificial Intelligence for\ndetecting depression in such contexts remains unexplored. This study examines\nthe transferability of speech-based depression detection methods to people with\nMS (pwMS) through cross-corpus and cross-lingual analysis using English data\nfrom the general population and German data from pwMS. Our approach implements\nsupervised machine learning models using: 1) conventional speech and language\nfeatures commonly used in the field, 2) emotional dimensions derived from a\nSpeech Emotion Recognition (SER) model, and 3) exploratory speech feature\nanalysis. Despite limited data, our models detect depressive mood in pwMS with\nmoderate generalisability, achieving a 66% Unweighted Average Recall (UAR) on a\nbinary task. Feature selection further improved performance, boosting UAR to\n74%. Our findings also highlight the relevant role emotional changes have as an\nindicator of depressive mood in both the general population and within PwMS.\nThis study provides an initial exploration into generalising speech-based\ndepression detection, even in the presence of co-occurring conditions, such as\nneurodegenerative diseases.",
        "url": "http://arxiv.org/abs/2508.18092v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18092v1",
        "arxiv_id": "2508.18092v1",
        "authors": [
            "Monica Gonzalez-Machorro",
            "Uwe Reichel",
            "Pascal Hecker",
            "Helly Hammer",
            "Hesam Sagha",
            "Florian Eyben",
            "Robert Hoepner",
            "Björn W. Schuller"
        ],
        "submitted": "2025-08-25 14:54:13",
        "source": "arxiv",
        "comment": "Accepted at the 8th International Conference on Natural Language and\n  Speech Processing (ICNLSP 2025). To be appeared in the corresponding\n  Proceedings at ACL Anthology"
    },
    {
        "title": "Named Entity Recognition of Historical Text via Large Language Model",
        "abstract": "Large language models have demonstrated remarkable versatility across a wide\nrange of natural language processing tasks and domains. One such task is Named\nEntity Recognition (NER), which involves identifying and classifying proper\nnames in text, such as people, organizations, locations, dates, and other\nspecific entities. NER plays a crucial role in extracting information from\nunstructured textual data, enabling downstream applications such as information\nretrieval from unstructured text.\n  Traditionally, NER is addressed using supervised machine learning approaches,\nwhich require large amounts of annotated training data. However, historical\ntexts present a unique challenge, as the annotated datasets are often scarce or\nnonexistent, due to the high cost and expertise required for manual labeling.\nIn addition, the variability and noise inherent in historical language, such as\ninconsistent spelling and archaic vocabulary, further complicate the\ndevelopment of reliable NER systems for these sources.\n  In this study, we explore the feasibility of applying LLMs to NER in\nhistorical documents using zero-shot and few-shot prompting strategies, which\nrequire little to no task-specific training data. Our experiments, conducted on\nthe HIPE-2022 (Identifying Historical People, Places and other Entities)\ndataset, show that LLMs can achieve reasonably strong performance on NER tasks\nin this setting. While their performance falls short of fully supervised models\ntrained on domain-specific annotations, the results are nevertheless promising.\nThese findings suggest that LLMs offer a viable and efficient alternative for\ninformation extraction in low-resource or historically significant corpora,\nwhere traditional supervised methods are infeasible.",
        "url": "http://arxiv.org/abs/2508.18090v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18090v1",
        "arxiv_id": "2508.18090v1",
        "authors": [
            "Shibingfeng Zhang",
            "Giovanni Colavizza"
        ],
        "submitted": "2025-08-25 14:52:11",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "How Quantization Shapes Bias in Large Language Models",
        "abstract": "This work presents a comprehensive evaluation of how quantization affects\nmodel bias, with particular attention to its impact on individual demographic\nsubgroups. We focus on weight and activation quantization strategies and\nexamine their effects across a broad range of bias types, including\nstereotypes, toxicity, sentiment, and fairness. We employ both probabilistic\nand generated text-based metrics across nine benchmarks and evaluate models\nvarying in architecture family and reasoning ability. Our findings show that\nquantization has a nuanced impact on bias: while it can reduce model toxicity\nand does not significantly impact sentiment, it tends to slightly increase\nstereotypes and unfairness in generative tasks, especially under aggressive\ncompression. These trends are generally consistent across demographic\ncategories and model types, although their magnitude depends on the specific\nsetting. Overall, our results highlight the importance of carefully balancing\nefficiency and ethical considerations when applying quantization in practice.",
        "url": "http://arxiv.org/abs/2508.18088v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18088v1",
        "arxiv_id": "2508.18088v1",
        "authors": [
            "Federico Marcuzzi",
            "Xuefei Ning",
            "Roy Schwartz",
            "Iryna Gurevych"
        ],
        "submitted": "2025-08-25 14:48:26",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Neither Valid nor Reliable? Investigating the Use of LLMs as Judges",
        "abstract": "Evaluating natural language generation (NLG) systems remains a core challenge\nof natural language processing (NLP), further complicated by the rise of large\nlanguage models (LLMs) that aims to be general-purpose. Recently, large\nlanguage models as judges (LLJs) have emerged as a promising alternative to\ntraditional metrics, but their validity remains underexplored. This position\npaper argues that the current enthusiasm around LLJs may be premature, as their\nadoption has outpaced rigorous scrutiny of their reliability and validity as\nevaluators. Drawing on measurement theory from the social sciences, we identify\nand critically assess four core assumptions underlying the use of LLJs: their\nability to act as proxies for human judgment, their capabilities as evaluators,\ntheir scalability, and their cost-effectiveness. We examine how each of these\nassumptions may be challenged by the inherent limitations of LLMs, LLJs, or\ncurrent practices in NLG evaluation. To ground our analysis, we explore three\napplications of LLJs: text summarization, data annotation, and safety\nalignment. Finally, we highlight the need for more responsible evaluation\npractices in LLJs evaluation, to ensure that their growing role in the field\nsupports, rather than undermines, progress in NLG.",
        "url": "http://arxiv.org/abs/2508.18076v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18076v1",
        "arxiv_id": "2508.18076v1",
        "authors": [
            "Khaoula Chehbouni",
            "Mohammed Haddou",
            "Jackie Chi Kit Cheung",
            "Golnoosh Farnadi"
        ],
        "submitted": "2025-08-25 14:43:10",
        "source": "arxiv",
        "comment": "Prepared for conference submission"
    },
    {
        "title": "HyST: LLM-Powered Hybrid Retrieval over Semi-Structured Tabular Data",
        "abstract": "User queries in real-world recommendation systems often combine structured\nconstraints (e.g., category, attributes) with unstructured preferences (e.g.,\nproduct descriptions or reviews). We introduce HyST (Hybrid retrieval over\nSemi-structured Tabular data), a hybrid retrieval framework that combines\nLLM-powered structured filtering with semantic embedding search to support\ncomplex information needs over semi-structured tabular data. HyST extracts\nattribute-level constraints from natural language using large language models\n(LLMs) and applies them as metadata filters, while processing the remaining\nunstructured query components via embedding-based retrieval. Experiments on a\nsemi-structured benchmark show that HyST consistently outperforms tradtional\nbaselines, highlighting the importance of structured filtering in improving\nretrieval precision, offering a scalable and accurate solution for real-world\nuser queries.",
        "url": "http://arxiv.org/abs/2508.18048v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18048v1",
        "arxiv_id": "2508.18048v1",
        "authors": [
            "Jiyoon Myung",
            "Jihyeon Park",
            "Joohyung Han"
        ],
        "submitted": "2025-08-25 14:06:27",
        "source": "arxiv",
        "comment": "Accepted at the 2nd EARL Workshop on Evaluating and Applying\n  Recommender Systems with Large Language Models (RecSys 2025)"
    },
    {
        "title": "Unseen Speaker and Language Adaptation for Lightweight Text-To-Speech with Adapters",
        "abstract": "In this paper we investigate cross-lingual Text-To-Speech (TTS) synthesis\nthrough the lens of adapters, in the context of lightweight TTS systems. In\nparticular, we compare the tasks of unseen speaker and language adaptation with\nthe goal of synthesising a target voice in a target language, in which the\ntarget voice has no recordings therein. Results from objective evaluations\ndemonstrate the effectiveness of adapters in learning language-specific and\nspeaker-specific information, allowing pre-trained models to learn unseen\nspeaker identities or languages, while avoiding catastrophic forgetting of the\noriginal model's speaker or language information. Additionally, to measure how\nnative the generated voices are in terms of accent, we propose and validate an\nobjective metric inspired by mispronunciation detection techniques in\nsecond-language (L2) learners. The paper also provides insights into the impact\nof adapter placement, configuration and the number of speakers used.",
        "url": "http://arxiv.org/abs/2508.18006v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18006v1",
        "arxiv_id": "2508.18006v1",
        "authors": [
            "Alessio Falai",
            "Ziyao Zhang",
            "Akos Gangoly"
        ],
        "submitted": "2025-08-25 13:14:57",
        "source": "arxiv",
        "comment": "Accepted at IEEE MLSP 2025"
    },
    {
        "title": "A Retail-Corpus for Aspect-Based Sentiment Analysis with Large Language Models",
        "abstract": "Aspect-based sentiment analysis enhances sentiment detection by associating\nit with specific aspects, offering deeper insights than traditional sentiment\nanalysis. This study introduces a manually annotated dataset of 10,814\nmultilingual customer reviews covering brick-and-mortar retail stores, labeled\nwith eight aspect categories and their sentiment. Using this dataset, the\nperformance of GPT-4 and LLaMA-3 in aspect based sentiment analysis is\nevaluated to establish a baseline for the newly introduced data. The results\nshow both models achieving over 85% accuracy, while GPT-4 outperforms LLaMA-3\noverall with regard to all relevant metrics.",
        "url": "http://arxiv.org/abs/2508.17994v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17994v1",
        "arxiv_id": "2508.17994v1",
        "authors": [
            "Oleg Silcenco",
            "Marcos R. Machad",
            "Wallace C. Ugulino",
            "Daniel Braun"
        ],
        "submitted": "2025-08-25 13:02:05",
        "source": "arxiv",
        "comment": "Accepted at ICNLSP 2025"
    },
    {
        "title": "German4All - A Dataset and Model for Readability-Controlled Paraphrasing in German",
        "abstract": "The ability to paraphrase texts across different complexity levels is\nessential for creating accessible texts that can be tailored toward diverse\nreader groups. Thus, we introduce German4All, the first large-scale German\ndataset of aligned readability-controlled, paragraph-level paraphrases. It\nspans five readability levels and comprises over 25,000 samples. The dataset is\nautomatically synthesized using GPT-4 and rigorously evaluated through both\nhuman and LLM-based judgments. Using German4All, we train an open-source,\nreadability-controlled paraphrasing model that achieves state-of-the-art\nperformance in German text simplification, enabling more nuanced and\nreader-specific adaptations. We opensource both the dataset and the model to\nencourage further research on multi-level paraphrasing",
        "url": "http://arxiv.org/abs/2508.17973v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17973v1",
        "arxiv_id": "2508.17973v1",
        "authors": [
            "Miriam Anschütz",
            "Thanh Mai Pham",
            "Eslam Nasrallah",
            "Maximilian Müller",
            "Cristian-George Craciun",
            "Georg Groh"
        ],
        "submitted": "2025-08-25 12:40:32",
        "source": "arxiv",
        "comment": "Accepted to INLG 2025"
    },
    {
        "title": "Understanding Subword Compositionality of Large Language Models",
        "abstract": "Large language models (LLMs) take sequences of subwords as input, requiring\nthem to effective compose subword representations into meaningful word-level\nrepresentations. In this paper, we present a comprehensive set of experiments\nto probe how LLMs compose subword information, focusing on three key aspects:\nstructural similarity, semantic decomposability, and form retention. Our\nanalysis of the experiments suggests that these five LLM families can be\nclassified into three distinct groups, likely reflecting difference in their\nunderlying composition strategies. Specifically, we observe (i) three distinct\npatterns in the evolution of structural similarity between subword compositions\nand whole-word representations across layers; (ii) great performance when\nprobing layer by layer their sensitivity to semantic decompositionality; and\n(iii) three distinct patterns when probing sensitivity to formal features,\ne.g., character sequence length. These findings provide valuable insights into\nthe compositional dynamics of LLMs and highlight different compositional\npattens in how LLMs encode and integrate subword information.",
        "url": "http://arxiv.org/abs/2508.17953v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17953v1",
        "arxiv_id": "2508.17953v1",
        "authors": [
            "Qiwei Peng",
            "Yekun Chai",
            "Anders Søgaard"
        ],
        "submitted": "2025-08-25 12:16:56",
        "source": "arxiv",
        "comment": "EMNLP 2025 Main"
    },
    {
        "title": "Debiasing Multilingual LLMs in Cross-lingual Latent Space",
        "abstract": "Debiasing techniques such as SentDebias aim to reduce bias in large language\nmodels (LLMs). Previous studies have evaluated their cross-lingual\ntransferability by directly applying these methods to LLM representations,\nrevealing their limited effectiveness across languages. In this work, we\ntherefore propose to perform debiasing in a joint latent space rather than\ndirectly on LLM representations. We construct a well-aligned cross-lingual\nlatent space using an autoencoder trained on parallel TED talk scripts. Our\nexperiments with Aya-expanse and two debiasing techniques across four languages\n(English, French, German, Dutch) demonstrate that a) autoencoders effectively\nconstruct a well-aligned cross-lingual latent space, and b) applying debiasing\ntechniques in the learned cross-lingual latent space significantly improves\nboth the overall debiasing performance and cross-lingual transferability.",
        "url": "http://arxiv.org/abs/2508.17948v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17948v1",
        "arxiv_id": "2508.17948v1",
        "authors": [
            "Qiwei Peng",
            "Guimin Hu",
            "Yekun Chai",
            "Anders Søgaard"
        ],
        "submitted": "2025-08-25 12:13:37",
        "source": "arxiv",
        "comment": "EMNLP 2025 Main"
    },
    {
        "title": "AMELIA: A Family of Multi-task End-to-end Language Models for Argumentation",
        "abstract": "Argument mining is a subfield of argumentation that aims to automatically\nextract argumentative structures and their relations from natural language\ntexts. This paper investigates how a single large language model can be\nleveraged to perform one or several argument mining tasks. Our contributions\nare two-fold. First, we construct a multi-task dataset by surveying and\nconverting 19 well-known argument mining datasets from the literature into a\nunified format. Second, we explore various training strategies using Meta AI's\nLlama-3.1-8B-Instruct model: (1) fine-tuning on individual tasks, (2)\nfine-tuning jointly on multiple tasks, and (3) merging models fine-tuned\nseparately on individual tasks. Our experiments show that task-specific\nfine-tuning significantly improves individual performance across all tasks.\nMoreover, multi-task fine-tuning maintains strong performance without\ndegradation, suggesting effective transfer learning across related tasks.\nFinally, we demonstrate that model merging offers a viable compromise: it\nyields competitive performance while mitigating the computational costs\nassociated with full multi-task fine-tuning.",
        "url": "http://arxiv.org/abs/2508.17926v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17926v1",
        "arxiv_id": "2508.17926v1",
        "authors": [
            "Henri Savigny",
            "Bruno Yun"
        ],
        "submitted": "2025-08-25 11:51:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Feature-Refined Unsupervised Model for Loanword Detection",
        "abstract": "We propose an unsupervised method for detecting loanwords i.e., words\nborrowed from one language into another. While prior work has primarily relied\non language-external information to identify loanwords, such approaches can\nintroduce circularity and constraints into the historical linguistics workflow.\nIn contrast, our model relies solely on language-internal information to\nprocess both native and borrowed words in monolingual and multilingual\nwordlists. By extracting pertinent linguistic features, scoring them, and\nmapping them probabilistically, we iteratively refine initial results by\nidentifying and generalizing from emerging patterns until convergence. This\nhybrid approach leverages both linguistic and statistical cues to guide the\ndiscovery process. We evaluate our method on the task of isolating loanwords in\ndatasets from six standard Indo-European languages: English, German, French,\nItalian, Spanish, and Portuguese. Experimental results demonstrate that our\nmodel outperforms baseline methods, with strong performance gains observed when\nscaling to cross-linguistic data.",
        "url": "http://arxiv.org/abs/2508.17923v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17923v1",
        "arxiv_id": "2508.17923v1",
        "authors": [
            "Promise Dodzi Kpoglu"
        ],
        "submitted": "2025-08-25 11:42:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Information availability in different languages and various technological constraints related to multilinguism on the Internet",
        "abstract": "The usage of Internet has grown exponentially over the last two decades. The\nnumber of Internet users has grown from 16 Million to 1650 Million from 1995 to\n2010. It has become a major repository of information catering almost every\narea. Since the Internet has its origin in USA which is English speaking\ncountry there is huge dominance of English on the World Wide Web. Although\nEnglish is a globally acceptable language, still there is a huge population in\nthe world which is not able to access the Internet due to language constraints.\nIt has been estimated that only 20-25% of the world population speaks English\nas a native language. More and more people are accessing the Internet nowadays\nremoving the cultural and linguistic barriers and hence there is a high growth\nin the number of non-English speaking users over the last few years on the\nInternet. Although many solutions have been provided to remove the linguistic\nbarriers, still there is a huge gap to be filled. This paper attempts to\nanalyze the need of information availability in different languages and the\nvarious technological constraints related to multi-linguism on the Internet.",
        "url": "http://arxiv.org/abs/2508.17918v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17918v1",
        "arxiv_id": "2508.17918v1",
        "authors": [
            "Sonal Khosla",
            "Haridasa Acharya"
        ],
        "submitted": "2025-08-25 11:35:12",
        "source": "arxiv",
        "comment": "International Journal of Computer Applications"
    },
    {
        "title": "Evaluating the Representation of Vowels in Wav2Vec Feature Extractor: A Layer-Wise Analysis Using MFCCs",
        "abstract": "Automatic Speech Recognition has advanced with self-supervised learning,\nenabling feature extraction directly from raw audio. In Wav2Vec, a CNN first\ntransforms audio into feature vectors before the transformer processes them.\nThis study examines CNN-extracted information for monophthong vowels using the\nTIMIT corpus. We compare MFCCs, MFCCs with formants, and CNN activations by\ntraining SVM classifiers for front-back vowel identification, assessing their\nclassification accuracy to evaluate phonetic representation.",
        "url": "http://arxiv.org/abs/2508.17914v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17914v1",
        "arxiv_id": "2508.17914v1",
        "authors": [
            "Domenico De Cristofaro",
            "Vincenzo Norman Vitale",
            "Alessandro Vietti"
        ],
        "submitted": "2025-08-25 11:30:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Pandora: Leveraging Code-driven Knowledge Transfer for Unified Structured Knowledge Reasoning",
        "abstract": "Unified Structured Knowledge Reasoning (USKR) aims to answer natural language\nquestions by using structured sources such as tables, databases, and knowledge\ngraphs in a unified way. Existing USKR methods rely on task-specific strategies\nor bespoke representations, which hinder their ability to dismantle barriers\nbetween different SKR tasks, thereby constraining their overall performance in\ncross-task scenarios. In this paper, we introduce \\textsc{Pandora}, a novel\nUSKR framework that addresses the limitations of existing methods by leveraging\ntwo key innovations. First, we propose a code-based unified knowledge\nrepresentation using \\textsc{Python}'s \\textsc{Pandas} API, which aligns\nseamlessly with the pre-training of LLMs. This representation facilitates a\ncohesive approach to handling different structured knowledge sources. Building\non this foundation, we employ knowledge transfer to bolster the unified\nreasoning process of LLMs by automatically building cross-task memory. By\nadaptively correcting reasoning using feedback from code execution,\n\\textsc{Pandora} showcases impressive unified reasoning capabilities. Extensive\nexperiments on six widely used benchmarks across three SKR tasks demonstrate\nthat \\textsc{Pandora} outperforms existing unified reasoning frameworks and\ncompetes effectively with task-specific methods.",
        "url": "http://arxiv.org/abs/2508.17905v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17905v1",
        "arxiv_id": "2508.17905v1",
        "authors": [
            "Yongrui Chen",
            "Junhao He",
            "Linbo Fu",
            "Shenyu Zhang",
            "Rihui Jin",
            "Xinbang Dai",
            "Jiaqi Li",
            "Dehai Min",
            "Nan Hu",
            "Yuxin Zhang",
            "Guilin Qi",
            "Yi Huang",
            "Tongtong Wu"
        ],
        "submitted": "2025-08-25 11:22:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Designing Practical Models for Isolated Word Visual Speech Recognition",
        "abstract": "Visual speech recognition (VSR) systems decode spoken words from an input\nsequence using only the video data. Practical applications of such systems\ninclude medical assistance as well as human-machine interactions. A VSR system\nis typically employed in a complementary role in cases where the audio is\ncorrupt or not available. In order to accurately predict the spoken words,\nthese architectures often rely on deep neural networks in order to extract\nmeaningful representations from the input sequence. While deep architectures\nachieve impressive recognition performance, relying on such models incurs\nsignificant computation costs which translates into increased resource demands\nin terms of hardware requirements and results in limited applicability in\nreal-world scenarios where resources might be constrained. This factor prevents\nwider adoption and deployment of speech recognition systems in more practical\napplications. In this work, we aim to alleviate this issue by developing\narchitectures for VSR that have low hardware costs. Following the standard\ntwo-network design paradigm, where one network handles visual feature\nextraction and another one utilizes the extracted features to classify the\nentire sequence, we develop lightweight end-to-end architectures by first\nbenchmarking efficient models from the image classification literature, and\nthen adopting lightweight block designs in a temporal convolution network\nbackbone. We create several unified models with low resource requirements but\nstrong recognition performance. Experiments on the largest public database for\nEnglish words demonstrate the effectiveness and practicality of our developed\nmodels. Code and trained models will be made publicly available.",
        "url": "http://arxiv.org/abs/2508.17894v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17894v1",
        "arxiv_id": "2508.17894v1",
        "authors": [
            "Iason Ioannis Panagos",
            "Giorgos Sfikas",
            "Christophoros Nikou"
        ],
        "submitted": "2025-08-25 11:04:36",
        "source": "arxiv",
        "comment": "Double-column format, 13 pages with references, 2 figures"
    },
    {
        "title": "ILRe: Intermediate Layer Retrieval for Context Compression in Causal Language Models",
        "abstract": "Large Language Models (LLMs) have demonstrated success across many\nbenchmarks. However, they still exhibit limitations in long-context scenarios,\nprimarily due to their short effective context length, quadratic computational\ncomplexity, and high memory overhead when processing lengthy inputs. To\nmitigate these issues, we introduce a novel context compression pipeline,\ncalled Intermediate Layer Retrieval (ILRe), which determines one intermediate\ndecoder layer offline, encodes context by streaming chunked prefill only up to\nthat layer, and recalls tokens by the attention scores between the input query\nand full key cache in that specified layer. In particular, we propose a\nmulti-pooling kernels allocating strategy in the token recalling process to\nmaintain the completeness of semantics. Our approach not only reduces the\nprefilling complexity from $O(L^2)$ to $O(L)$, but also achieves performance\ncomparable to or better than the full context in the long context scenarios.\nWithout additional post training or operator development, ILRe can process a\nsingle $1M$ tokens request in less than half a minute (speedup $\\approx\n180\\times$) and scores RULER-$1M$ benchmark of $\\approx 79.8$ with model\nLlama-3.1-UltraLong-8B-1M-Instruct on a Huawei Ascend 910B NPU.",
        "url": "http://arxiv.org/abs/2508.17892v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17892v1",
        "arxiv_id": "2508.17892v1",
        "authors": [
            "Manlai Liang",
            "Mandi Liu",
            "Jiangzhou Ji",
            "Huaijun Li",
            "Haobo Yang",
            "Yaohan He",
            "Jinlong Li"
        ],
        "submitted": "2025-08-25 10:59:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Speech Discrete Tokens or Continuous Features? A Comparative Analysis for Spoken Language Understanding in SpeechLLMs",
        "abstract": "With the rise of Speech Large Language Models (SpeechLLMs), two dominant\napproaches have emerged for speech processing: discrete tokens and continuous\nfeatures. Each approach has demonstrated strong capabilities in audio-related\nprocessing tasks. However, the performance gap between these two paradigms has\nnot been thoroughly explored. To address this gap, we present a fair comparison\nof self-supervised learning (SSL)-based discrete and continuous features under\nthe same experimental settings. We evaluate their performance across six spoken\nlanguage understanding-related tasks using both small and large-scale LLMs\n(Qwen1.5-0.5B and Llama3.1-8B). We further conduct in-depth analyses, including\nefficient comparison, SSL layer analysis, LLM layer analysis, and robustness\ncomparison. Our findings reveal that continuous features generally outperform\ndiscrete tokens in various tasks. Each speech processing method exhibits\ndistinct characteristics and patterns in how it learns and processes speech\ninformation. We hope our results will provide valuable insights to advance\nspoken language understanding in SpeechLLMs.",
        "url": "http://arxiv.org/abs/2508.17863v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17863v1",
        "arxiv_id": "2508.17863v1",
        "authors": [
            "Dingdong Wang",
            "Junan Li",
            "Mingyu Cui",
            "Dongchao Yang",
            "Xueyuan Chen",
            "Helen Meng"
        ],
        "submitted": "2025-08-25 10:16:07",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025 Main Conference"
    },
    {
        "title": "Retrieval Feedback Memory Enhancement Large Model Retrieval Generation Method",
        "abstract": "Large Language Models (LLMs) have shown remarkable capabilities across\ndiverse tasks, yet they face inherent limitations such as constrained\nparametric knowledge and high retraining costs. Retrieval-Augmented Generation\n(RAG) augments the generation process by retrieving externally stored knowledge\nabsent from the models internal parameters. However, RAG methods face\nchallenges such as information loss and redundant retrievals during multi-round\nqueries, accompanying the difficulties in precisely characterizing knowledge\ngaps for complex tasks. To address these problems, we propose Retrieval\nFeedback and Memory Retrieval Augmented Generation(RFM-RAG), which transforms\nthe stateless retrieval of previous methods into stateful continuous knowledge\nmanagement by constructing a dynamic evidence pool. Specifically, our method\ngenerates refined queries describing the models knowledge gaps using relational\ntriples from questions and evidence from the dynamic evidence pool; Retrieves\ncritical external knowledge to iteratively update this evidence pool; Employs a\nR-Feedback Model to evaluate evidence completeness until convergence. Compared\nto traditional RAG methods, our approach enables persistent storage of\nretrieved passages and effectively distills key information from passages to\nconstruct clearly new queries. Experiments on three public QA benchmarks\ndemonstrate that RFM-RAG outperforms previous methods and improves overall\nsystem accuracy.",
        "url": "http://arxiv.org/abs/2508.17862v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17862v1",
        "arxiv_id": "2508.17862v1",
        "authors": [
            "Leqian Li",
            "Dianxi Shi",
            "Jialu Zhou",
            "Xinyu Wei",
            "Mingyue Yang",
            "Songchang Jin",
            "Shaowu Yang"
        ],
        "submitted": "2025-08-25 10:13:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LexSemBridge: Fine-Grained Dense Representation Enhancement through Token-Aware Embedding Augmentation",
        "abstract": "As queries in retrieval-augmented generation (RAG) pipelines powered by large\nlanguage models (LLMs) become increasingly complex and diverse, dense retrieval\nmodels have demonstrated strong performance in semantic matching. Nevertheless,\nthey often struggle with fine-grained retrieval tasks, where precise keyword\nalignment and span-level localization are required, even in cases with high\nlexical overlap that would intuitively suggest easier retrieval. To\nsystematically evaluate this limitation, we introduce two targeted tasks,\nkeyword retrieval and part-of-passage retrieval, designed to simulate practical\nfine-grained scenarios. Motivated by these observations, we propose\nLexSemBridge, a unified framework that enhances dense query representations\nthrough fine-grained, input-aware vector modulation. LexSemBridge constructs\nlatent enhancement vectors from input tokens using three paradigms: Statistical\n(SLR), Learned (LLR), and Contextual (CLR), and integrates them with dense\nembeddings via element-wise interaction. Theoretically, we show that this\nmodulation preserves the semantic direction while selectively amplifying\ndiscriminative dimensions. LexSemBridge operates as a plug-in without modifying\nthe backbone encoder and naturally extends to both text and vision modalities.\nExtensive experiments across semantic and fine-grained retrieval tasks validate\nthe effectiveness and generality of our approach. All code and models are\npublicly available at https://github.com/Jasaxion/LexSemBridge/",
        "url": "http://arxiv.org/abs/2508.17858v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17858v1",
        "arxiv_id": "2508.17858v1",
        "authors": [
            "Shaoxiong Zhan",
            "Hai Lin",
            "Hongming Tan",
            "Xiaodong Cai",
            "Hai-Tao Zheng",
            "Xin Su",
            "Zifei Shan",
            "Ruitong Liu",
            "Hong-Gee Kim"
        ],
        "submitted": "2025-08-25 10:07:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Beyond Demographics: Enhancing Cultural Value Survey Simulation with Multi-Stage Personality-Driven Cognitive Reasoning",
        "abstract": "Introducing MARK, the Multi-stAge Reasoning frameworK for cultural value\nsurvey response simulation, designed to enhance the accuracy, steerability, and\ninterpretability of large language models in this task. The system is inspired\nby the type dynamics theory in the MBTI psychological framework for personality\nresearch. It effectively predicts and utilizes human demographic information\nfor simulation: life-situational stress analysis, group-level personality\nprediction, and self-weighted cognitive imitation. Experiments on the World\nValues Survey show that MARK outperforms existing baselines by 10% accuracy and\nreduces the divergence between model predictions and human preferences. This\nhighlights the potential of our framework to improve zero-shot personalization\nand help social scientists interpret model predictions.",
        "url": "http://arxiv.org/abs/2508.17855v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17855v1",
        "arxiv_id": "2508.17855v1",
        "authors": [
            "Haijiang Liu",
            "Qiyuan Li",
            "Chao Gao",
            "Yong Cao",
            "Xiangyu Xu",
            "Xun Wu",
            "Daniel Hershcovich",
            "Jinguang Gu"
        ],
        "submitted": "2025-08-25 10:04:23",
        "source": "arxiv",
        "comment": "23 pages, 6 figures, accepted to EMNLP 2025 main"
    },
    {
        "title": "DRQA: Dynamic Reasoning Quota Allocation for Controlling Overthinking in Reasoning Large Language Models",
        "abstract": "Reasoning large language models (RLLMs), such as OpenAI-O3 and DeepSeek-R1,\nhave recently demonstrated remarkable capabilities by performing structured and\nmulti-step reasoning. However, recent studies reveal that RLLMs often suffer\nfrom overthinking, i.e., producing unnecessarily lengthy reasoning chains even\nfor simple questions, leading to excessive token consumption and computational\ninefficiency. Interestingly, we observe that when processing multiple questions\nin batch mode, RLLMs exhibit more resource-efficient behavior by dynamically\ncompressing reasoning steps for easier problems, due to implicit resource\ncompetition. Inspired by this, we propose Dynamic Reasoning Quota Allocation\n(DRQA), a novel method that transfers the benefits of resource competition from\nbatch processing to single-question inference. Specifically, DRQA leverages\nbatch-generated preference data and reinforcement learning to train the model\nto allocate reasoning resources adaptively. By encouraging the model to\ninternalize a preference for responses that are both accurate and concise, DRQA\nenables it to generate concise answers for simple questions while retaining\nsufficient reasoning depth for more challenging ones. Extensive experiments on\na wide range of mathematical and scientific reasoning benchmarks demonstrate\nthat DRQA significantly reduces token usage while maintaining, and in many\ncases improving, answer accuracy. By effectively mitigating the overthinking\nproblem, DRQA offers a promising direction for more efficient and scalable\ndeployment of RLLMs, and we hope it inspires further exploration into\nfine-grained control of reasoning behaviors.",
        "url": "http://arxiv.org/abs/2508.17803v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17803v1",
        "arxiv_id": "2508.17803v1",
        "authors": [
            "Kaiwen Yan",
            "Xuanqing Shi",
            "Hongcheng Guo",
            "Wenxuan Wang",
            "Zhuosheng Zhang",
            "Chengwei Qin"
        ],
        "submitted": "2025-08-25 08:47:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Zero-shot Context Biasing with Trie-based Decoding using Synthetic Multi-Pronunciation",
        "abstract": "Contextual automatic speech recognition (ASR) systems allow for recognizing\nout-of-vocabulary (OOV) words, such as named entities or rare words. However,\nit remains challenging due to limited training data and ambiguous or\ninconsistent pronunciations. In this paper, we propose a synthesis-driven\nmulti-pronunciation contextual biasing method that performs zero-shot\ncontextual ASR on a pretrained Whisper model. Specifically, we leverage\ntext-to-speech (TTS) systems to synthesize diverse speech samples containing\neach target rare word, and then use the pretrained Whisper model to extract\nmultiple predicted pronunciation variants. These variant token sequences are\ncompiled into a prefix-trie, which assigns rewards to beam hypotheses in a\nshallow-fusion manner during beam-search decoding. After which, any recognized\nvariant is mapped back to the original rare word in the final transcription.\nThe evaluation results on the Librispeech dataset show that our method reduces\nbiased word error rate (WER) by 42% on test-clean and 43% on test-other while\nmaintaining unbiased WER essentially unchanged.",
        "url": "http://arxiv.org/abs/2508.17796v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17796v1",
        "arxiv_id": "2508.17796v1",
        "authors": [
            "Changsong Liu",
            "Yizhou Peng",
            "Eng Siong Chng"
        ],
        "submitted": "2025-08-25 08:41:52",
        "source": "arxiv",
        "comment": "Accepted to APSIPA ASC 2025"
    },
    {
        "title": "Proximal Supervised Fine-Tuning",
        "abstract": "Supervised fine-tuning (SFT) of foundation models often leads to poor\ngeneralization, where prior capabilities deteriorate after tuning on new tasks\nor domains. Inspired by trust-region policy optimization (TRPO) and proximal\npolicy optimization (PPO) in reinforcement learning (RL), we propose Proximal\nSFT (PSFT). This fine-tuning objective incorporates the benefits of\ntrust-region, effectively constraining policy drift during SFT while\nmaintaining competitive tuning. By viewing SFT as a special case of policy\ngradient methods with constant positive advantages, we derive PSFT that\nstabilizes optimization and leads to generalization, while leaving room for\nfurther optimization in subsequent post-training stages. Experiments across\nmathematical and human-value domains show that PSFT matches SFT in-domain,\noutperforms it in out-of-domain generalization, remains stable under prolonged\ntraining without causing entropy collapse, and provides a stronger foundation\nfor the subsequent optimization.",
        "url": "http://arxiv.org/abs/2508.17784v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17784v1",
        "arxiv_id": "2508.17784v1",
        "authors": [
            "Wenhong Zhu",
            "Ruobing Xie",
            "Rui Wang",
            "Xingwu Sun",
            "Di Wang",
            "Pengfei Liu"
        ],
        "submitted": "2025-08-25 08:26:43",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Research on Evaluation Methods for Patent Novelty Search Systems and Empirical Analysis",
        "abstract": "Patent novelty search systems are critical to IP protection and innovation\nassessment; their retrieval accuracy directly impacts patent quality. We\npropose a comprehensive evaluation methodology that builds high-quality,\nreproducible datasets from examiner citations and X-type citations extracted\nfrom technically consistent family patents, and evaluates systems using\ninvention descriptions as inputs. Using Top-k Detection Rate and Recall as core\nmetrics, we further conduct multi-dimensional analyses by language, technical\nfield (IPC), and filing jurisdiction. Experiments show the method effectively\nexposes performance differences across scenarios and offers actionable evidence\nfor system improvement. The framework is scalable and practical, providing a\nuseful reference for development and optimization of patent novelty search\nsystems",
        "url": "http://arxiv.org/abs/2508.17782v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17782v1",
        "arxiv_id": "2508.17782v1",
        "authors": [
            "Shu Zhang",
            "LiSha Zhang",
            "Kai Duan",
            "XinKai Sun"
        ],
        "submitted": "2025-08-25 08:24:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Speculating LLMs' Chinese Training Data Pollution from Their Tokens",
        "abstract": "Tokens are basic elements in the datasets for LLM training. It is well-known\nthat many tokens representing Chinese phrases in the vocabulary of GPT\n(4o/4o-mini/o1/o3/4.5/4.1/o4-mini) are indicating contents like pornography or\nonline gambling. Based on this observation, our goal is to locate Polluted\nChinese (PoC) tokens in LLMs and study the relationship between PoC tokens'\nexistence and training data. (1) We give a formal definition and taxonomy of\nPoC tokens based on the GPT's vocabulary. (2) We build a PoC token detector via\nfine-tuning an LLM to label PoC tokens in vocabularies by considering each\ntoken's both semantics and related contents from the search engines. (3) We\nstudy the speculation on the training data pollution via PoC tokens'\nappearances (token ID). Experiments on GPT and other 23 LLMs indicate that\ntokens widely exist while GPT's vocabulary behaves the worst: more than 23%\nlong Chinese tokens (i.e., a token with more than two Chinese characters) are\neither porn or online gambling. We validate the accuracy of our speculation\nmethod on famous pre-training datasets like C4 and Pile. Then, considering\nGPT-4o, we speculate that the ratio of \"Yui Hatano\" related webpages in\nGPT-4o's training data is around 0.5%.",
        "url": "http://arxiv.org/abs/2508.17771v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17771v1",
        "arxiv_id": "2508.17771v1",
        "authors": [
            "Qingjie Zhang",
            "Di Wang",
            "Haoting Qian",
            "Liu Yan",
            "Tianwei Zhang",
            "Ke Xu",
            "Qi Li",
            "Minlie Huang",
            "Hewu Li",
            "Han Qiu"
        ],
        "submitted": "2025-08-25 08:08:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ISACL: Internal State Analyzer for Copyrighted Training Data Leakage",
        "abstract": "Large Language Models (LLMs) have revolutionized Natural Language Processing\n(NLP) but pose risks of inadvertently exposing copyrighted or proprietary data,\nespecially when such data is used for training but not intended for\ndistribution. Traditional methods address these leaks only after content is\ngenerated, which can lead to the exposure of sensitive information. This study\nintroduces a proactive approach: examining LLMs' internal states before text\ngeneration to detect potential leaks. By using a curated dataset of copyrighted\nmaterials, we trained a neural network classifier to identify risks, allowing\nfor early intervention by stopping the generation process or altering outputs\nto prevent disclosure. Integrated with a Retrieval-Augmented Generation (RAG)\nsystem, this framework ensures adherence to copyright and licensing\nrequirements while enhancing data privacy and ethical standards. Our results\nshow that analyzing internal states effectively mitigates the risk of\ncopyrighted data leakage, offering a scalable solution that fits smoothly into\nAI workflows, ensuring compliance with copyright regulations while maintaining\nhigh-quality text generation. The implementation is available on\nGitHub.\\footnote{https://github.com/changhu73/Internal_states_leakage}",
        "url": "http://arxiv.org/abs/2508.17767v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17767v1",
        "arxiv_id": "2508.17767v1",
        "authors": [
            "Guangwei Zhang",
            "Qisheng Su",
            "Jiateng Liu",
            "Cheng Qian",
            "Yanzhou Pan",
            "Yanjie Fu",
            "Denghui Zhang"
        ],
        "submitted": "2025-08-25 08:04:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CEIDM: A Controlled Entity and Interaction Diffusion Model for Enhanced Text-to-Image Generation",
        "abstract": "In Text-to-Image (T2I) generation, the complexity of entities and their\nintricate interactions pose a significant challenge for T2I method based on\ndiffusion model: how to effectively control entity and their interactions to\nproduce high-quality images. To address this, we propose CEIDM, a image\ngeneration method based on diffusion model with dual controls for entity and\ninteraction. First, we propose an entity interactive relationships mining\napproach based on Large Language Models (LLMs), extracting reasonable and rich\nimplicit interactive relationships through chain of thought to guide diffusion\nmodels to generate high-quality images that are closer to realistic logic and\nhave more reasonable interactive relationships. Furthermore, We propose an\ninteractive action clustering and offset method to cluster and offset the\ninteractive action features contained in each text prompts. By constructing\nglobal and local bidirectional offsets, we enhance semantic understanding and\ndetail supplementation of original actions, making the model's understanding of\nthe concept of interactive \"actions\" more accurate and generating images with\nmore accurate interactive actions. Finally, we design an entity control network\nwhich generates masks with entity semantic guidance, then leveraging\nmulti-scale convolutional network to enhance entity feature and dynamic network\nto fuse feature. It effectively controls entities and significantly improves\nimage quality. Experiments show that the proposed CEIDM method is better than\nthe most representative existing methods in both entity control and their\ninteraction control.",
        "url": "http://arxiv.org/abs/2508.17760v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17760v1",
        "arxiv_id": "2508.17760v1",
        "authors": [
            "Mingyue Yang",
            "Dianxi Shi",
            "Jialu Zhou",
            "Xinyu Wei",
            "Leqian Li",
            "Shaowu Yang",
            "Chunping Qiu"
        ],
        "submitted": "2025-08-25 07:58:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DiffusionGS: Generative Search with Query Conditioned Diffusion in Kuaishou",
        "abstract": "Personalized search ranking systems are critical for driving engagement and\nrevenue in modern e-commerce and short-video platforms. While existing methods\nexcel at estimating users' broad interests based on the filtered historical\nbehaviors, they typically under-exploit explicit alignment between a user's\nreal-time intent (represented by the user query) and their past actions. In\nthis paper, we propose DiffusionGS, a novel and scalable approach powered by\ngenerative models. Our key insight is that user queries can serve as explicit\nintent anchors to facilitate the extraction of users' immediate interests from\nlong-term, noisy historical behaviors. Specifically, we formulate interest\nextraction as a conditional denoising task, where the user's query guides a\nconditional diffusion process to produce a robust, user intent-aware\nrepresentation from their behavioral sequence. We propose the User-aware\nDenoising Layer (UDL) to incorporate user-specific profiles into the\noptimization of attention distribution on the user's past actions. By reframing\nqueries as intent priors and leveraging diffusion-based denoising, our method\nprovides a powerful mechanism for capturing dynamic user interest shifts.\nExtensive offline and online experiments demonstrate the superiority of\nDiffusionGS over state-of-the-art methods.",
        "url": "http://arxiv.org/abs/2508.17754v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17754v1",
        "arxiv_id": "2508.17754v1",
        "authors": [
            "Qinyao Li",
            "Xiaoyang Zheng",
            "Qihang Zhao",
            "Ke Xu",
            "Zhongbo Sun",
            "Chao Wang",
            "Chenyi Lei",
            "Han Li",
            "Wenwu Ou"
        ],
        "submitted": "2025-08-25 07:46:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Talking to Robots: A Practical Examination of Speech Foundation Models for HRI Applications",
        "abstract": "Automatic Speech Recognition (ASR) systems in real-world settings need to\nhandle imperfect audio, often degraded by hardware limitations or environmental\nnoise, while accommodating diverse user groups. In human-robot interaction\n(HRI), these challenges intersect to create a uniquely challenging recognition\nenvironment. We evaluate four state-of-the-art ASR systems on eight publicly\navailable datasets that capture six dimensions of difficulty: domain-specific,\naccented, noisy, age-variant, impaired, and spontaneous speech. Our analysis\ndemonstrates significant variations in performance, hallucination tendencies,\nand inherent biases, despite similar scores on standard benchmarks. These\nlimitations have serious implications for HRI, where recognition errors can\ninterfere with task performance, user trust, and safety.",
        "url": "http://arxiv.org/abs/2508.17753v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17753v1",
        "arxiv_id": "2508.17753v1",
        "authors": [
            "Theresa Pekarek Rosin",
            "Julia Gachot",
            "Henri-Leon Kordt",
            "Matthias Kerzel",
            "Stefan Wermter"
        ],
        "submitted": "2025-08-25 07:45:20",
        "source": "arxiv",
        "comment": "Accepted at the workshop on Foundation Models for Social Robotics\n  (FoMoSR) at ICSR 2025"
    },
    {
        "title": "SMITE: Enhancing Fairness in LLMs through Optimal In-Context Example Selection via Dynamic Validation",
        "abstract": "Large Language Models (LLMs) are widely used for downstream tasks such as\ntabular classification, where ensuring fairness in their outputs is critical\nfor inclusivity, equal representation, and responsible AI deployment. This\nstudy introduces a novel approach to enhancing LLM performance and fairness\nthrough the concept of a dynamic validation set, which evolves alongside the\ntest set, replacing the traditional static validation approach. We also propose\nan iterative algorithm, SMITE, to select optimal in-context examples, with each\nexample set validated against its corresponding dynamic validation set. The\nin-context set with the lowest total error is used as the final demonstration\nset. Our experiments across four different LLMs show that our proposed\ntechniques significantly improve both predictive accuracy and fairness compared\nto baseline methods. To our knowledge, this is the first study to apply dynamic\nvalidation in the context of in-context learning for LLMs.",
        "url": "http://arxiv.org/abs/2508.17735v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17735v1",
        "arxiv_id": "2508.17735v1",
        "authors": [
            "Garima Chhikara",
            "Kripabandhu Ghosh",
            "Abhijnan Chakraborty"
        ],
        "submitted": "2025-08-25 07:22:08",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Layerwise Importance Analysis of Feed-Forward Networks in Transformer-based Language Models",
        "abstract": "This study investigates the layerwise importance of feed-forward networks\n(FFNs) in Transformer-based language models during pretraining. We introduce an\nexperimental approach that, while maintaining the total parameter count,\nincreases the FFN dimensions in some layers and completely removes the FFNs\nfrom other layers. Furthermore, since our focus is on the importance of FFNs\nduring pretraining, we train models from scratch to examine whether the\nimportance of FFNs varies depending on their layer positions, rather than using\npublicly available pretrained models as is frequently done. Through\ncomprehensive evaluations of models with varying sizes (285M, 570M, and 1.2B\nparameters) and layer counts (12, 24, and 40 layers), we demonstrate that\nconcentrating FFNs in 70% of the consecutive middle layers consistently\noutperforms standard configurations for multiple downstream tasks.",
        "url": "http://arxiv.org/abs/2508.17734v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17734v1",
        "arxiv_id": "2508.17734v1",
        "authors": [
            "Wataru Ikeda",
            "Kazuki Yano",
            "Ryosuke Takahashi",
            "Jaesung Lee",
            "Keigo Shibata",
            "Jun Suzuki"
        ],
        "submitted": "2025-08-25 07:21:49",
        "source": "arxiv",
        "comment": "Accepted to COLM 2025"
    },
    {
        "title": "How Do LLM-Generated Texts Impact Term-Based Retrieval Models?",
        "abstract": "As more content generated by large language models (LLMs) floods into the\nInternet, information retrieval (IR) systems now face the challenge of\ndistinguishing and handling a blend of human-authored and machine-generated\ntexts. Recent studies suggest that neural retrievers may exhibit a preferential\ninclination toward LLM-generated content, while classic term-based retrievers\nlike BM25 tend to favor human-written documents. This paper investigates the\ninfluence of LLM-generated content on term-based retrieval models, which are\nvalued for their efficiency and robust generalization across domains. Our\nlinguistic analysis reveals that LLM-generated texts exhibit smoother\nhigh-frequency and steeper low-frequency Zipf slopes, higher term specificity,\nand greater document-level diversity. These traits are aligned with LLMs being\ntrained to optimize reader experience through diverse and precise expressions.\nOur study further explores whether term-based retrieval models demonstrate\nsource bias, concluding that these models prioritize documents whose term\ndistributions closely correspond to those of the queries, rather than\ndisplaying an inherent source bias. This work provides a foundation for\nunderstanding and addressing potential biases in term-based IR systems managing\nmixed-source content.",
        "url": "http://arxiv.org/abs/2508.17715v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17715v1",
        "arxiv_id": "2508.17715v1",
        "authors": [
            "Wei Huang",
            "Keping Bi",
            "Yinqiong Cai",
            "Wei Chen",
            "Jiafeng Guo",
            "Xueqi Cheng"
        ],
        "submitted": "2025-08-25 06:43:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "EMPOWER: Evolutionary Medical Prompt Optimization With Reinforcement Learning",
        "abstract": "Prompt engineering significantly influences the reliability and clinical\nutility of Large Language Models (LLMs) in medical applications. Current\noptimization approaches inadequately address domain-specific medical knowledge\nand safety requirements. This paper introduces EMPOWER, a novel evolutionary\nframework that enhances medical prompt quality through specialized\nrepresentation learning, multi-dimensional evaluation, and structure-preserving\nalgorithms. Our methodology incorporates: (1) a medical terminology attention\nmechanism, (2) a comprehensive assessment architecture evaluating clarity,\nspecificity, clinical relevance, and factual accuracy, (3) a component-level\nevolutionary algorithm preserving clinical reasoning integrity, and (4) a\nsemantic verification module ensuring adherence to medical knowledge.\nEvaluation across diagnostic, therapeutic, and educational tasks demonstrates\nsignificant improvements: 24.7% reduction in factually incorrect content, 19.6%\nenhancement in domain specificity, and 15.3% higher clinician preference in\nblinded evaluations. The framework addresses critical challenges in developing\nclinically appropriate prompts, facilitating more responsible integration of\nLLMs into healthcare settings.",
        "url": "http://arxiv.org/abs/2508.17703v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17703v1",
        "arxiv_id": "2508.17703v1",
        "authors": [
            "Yinda Chen",
            "Yangfan He",
            "Jing Yang",
            "Dapeng Zhang",
            "Zhenlong Yuan",
            "Muhammad Attique Khan",
            "Jamel Baili",
            "Por Lip Yee"
        ],
        "submitted": "2025-08-25 06:23:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Semantic Search for Information Retrieval",
        "abstract": "Information retrieval systems have progressed notably from lexical techniques\nsuch as BM25 and TF-IDF to modern semantic retrievers. This survey provides a\nbrief overview of the BM25 baseline, then discusses the architecture of modern\nstate-of-the-art semantic retrievers. Advancing from BERT, we introduce dense\nbi-encoders (DPR), late-interaction models (ColBERT), and neural sparse\nretrieval (SPLADE). Finally, we examine MonoT5, a cross-encoder model. We\nconclude with common evaluation tactics, pressing challenges, and propositions\nfor future directions.",
        "url": "http://arxiv.org/abs/2508.17694v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17694v1",
        "arxiv_id": "2508.17694v1",
        "authors": [
            "Kayla Farivar"
        ],
        "submitted": "2025-08-25 06:03:26",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LLM-based Agentic Reasoning Frameworks: A Survey from Methods to Scenarios",
        "abstract": "Recent advances in the intrinsic reasoning capabilities of large language\nmodels (LLMs) have given rise to LLM-based agent systems that exhibit\nnear-human performance on a variety of automated tasks. However, although these\nsystems share similarities in terms of their use of LLMs, different reasoning\nframeworks of the agent system steer and organize the reasoning process in\ndifferent ways. In this survey, we propose a systematic taxonomy that\ndecomposes agentic reasoning frameworks and analyze how these frameworks\ndominate framework-level reasoning by comparing their applications across\ndifferent scenarios. Specifically, we propose an unified formal language to\nfurther classify agentic reasoning systems into single-agent methods,\ntool-based methods, and multi-agent methods. After that, we provide a\ncomprehensive review of their key application scenarios in scientific\ndiscovery, healthcare, software engineering, social simulation, and economics.\nWe also analyze the characteristic features of each framework and summarize\ndifferent evaluation strategies. Our survey aims to provide the research\ncommunity with a panoramic view to facilitate understanding of the strengths,\nsuitable scenarios, and evaluation practices of different agentic reasoning\nframeworks.",
        "url": "http://arxiv.org/abs/2508.17692v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17692v1",
        "arxiv_id": "2508.17692v1",
        "authors": [
            "Bingxi Zhao",
            "Lin Geng Foo",
            "Ping Hu",
            "Christian Theobalt",
            "Hossein Rahmani",
            "Jun Liu"
        ],
        "submitted": "2025-08-25 06:01:16",
        "source": "arxiv",
        "comment": "51 pages,10 figures,8 tables. Work in progress"
    },
    {
        "title": "Text Meets Topology: Rethinking Out-of-distribution Detection in Text-Rich Networks",
        "abstract": "Out-of-distribution (OOD) detection remains challenging in text-rich\nnetworks, where textual features intertwine with topological structures.\nExisting methods primarily address label shifts or rudimentary domain-based\nsplits, overlooking the intricate textual-structural diversity. For example, in\nsocial networks, where users represent nodes with textual features (name, bio)\nwhile edges indicate friendship status, OOD may stem from the distinct language\npatterns between bot and normal users. To address this gap, we introduce the\nTextTopoOOD framework for evaluating detection across diverse OOD scenarios:\n(1) attribute-level shifts via text augmentations and embedding perturbations;\n(2) structural shifts through edge rewiring and semantic connections; (3)\nthematically-guided label shifts; and (4) domain-based divisions. Furthermore,\nwe propose TNT-OOD to model the complex interplay between Text aNd Topology\nusing: 1) a novel cross-attention module to fuse local structure into\nnode-level text representations, and 2) a HyperNetwork to generate\nnode-specific transformation parameters. This aligns topological and semantic\nfeatures of ID nodes, enhancing ID/OOD distinction across structural and\ntextual shifts. Experiments on 11 datasets across four OOD scenarios\ndemonstrate the nuanced challenge of TextTopoOOD for evaluating OOD detection\nin text-rich networks.",
        "url": "http://arxiv.org/abs/2508.17690v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17690v1",
        "arxiv_id": "2508.17690v1",
        "authors": [
            "Danny Wang",
            "Ruihong Qiu",
            "Guangdong Bai",
            "Zi Huang"
        ],
        "submitted": "2025-08-25 05:57:29",
        "source": "arxiv",
        "comment": "EMNLP2025 Main"
    },
    {
        "title": "Characterizing the Behavior of Training Mamba-based State Space Models on GPUs",
        "abstract": "Mamba-based State Space Models (SSM) have emerged as a promising alternative\nto the ubiquitous transformers. Despite the expressive power of transformers,\nthe quadratic complexity of computing attention is a major impediment to\nscaling performance as we increase the sequence length. SSMs provide an\nalternative path that addresses this problem, reducing the computational\ncomplexity requirements of self-attention with novel model architectures for\ndifferent domains and fields such as video, text generation and graphs. Thus,\nit is important to characterize the behavior of these emerging workloads on\nGPUs and understand their requirements during GPU microarchitectural design. In\nthis work we evaluate Mamba-based SSMs and characterize their behavior during\ntraining on GPUs. We construct a workload suite that offers representative\nmodels that span different model architectures. We then use this suite to\nanalyze the architectural implications of running Mamba-based SSMs on GPUs. Our\nwork sheds new light on potential optimizations to continue scaling the\nperformance for such models.",
        "url": "http://arxiv.org/abs/2508.17679v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17679v1",
        "arxiv_id": "2508.17679v1",
        "authors": [
            "Trinayan Baruah",
            "Kaustubh Shivdikar",
            "Sara Prescott",
            "David Kaeli"
        ],
        "submitted": "2025-08-25 05:22:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CoCoA: Confidence- and Context-Aware Adaptive Decoding for Resolving Knowledge Conflicts in Large Language Models",
        "abstract": "Faithful generation in large language models (LLMs) is challenged by\nknowledge conflicts between parametric memory and external context. Existing\ncontrastive decoding methods tuned specifically to handle conflict often lack\nadaptability and can degrade performance in low conflict settings. We introduce\nCoCoA (Confidence- and Context-Aware Adaptive Decoding), a novel token-level\nalgorithm for principled conflict resolution and enhanced faithfulness. CoCoA\nresolves conflict by utilizing confidence-aware measures (entropy gap and\ncontextual peakedness) and the generalized divergence between the parametric\nand contextual distributions. Crucially, CoCoA maintains strong performance\neven in low conflict settings. Extensive experiments across multiple LLMs on\ndiverse Question Answering (QA), Summarization, and Long-Form Question\nAnswering (LFQA) benchmarks demonstrate CoCoA's state-of-the-art performance\nover strong baselines like AdaCAD. It yields significant gains in QA accuracy,\nup to 9.2 points on average compared to the strong baseline AdaCAD, and\nimproves factuality in summarization and LFQA by up to 2.5 points on average\nacross key benchmarks. Additionally, it demonstrates superior sensitivity to\nconflict variations. CoCoA enables more informed, context-aware, and ultimately\nmore faithful token generation.",
        "url": "http://arxiv.org/abs/2508.17670v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17670v1",
        "arxiv_id": "2508.17670v1",
        "authors": [
            "Anant Khandelwal",
            "Manish Gupta",
            "Puneet Agrawal"
        ],
        "submitted": "2025-08-25 05:06:04",
        "source": "arxiv",
        "comment": "Accepted to EMNLP'25, Main. 21 pages, 17 tables, 3 Figures"
    },
    {
        "title": "Heterogeneous co-occurrence embedding for visual information exploration",
        "abstract": "This paper proposes an embedding method for co-occurrence data aimed at\nvisual information exploration. We consider cases where co-occurrence\nprobabilities are measured between pairs of elements from heterogeneous\ndomains. The proposed method maps these heterogeneous elements into\ncorresponding two-dimensional latent spaces, enabling visualization of\nasymmetric relationships between the domains. The key idea is to embed the\nelements in a way that maximizes their mutual information, thereby preserving\nthe original dependency structure as much as possible. This approach can be\nnaturally extended to cases involving three or more domains, using a\ngeneralization of mutual information known as total correlation. For\ninter-domain analysis, we also propose a visualization method that assigns\ncolors to the latent spaces based on conditional probabilities, allowing users\nto explore asymmetric relationships interactively. We demonstrate the utility\nof the method through applications to an adjective-noun dataset, the NeurIPS\ndataset, and a subject-verb-object dataset, showcasing both intra- and\ninter-domain analysis.",
        "url": "http://arxiv.org/abs/2508.17663v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17663v1",
        "arxiv_id": "2508.17663v1",
        "authors": [
            "Takuro Ishida",
            "Tetsuo Furukawa"
        ],
        "submitted": "2025-08-25 04:51:50",
        "source": "arxiv",
        "comment": "36pages, 9 figures, Accepted to International Journal of Innovative\n  Computing, Information and Control (IJICIC), 2025"
    },
    {
        "title": "SurveyGen: Quality-Aware Scientific Survey Generation with Large Language Models",
        "abstract": "Automatic survey generation has emerged as a key task in scientific document\nprocessing. While large language models (LLMs) have shown promise in generating\nsurvey texts, the lack of standardized evaluation datasets critically hampers\nrigorous assessment of their performance against human-written surveys. In this\nwork, we present SurveyGen, a large-scale dataset comprising over 4,200\nhuman-written surveys across diverse scientific domains, along with 242,143\ncited references and extensive quality-related metadata for both the surveys\nand the cited papers. Leveraging this resource, we build QUAL-SG, a novel\nquality-aware framework for survey generation that enhances the standard\nRetrieval-Augmented Generation (RAG) pipeline by incorporating quality-aware\nindicators into literature retrieval to assess and select higher-quality source\npapers. Using this dataset and framework, we systematically evaluate\nstate-of-the-art LLMs under varying levels of human involvement - from fully\nautomatic generation to human-guided writing. Experimental results and human\nevaluations show that while semi-automatic pipelines can achieve partially\ncompetitive outcomes, fully automatic survey generation still suffers from low\ncitation quality and limited critical analysis.",
        "url": "http://arxiv.org/abs/2508.17647v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17647v1",
        "arxiv_id": "2508.17647v1",
        "authors": [
            "Tong Bao",
            "Mir Tafseer Nayeem",
            "Davood Rafiei",
            "Chengzhi Zhang"
        ],
        "submitted": "2025-08-25 04:22:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Demographically-Inspired Query Variants Using an LLM",
        "abstract": "This study proposes a method to diversify queries in existing test\ncollections to reflect some of the diversity of search engine users, aligning\nwith an earlier vision of an 'ideal' test collection. A Large Language Model\n(LLM) is used to create query variants: alternative queries that have the same\nmeaning as the original. These variants represent user profiles characterised\nby different properties, such as language and domain proficiency, which are\nknown in the IR literature to influence query formulation.\n  The LLM's ability to generate query variants that align with user profiles is\nempirically validated, and the variants' utility is further explored for IR\nsystem evaluation. Results demonstrate that the variants impact how systems are\nranked and show that user profiles experience significantly different levels of\nsystem effectiveness. This method enables an alternative perspective on system\nevaluation where we can observe both the impact of user profiles on system\nrankings and how system performance varies across users.",
        "url": "http://arxiv.org/abs/2508.17644v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17644v1",
        "arxiv_id": "2508.17644v1",
        "authors": [
            "Marwah Alaofi",
            "Nicola Ferro",
            "Paul Thomas",
            "Falk Scholer",
            "Mark Sanderson"
        ],
        "submitted": "2025-08-25 04:17:56",
        "source": "arxiv",
        "comment": "Published in the proceedings of ICTIR'25, Padua, Italy"
    },
    {
        "title": "Dynamic Embedding of Hierarchical Visual Features for Efficient Vision-Language Fine-Tuning",
        "abstract": "Large Vision-Language Models (LVLMs) commonly follow a paradigm that projects\nvisual features and then concatenates them with text tokens to form a unified\nsequence input for Large Language Models (LLMs). However, this paradigm leads\nto a significant increase in the length of the input sequence, resulting in\nsubstantial computational overhead. Existing methods attempt to fuse visual\ninformation into the intermediate layers of LLMs, which alleviate the sequence\nlength issue but often neglect the hierarchical semantic representations within\nthe model and the fine-grained visual information available in the shallower\nvisual encoding layers. To address this limitation, we propose DEHVF, an\nefficient vision-language fine-tuning method based on dynamic embedding and\nfusion of hierarchical visual features. Its core lies in leveraging the\ninherent hierarchical representation characteristics of visual encoders and\nlanguage models. Through a lightweight hierarchical visual fuser, it\ndynamically selects and fuses hierarchical features corresponding to semantic\ngranularity based on the internal representations of each layer in LLMs. The\nfused layer-related visual features are then projected and aligned before being\ndirectly embedded into the Feed-Forward Network (FFN) of the corresponding\nlayer in LLMs. This approach not only avoids sequence expansion but also\ndynamically fuses multi-layer visual information. By fine-tuning only a small\nnumber of parameters, DEHVF achieves precise alignment and complementarity of\ncross-modal information at the same semantic granularity. We conducted\nexperiments across various VL benchmarks, including visual question answering\non ScienceQA and image captioning on COCO Captions. The results demonstrate\nthat DEHVF achieves higher accuracy than existing parameter-efficient\nfine-tuning (PEFT) baselines while maintaining efficient training and\ninference.",
        "url": "http://arxiv.org/abs/2508.17638v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17638v1",
        "arxiv_id": "2508.17638v1",
        "authors": [
            "Xinyu Wei",
            "Guoli Yang",
            "Jialu Zhou",
            "Mingyue Yang",
            "Leqian Li",
            "Kedi Zhang",
            "Chunping Qiu"
        ],
        "submitted": "2025-08-25 03:57:46",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Weights-Rotated Preference Optimization for Large Language Models",
        "abstract": "Despite the efficacy of Direct Preference Optimization (DPO) in aligning\nLarge Language Models (LLMs), reward hacking remains a pivotal challenge. This\nissue emerges when LLMs excessively reduce the probability of rejected\ncompletions to achieve high rewards, without genuinely meeting their intended\ngoals. As a result, this leads to overly lengthy generation lacking diversity,\nas well as catastrophic forgetting of knowledge. We investigate the underlying\nreason behind this issue, which is representation redundancy caused by neuron\ncollapse in the parameter space. Hence, we propose a novel Weights-Rotated\nPreference Optimization (RoPO) algorithm, which implicitly constrains the\noutput layer logits with the KL divergence inherited from DPO and explicitly\nconstrains the intermediate hidden states by fine-tuning on a multi-granularity\northogonal matrix. This design prevents the policy model from deviating too far\nfrom the reference model, thereby retaining the knowledge and expressive\ncapabilities acquired during pre-training and SFT stages. Our RoPO achieves up\nto a 3.27-point improvement on AlpacaEval 2, and surpasses the best baseline by\n6.2 to 7.5 points on MT-Bench with merely 0.015% of the trainable parameters,\ndemonstrating its effectiveness in alleviating the reward hacking problem of\nDPO.",
        "url": "http://arxiv.org/abs/2508.17637v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17637v1",
        "arxiv_id": "2508.17637v1",
        "authors": [
            "Chenxu Yang",
            "Ruipeng Jia",
            "Mingyu Zheng",
            "Naibin Gu",
            "Zheng Lin",
            "Siyuan Chen",
            "Weichong Yin",
            "Hua Wu",
            "Weiping Wang"
        ],
        "submitted": "2025-08-25 03:57:17",
        "source": "arxiv",
        "comment": "EMNLP 2025"
    },
    {
        "title": "Stop Spinning Wheels: Mitigating LLM Overthinking via Mining Patterns for Early Reasoning Exit",
        "abstract": "Large language models (LLMs) enhance complex reasoning tasks by scaling the\nindividual thinking process. However, prior work shows that overthinking can\ndegrade overall performance. Motivated by observed patterns in thinking length\nand content length, we categorize reasoning into three stages: insufficient\nexploration stage, compensatory reasoning stage, and reasoning convergence\nstage. Typically, LLMs produce correct answers in the compensatory reasoning\nstage, whereas reasoning convergence often triggers overthinking, causing\nincreased resource usage or even infinite loops. Therefore, mitigating\noverthinking hinges on detecting the end of the compensatory reasoning stage,\ndefined as the Reasoning Completion Point (RCP). RCP typically appears at the\nend of the first complete reasoning cycle and can be identified by querying the\nLLM sentence by sentence or monitoring the probability of an end-of-thinking\ntoken (e.g., \\texttt{</think>}), though these methods lack an efficient and\nprecise balance. To improve this, we mine more sensitive and consistent RCP\npatterns and develop a lightweight thresholding strategy based on heuristic\nrules. Experimental evaluations on benchmarks (AIME24, AIME25, GPQA-D)\ndemonstrate that the proposed method reduces token consumption while preserving\nor enhancing reasoning accuracy.",
        "url": "http://arxiv.org/abs/2508.17627v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17627v1",
        "arxiv_id": "2508.17627v1",
        "authors": [
            "Zihao Wei",
            "Liang Pang",
            "Jiahao Liu",
            "Jingcheng Deng",
            "Shicheng Xu",
            "Zenghao Duan",
            "Jingang Wang",
            "Fei Sun",
            "Xunliang Cai",
            "Huawei Shen",
            "Xueqi Cheng"
        ],
        "submitted": "2025-08-25 03:17:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "EMO-Reasoning: Benchmarking Emotional Reasoning Capabilities in Spoken Dialogue Systems",
        "abstract": "Speech emotions play a crucial role in human-computer interaction, shaping\nengagement and context-aware communication. Despite recent advances in spoken\ndialogue systems, a holistic system for evaluating emotional reasoning is still\nlacking. To address this, we introduce EMO-Reasoning, a benchmark for assessing\nemotional coherence in dialogue systems. It leverages a curated dataset\ngenerated via text-to-speech to simulate diverse emotional states, overcoming\nthe scarcity of emotional speech data. We further propose the Cross-turn\nEmotion Reasoning Score to assess the emotion transitions in multi-turn\ndialogues. Evaluating seven dialogue systems through continuous, categorical,\nand perceptual metrics, we show that our framework effectively detects\nemotional inconsistencies, providing insights for improving current dialogue\nsystems. By releasing a systematic evaluation benchmark, we aim to advance\nemotion-aware spoken dialogue modeling toward more natural and adaptive\ninteractions.",
        "url": "http://arxiv.org/abs/2508.17623v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17623v1",
        "arxiv_id": "2508.17623v1",
        "authors": [
            "Jingwen Liu",
            "Kan Jen Cheng",
            "Jiachen Lian",
            "Akshay Anand",
            "Rishi Jain",
            "Faith Qiao",
            "Robin Netzorg",
            "Huang-Cheng Chou",
            "Tingle Li",
            "Guan-Ting Lin",
            "Gopala Anumanchipalli"
        ],
        "submitted": "2025-08-25 03:01:40",
        "source": "arxiv",
        "comment": "Accepted at (ASRU 2025) 2025 IEEE Automatic Speech Recognition and\n  Understanding Workshop"
    },
    {
        "title": "Steering When Necessary: Flexible Steering Large Language Models with Backtracking",
        "abstract": "Large language models (LLMs) have achieved remarkable performance across many\ngeneration tasks. Nevertheless, effectively aligning them with desired\nbehaviors remains a significant challenge. Activation steering is an effective\nand cost-efficient approach that directly modifies the activations of LLMs\nduring the inference stage, aligning their responses with the desired behaviors\nand avoiding the high cost of fine-tuning. Existing methods typically\nindiscriminately intervene to all generations or rely solely on the question to\ndetermine intervention, which limits the accurate assessment of the\nintervention strength. To this end, we propose the Flexible Activation Steering\nwith Backtracking (FASB) framework, which dynamically determines both the\nnecessity and strength of intervention by tracking the internal states of the\nLLMs during generation, considering both the question and the generated\ncontent. Since intervening after detecting a deviation from the desired\nbehavior is often too late, we further propose the backtracking mechanism to\ncorrect the deviated tokens and steer the LLMs toward the desired behavior.\nExtensive experiments on the TruthfulQA dataset and six multiple-choice\ndatasets demonstrate that our method outperforms baselines. Our code will be\nreleased at https://github.com/gjw185/FASB.",
        "url": "http://arxiv.org/abs/2508.17621v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17621v1",
        "arxiv_id": "2508.17621v1",
        "authors": [
            "Jinwei Gan",
            "Zifeng Cheng",
            "Zhiwei Jiang",
            "Cong Wang",
            "Yafeng Yin",
            "Xiang Luo",
            "Yuchen Fu",
            "Qing Gu"
        ],
        "submitted": "2025-08-25 03:01:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Preference Trajectory Modeling via Flow Matching for Sequential Recommendation",
        "abstract": "Sequential recommendation predicts each user's next item based on their\nhistorical interaction sequence. Recently, diffusion models have attracted\nsignificant attention in this area due to their strong ability to model user\ninterest distributions. They typically generate target items by denoising\nGaussian noise conditioned on historical interactions. However, these models\nface two critical limitations. First, they exhibit high sensitivity to the\ncondition, making it difficult to recover target items from pure Gaussian\nnoise. Second, the inference process is computationally expensive, limiting\npractical deployment. To address these issues, we propose FlowRec, a simple yet\neffective sequential recommendation framework which leverages flow matching to\nexplicitly model user preference trajectories from current states to future\ninterests. Flow matching is an emerging generative paradigm, which offers\ngreater flexibility in initial distributions and enables more efficient\nsampling. Based on this, we construct a personalized behavior-based prior\ndistribution to replace Gaussian noise and learn a vector field to model user\npreference trajectories. To better align flow matching with the recommendation\nobjective, we further design a single-step alignment loss incorporating both\npositive and negative samples, improving sampling efficiency and generation\nquality. Extensive experiments on four benchmark datasets verify the\nsuperiority of FlowRec over the state-of-the-art baselines.",
        "url": "http://arxiv.org/abs/2508.17618v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17618v1",
        "arxiv_id": "2508.17618v1",
        "authors": [
            "Li Li",
            "Mingyue Cheng",
            "Yuyang Ye",
            "Zhiding Liu",
            "Enhong Chen"
        ],
        "submitted": "2025-08-25 02:55:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Less Is More? Examining Fairness in Pruned Large Language Models for Summarising Opinions",
        "abstract": "Model compression through post-training pruning offers a way to reduce model\nsize and computational requirements without significantly impacting model\nperformance. However, the effect of pruning on the fairness of LLM-generated\nsummaries remains unexplored, particularly for opinion summarisation where\nbiased outputs could influence public views.In this paper, we present a\ncomprehensive empirical analysis of opinion summarisation, examining three\nstate-of-the-art pruning methods and various calibration sets across three\nopen-source LLMs using four fairness metrics. Our systematic analysis reveals\nthat pruning methods have a greater impact on fairness than calibration sets.\nBuilding on these insights, we propose High Gradient Low Activation (HGLA)\npruning, which identifies and removes parameters that are redundant for input\nprocessing but influential in output generation. Our experiments demonstrate\nthat HGLA can better maintain or even improve fairness compared to existing\nmethods, showing promise across models and tasks where traditional methods have\nlimitations. Our human evaluation shows HGLA-generated outputs are fairer than\nexisting state-of-the-art pruning methods. Code is available at:\nhttps://github.com/amberhuang01/HGLA.",
        "url": "http://arxiv.org/abs/2508.17610v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17610v1",
        "arxiv_id": "2508.17610v1",
        "authors": [
            "Nannan Huang",
            "Haytham Fayek",
            "Xiuzhen Zhang"
        ],
        "submitted": "2025-08-25 02:40:55",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025 Main Conference"
    },
    {
        "title": "RubikSQL: Lifelong Learning Agentic Knowledge Base as an Industrial NL2SQL System",
        "abstract": "We present RubikSQL, a novel NL2SQL system designed to address key challenges\nin real-world enterprise-level NL2SQL, such as implicit intents and\ndomain-specific terminology. RubikSQL frames NL2SQL as a lifelong learning\ntask, demanding both Knowledge Base (KB) maintenance and SQL generation.\nRubikSQL systematically builds and refines its KB through techniques including\ndatabase profiling, structured information extraction, agentic rule mining, and\nChain-of-Thought (CoT)-enhanced SQL profiling. RubikSQL then employs a\nmulti-agent workflow to leverage this curated KB, generating accurate SQLs.\nRubikSQL achieves SOTA performance on both the KaggleDBQA and BIRD Mini-Dev\ndatasets. Finally, we release the RubikBench benchmark, a new benchmark\nspecifically designed to capture vital traits of industrial NL2SQL scenarios,\nproviding a valuable resource for future research.",
        "url": "http://arxiv.org/abs/2508.17590v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17590v1",
        "arxiv_id": "2508.17590v1",
        "authors": [
            "Zui Chen",
            "Han Li",
            "Xinhao Zhang",
            "Xiaoyu Chen",
            "Chunyin Dong",
            "Yifeng Wang",
            "Xin Cai",
            "Su Zhang",
            "Ziqi Li",
            "Chi Ding",
            "Jinxu Li",
            "Shuai Wang",
            "Dousheng Zhao",
            "Sanhai Gao",
            "Guangyi Liu"
        ],
        "submitted": "2025-08-25 01:28:37",
        "source": "arxiv",
        "comment": "18 pages, 3 figures, 3 tables, to be submitted to VLDB 2026 (PVLDB\n  Volume 19)"
    },
    {
        "title": "UQ: Assessing Language Models on Unsolved Questions",
        "abstract": "Benchmarks shape progress in AI research. A useful benchmark should be both\ndifficult and realistic: questions should challenge frontier models while also\nreflecting real-world usage. Yet, current paradigms face a difficulty-realism\ntension: exam-style benchmarks are often made artificially difficult with\nlimited real-world value, while benchmarks based on real user interaction often\nskew toward easy, high-frequency problems. In this work, we explore a radically\ndifferent paradigm: assessing models on unsolved questions. Rather than a\nstatic benchmark scored once, we curate unsolved questions and evaluate models\nasynchronously over time with validator-assisted screening and community\nverification. We introduce UQ, a testbed of 500 challenging, diverse questions\nsourced from Stack Exchange, spanning topics from CS theory and math to sci-fi\nand history, probing capabilities including reasoning, factuality, and\nbrowsing. UQ is difficult and realistic by construction: unsolved questions are\noften hard and naturally arise when humans seek answers, thus solving them\nyields direct real-world value. Our contributions are threefold: (1) UQ-Dataset\nand its collection pipeline combining rule-based filters, LLM judges, and human\nreview to ensure question quality (e.g., well-defined and difficult); (2)\nUQ-Validators, compound validation strategies that leverage the\ngenerator-validator gap to provide evaluation signals and pre-screen candidate\nsolutions for human review; and (3) UQ-Platform, an open platform where experts\ncollectively verify questions and solutions. The top model passes UQ-validation\non only 15% of questions, and preliminary human verification has already\nidentified correct answers among those that passed. UQ charts a path for\nevaluating frontier models on real-world, open-ended challenges, where success\npushes the frontier of human knowledge. We release UQ at\nhttps://uq.stanford.edu.",
        "url": "http://arxiv.org/abs/2508.17580v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17580v1",
        "arxiv_id": "2508.17580v1",
        "authors": [
            "Fan Nie",
            "Ken Ziyu Liu",
            "Zihao Wang",
            "Rui Sun",
            "Wei Liu",
            "Weijia Shi",
            "Huaxiu Yao",
            "Linjun Zhang",
            "Andrew Y. Ng",
            "James Zou",
            "Sanmi Koyejo",
            "Yejin Choi",
            "Percy Liang",
            "Niklas Muennighoff"
        ],
        "submitted": "2025-08-25 01:07:59",
        "source": "arxiv",
        "comment": "FN, KZL, and NM are project co-leads and contributed equally. Project\n  website: https://uq.stanford.edu"
    },
    {
        "title": "CausalSent: Interpretable Sentiment Classification with RieszNet",
        "abstract": "Despite the overwhelming performance improvements offered by recent natural\nlanguage procesing (NLP) models, the decisions made by these models are largely\na black box. Towards closing this gap, the field of causal NLP combines causal\ninference literature with modern NLP models to elucidate causal effects of text\nfeatures. We replicate and extend Bansal et al's work on regularizing text\nclassifiers to adhere to estimated effects, focusing instead on model\ninterpretability. Specifically, we focus on developing a two-headed\nRieszNet-based neural network architecture which achieves better treatment\neffect estimation accuracy. Our framework, CausalSent, accurately predicts\ntreatment effects in semi-synthetic IMDB movie reviews, reducing MAE of effect\nestimates by 2-3x compared to Bansal et al's MAE on synthetic Civil Comments\ndata. With an ensemble of validated models, we perform an observational case\nstudy on the causal effect of the word \"love\" in IMDB movie reviews, finding\nthat the presence of the word \"love\" causes a +2.9% increase in the probability\nof a positive sentiment.",
        "url": "http://arxiv.org/abs/2508.17576v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17576v1",
        "arxiv_id": "2508.17576v1",
        "authors": [
            "Daniel Frees",
            "Martin Pollack"
        ],
        "submitted": "2025-08-25 00:56:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Humanizing Machines: Rethinking LLM Anthropomorphism Through a Multi-Level Framework of Design",
        "abstract": "Large Language Models (LLMs) increasingly exhibit \\textbf{anthropomorphism}\ncharacteristics -- human-like qualities portrayed across their outlook,\nlanguage, behavior, and reasoning functions. Such characteristics enable more\nintuitive and engaging human-AI interactions. However, current research on\nanthropomorphism remains predominantly risk-focused, emphasizing over-trust and\nuser deception while offering limited design guidance. We argue that\nanthropomorphism should instead be treated as a \\emph{concept of design} that\ncan be intentionally tuned to support user goals. Drawing from multiple\ndisciplines, we propose that the anthropomorphism of an LLM-based artifact\nshould reflect the interaction between artifact designers and interpreters.\nThis interaction is facilitated by cues embedded in the artifact by the\ndesigners and the (cognitive) responses of the interpreters to the cues. Cues\nare categorized into four dimensions: \\textit{perceptive, linguistic,\nbehavioral}, and \\textit{cognitive}. By analyzing the manifestation and\neffectiveness of each cue, we provide a unified taxonomy with actionable levers\nfor practitioners. Consequently, we advocate for function-oriented evaluations\nof anthropomorphic design.",
        "url": "http://arxiv.org/abs/2508.17573v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17573v1",
        "arxiv_id": "2508.17573v1",
        "authors": [
            "Yunze Xiao",
            "Lynnette Hui Xian Ng",
            "Jiarui Liu",
            "Mona T. Diab"
        ],
        "submitted": "2025-08-25 00:48:39",
        "source": "arxiv",
        "comment": "Accepted in EMNLP main proceedings"
    },
    {
        "title": "A Universal Framework for Offline Serendipity Evaluation in Recommender Systems via Large Language Models",
        "abstract": "Serendipity in recommender systems (RSs) has attracted increasing attention\nas a concept that enhances user satisfaction by presenting unexpected and\nuseful items. However, evaluating serendipitous performance remains challenging\nbecause its ground truth is generally unobservable. The existing offline\nmetrics often depend on ambiguous definitions or are tailored to specific\ndatasets and RSs, thereby limiting their generalizability. To address this\nissue, we propose a universally applicable evaluation framework that leverages\nlarge language models (LLMs) known for their extensive knowledge and reasoning\ncapabilities, as evaluators. First, to improve the evaluation performance of\nthe proposed framework, we assessed the serendipity prediction accuracy of LLMs\nusing four different prompt strategies on a dataset containing user-annotated\nserendipitous ground truth and found that the chain-of-thought prompt achieved\nthe highest accuracy. Next, we re-evaluated the serendipitous performance of\nboth serendipity-oriented and general RSs using the proposed framework on three\ncommonly used real-world datasets, without the ground truth. The results\nindicated that there was no serendipity-oriented RS that consistently\noutperformed across all datasets, and even a general RS sometimes achieved\nhigher performance than the serendipity-oriented RS.",
        "url": "http://arxiv.org/abs/2508.17571v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17571v1",
        "arxiv_id": "2508.17571v1",
        "authors": [
            "Yu Tokutake",
            "Kazushi Okamoto",
            "Kei Harada",
            "Atsushi Shibata",
            "Koki Karube"
        ],
        "submitted": "2025-08-25 00:45:16",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Activation Transport Operators",
        "abstract": "The residual stream mediates communication between transformer decoder layers\nvia linear reads and writes of non-linear computations. While sparse-dictionary\nlearning-based methods locate features in the residual stream, and activation\npatching methods discover circuits within the model, the mechanism by which\nfeatures flow through the residual stream remains understudied. Understanding\nthis dynamic can better inform jailbreaking protections, enable early detection\nof model mistakes, and their correction. In this work, we propose Activation\nTransport Operators (ATO), linear maps from upstream to downstream residuals\n$k$ layers later, evaluated in feature space using downstream SAE decoder\nprojections. We empirically demonstrate that these operators can determine\nwhether a feature has been linearly transported from a previous layer or\nsynthesised from non-linear layer computation. We develop the notion of\ntransport efficiency, for which we provide an upper bound, and use it to\nestimate the size of the residual stream subspace that corresponds to linear\ntransport. We empirically demonstrate the linear transport, report transport\nefficiency and the size of the residual stream's subspace involved in linear\ntransport. This compute-light (no finetuning, <50 GPU-h) method offers\npractical tools for safety, debugging, and a clearer picture of where\ncomputation in LLMs behaves linearly.",
        "url": "http://arxiv.org/abs/2508.17540v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17540v1",
        "arxiv_id": "2508.17540v1",
        "authors": [
            "Andrzej Szablewski",
            "Marek Masiak"
        ],
        "submitted": "2025-08-24 22:22:09",
        "source": "arxiv",
        "comment": "4 pages, 4 figures, references and appendices"
    },
    {
        "title": "Debate or Vote: Which Yields Better Decisions in Multi-Agent Large Language Models?",
        "abstract": "Multi-Agent Debate~(MAD) has emerged as a promising paradigm for improving\nthe performance of large language models through collaborative reasoning.\nDespite recent advances, the key factors driving MAD's effectiveness remain\nunclear. In this work, we disentangle MAD into two key components--Majority\nVoting and inter-agent Debate--and assess their respective contributions.\nThrough extensive experiments across seven NLP benchmarks, we find that\nMajority Voting alone accounts for most of the performance gains typically\nattributed to MAD. To explain this, we propose a theoretical framework that\nmodels debate as a stochastic process. We prove that it induces a martingale\nover agents' belief trajectories, implying that debate alone does not improve\nexpected correctness. Guided by these insights, we demonstrate that targeted\ninterventions, by biasing the belief update toward correction, can meaningfully\nenhance debate effectiveness. Overall, our findings suggest that while MAD has\npotential, simple ensembling methods remain strong and more reliable\nalternatives in many practical settings. Code is released in\nhttps://github.com/deeplearning-wisc/debate-or-vote.",
        "url": "http://arxiv.org/abs/2508.17536v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17536v1",
        "arxiv_id": "2508.17536v1",
        "authors": [
            "Hyeong Kyu Choi",
            "Xiaojin Zhu",
            "Yixuan Li"
        ],
        "submitted": "2025-08-24 22:14:32",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Improving French Synthetic Speech Quality via SSML Prosody Control",
        "abstract": "Despite recent advances, synthetic voices often lack expressiveness due to\nlimited prosody control in commercial text-to-speech (TTS) systems. We\nintroduce the first end-to-end pipeline that inserts Speech Synthesis Markup\nLanguage (SSML) tags into French text to control pitch, speaking rate, volume,\nand pause duration. We employ a cascaded architecture with two QLoRA-fine-tuned\nQwen 2.5-7B models: one predicts phrase-break positions and the other performs\nregression on prosodic targets, generating commercial TTS-compatible SSML\nmarkup. Evaluated on a 14-hour French podcast corpus, our method achieves 99.2%\nF1 for break placement and reduces mean absolute error on pitch, rate, and\nvolume by 25-40% compared with prompting-only large language models (LLMs) and\na BiLSTM baseline. In perceptual evaluation involving 18 participants across\nover 9 hours of synthesized audio, SSML-enhanced speech generated by our\npipeline significantly improves naturalness, with the mean opinion score\nincreasing from 3.20 to 3.87 (p < 0.005). Additionally, 15 of 18 listeners\npreferred our enhanced synthesis. These results demonstrate substantial\nprogress in bridging the expressiveness gap between synthetic and natural\nFrench speech. Our code is publicly available at\nhttps://github.com/hi-paris/Prosody-Control-French-TTS.",
        "url": "http://arxiv.org/abs/2508.17494v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17494v1",
        "arxiv_id": "2508.17494v1",
        "authors": [
            "Nassima Ould Ouali",
            "Awais Hussain Sani",
            "Ruben Bueno",
            "Jonah Dauvet",
            "Tim Luka Horstmann",
            "Eric Moulines"
        ],
        "submitted": "2025-08-24 19:07:59",
        "source": "arxiv",
        "comment": "13 pages, 9 figures, 6 tables. Accepted for presentation at ICNLSP\n  2025 (Odense, Denmark). Code and demo:\n  https://github.com/hi-paris/Prosody-Control-French-TTS. ACM Class: I.2.7;\n  H.5.5"
    },
    {
        "title": "Efficient Zero-Shot Long Document Classification by Reducing Context Through Sentence Ranking",
        "abstract": "Transformer-based models like BERT excel at short text classification but\nstruggle with long document classification (LDC) due to input length\nlimitations and computational inefficiencies. In this work, we propose an\nefficient, zero-shot approach to LDC that leverages sentence ranking to reduce\ninput context without altering the model architecture. Our method enables the\nadaptation of models trained on short texts, such as headlines, to long-form\ndocuments by selecting the most informative sentences using a TF-IDF-based\nranking strategy. Using the MahaNews dataset of long Marathi news articles, we\nevaluate three context reduction strategies that prioritize essential content\nwhile preserving classification accuracy. Our results show that retaining only\nthe top 50\\% ranked sentences maintains performance comparable to full-document\ninference while reducing inference time by up to 35\\%. This demonstrates that\nsentence ranking is a simple yet effective technique for scalable and efficient\nzero-shot LDC.",
        "url": "http://arxiv.org/abs/2508.17490v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17490v1",
        "arxiv_id": "2508.17490v1",
        "authors": [
            "Prathamesh Kokate",
            "Mitali Sarnaik",
            "Manavi Khopade",
            "Mukta Takalikar",
            "Raviraj Joshi"
        ],
        "submitted": "2025-08-24 18:52:37",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Evaluating the Impact of Verbal Multiword Expressions on Machine Translation",
        "abstract": "Verbal multiword expressions (VMWEs) present significant challenges for\nnatural language processing due to their complex and often non-compositional\nnature. While machine translation models have seen significant improvement with\nthe advent of language models in recent years, accurately translating these\ncomplex linguistic structures remains an open problem. In this study, we\nanalyze the impact of three VMWE categories -- verbal idioms, verb-particle\nconstructions, and light verb constructions -- on machine translation quality\nfrom English to multiple languages. Using both established multiword expression\ndatasets and sentences containing these language phenomena extracted from\nmachine translation datasets, we evaluate how state-of-the-art translation\nsystems handle these expressions. Our experimental results consistently show\nthat VMWEs negatively affect translation quality. We also propose an LLM-based\nparaphrasing approach that replaces these expressions with their literal\ncounterparts, demonstrating significant improvement in translation quality for\nverbal idioms and verb-particle constructions.",
        "url": "http://arxiv.org/abs/2508.17458v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17458v1",
        "arxiv_id": "2508.17458v1",
        "authors": [
            "Linfeng Liu",
            "Saptarshi Ghosh",
            "Tianyu Jiang"
        ],
        "submitted": "2025-08-24 17:26:58",
        "source": "arxiv",
        "comment": "29 pages, 13 figures"
    },
    {
        "title": "Persuasion Dynamics in LLMs: Investigating Robustness and Adaptability in Knowledge and Safety with DuET-PD",
        "abstract": "Large Language Models (LLMs) can struggle to balance gullibility to\nmisinformation and resistance to valid corrections in persuasive dialogues, a\ncritical challenge for reliable deployment. We introduce DuET-PD (Dual\nEvaluation for Trust in Persuasive Dialogues), a framework evaluating\nmulti-turn stance-change dynamics across dual dimensions: persuasion type\n(corrective/misleading) and domain (knowledge via MMLU-Pro, and safety via\nSALAD-Bench). We find that even a state-of-the-art model like GPT-4o achieves\nonly 27.32% accuracy in MMLU-Pro under sustained misleading persuasions.\nMoreover, results reveal a concerning trend of increasing sycophancy in newer\nopen-source models. To address this, we introduce Holistic DPO, a training\napproach balancing positive and negative persuasion examples. Unlike prompting\nor resist-only training, Holistic DPO enhances both robustness to\nmisinformation and receptiveness to corrections, improving\nLlama-3.1-8B-Instruct's accuracy under misleading persuasion in safety contexts\nfrom 4.21% to 76.54%. These contributions offer a pathway to developing more\nreliable and adaptable LLMs for multi-turn dialogue. Code is available at\nhttps://github.com/Social-AI-Studio/DuET-PD.",
        "url": "http://arxiv.org/abs/2508.17450v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17450v1",
        "arxiv_id": "2508.17450v1",
        "authors": [
            "Bryan Chen Zhengyu Tan",
            "Daniel Wai Kit Chin",
            "Zhengyuan Liu",
            "Nancy F. Chen",
            "Roy Ka-Wei Lee"
        ],
        "submitted": "2025-08-24 17:08:37",
        "source": "arxiv",
        "comment": "To appear at EMNLP 2025"
    },
    {
        "title": "TreePO: Bridging the Gap of Policy Optimization and Efficacy and Inference Efficiency with Heuristic Tree-based Modeling",
        "abstract": "Recent advancements in aligning large language models via reinforcement\nlearning have achieved remarkable gains in solving complex reasoning problems,\nbut at the cost of expensive on-policy rollouts and limited exploration of\ndiverse reasoning paths. In this work, we introduce TreePO, involving a\nself-guided rollout algorithm that views sequence generation as a\ntree-structured searching process. Composed of dynamic tree sampling policy and\nfixed-length segment decoding, TreePO leverages local uncertainty to warrant\nadditional branches. By amortizing computation across common prefixes and\npruning low-value paths early, TreePO essentially reduces the per-update\ncompute burden while preserving or enhancing exploration diversity. Key\ncontributions include: (1) a segment-wise sampling algorithm that alleviates\nthe KV cache burden through contiguous segments and spawns new branches along\nwith an early-stop mechanism; (2) a tree-based segment-level advantage\nestimation that considers both global and local proximal policy optimization.\nand (3) analysis on the effectiveness of probability and quality-driven dynamic\ndivergence and fallback strategy. We empirically validate the performance gain\nof TreePO on a set reasoning benchmarks and the efficiency saving of GPU hours\nfrom 22\\% up to 43\\% of the sampling design for the trained models, meanwhile\nshowing up to 40\\% reduction at trajectory-level and 35\\% at token-level\nsampling compute for the existing models. While offering a free lunch of\ninference efficiency, TreePO reveals a practical path toward scaling RL-based\npost-training with fewer samples and less compute. Home page locates at\nhttps://m-a-p.ai/TreePO.",
        "url": "http://arxiv.org/abs/2508.17445v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17445v1",
        "arxiv_id": "2508.17445v1",
        "authors": [
            "Yizhi Li",
            "Qingshui Gu",
            "Zhoufutu Wen",
            "Ziniu Li",
            "Tianshun Xing",
            "Shuyue Guo",
            "Tianyu Zheng",
            "Xin Zhou",
            "Xingwei Qu",
            "Wangchunshu Zhou",
            "Zheng Zhang",
            "Wei Shen",
            "Qian Liu",
            "Chenghua Lin",
            "Jian Yang",
            "Ge Zhang",
            "Wenhao Huang"
        ],
        "submitted": "2025-08-24 16:52:37",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MahaParaphrase: A Marathi Paraphrase Detection Corpus and BERT-based Models",
        "abstract": "Paraphrases are a vital tool to assist language understanding tasks such as\nquestion answering, style transfer, semantic parsing, and data augmentation\ntasks. Indic languages are complex in natural language processing (NLP) due to\ntheir rich morphological and syntactic variations, diverse scripts, and limited\navailability of annotated data. In this work, we present the\nL3Cube-MahaParaphrase Dataset, a high-quality paraphrase corpus for Marathi, a\nlow resource Indic language, consisting of 8,000 sentence pairs, each annotated\nby human experts as either Paraphrase (P) or Non-paraphrase (NP). We also\npresent the results of standard transformer-based BERT models on these\ndatasets. The dataset and model are publicly shared at\nhttps://github.com/l3cube-pune/MarathiNLP",
        "url": "http://arxiv.org/abs/2508.17444v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17444v1",
        "arxiv_id": "2508.17444v1",
        "authors": [
            "Suramya Jadhav",
            "Abhay Shanbhag",
            "Amogh Thakurdesai",
            "Ridhima Sinare",
            "Ananya Joshi",
            "Raviraj Joshi"
        ],
        "submitted": "2025-08-24 16:48:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DS@GT at CheckThat! 2025: A Simple Retrieval-First, LLM-Backed Framework for Claim Normalization",
        "abstract": "Claim normalization is an integral part of any automatic fact-check\nverification system. It parses the typically noisy claim data, such as social\nmedia posts into normalized claims, which are then fed into downstream veracity\nclassification tasks. The CheckThat! 2025 Task 2 focuses specifically on claim\nnormalization and spans 20 languages under monolingual and zero-shot\nconditions. Our proposed solution consists of a lightweight\n\\emph{retrieval-first, LLM-backed} pipeline, in which we either dynamically\nprompt a GPT-4o-mini with in-context examples, or retrieve the closest\nnormalization from the train dataset directly. On the official test set, the\nsystem ranks near the top for most monolingual tracks, achieving first place in\n7 out of of the 13 languages. In contrast, the system underperforms in the\nzero-shot setting, highlighting the limitation of the proposed solution.",
        "url": "http://arxiv.org/abs/2508.17402v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17402v1",
        "arxiv_id": "2508.17402v1",
        "authors": [
            "Aleksandar Pramov",
            "Jiangqin Ma",
            "Bina Patel"
        ],
        "submitted": "2025-08-24 15:19:58",
        "source": "arxiv",
        "comment": "CLEF 2025 Working Notes, Madrid, Spain"
    },
    {
        "title": "Retrieval Capabilities of Large Language Models Scale with Pretraining FLOPs",
        "abstract": "How does retrieval performance scale with pretraining FLOPs? We benchmark\nretrieval performance across LLM model sizes from 125 million parameters to 7\nbillion parameters pretrained on datasets ranging from 1 billion tokens to more\nthan 2 trillion tokens. We find that retrieval performance on zero-shot BEIR\ntasks predictably scales with LLM size, training duration, and estimated FLOPs.\nWe also show that In-Context Learning scores are strongly correlated with\nretrieval scores across retrieval tasks. Finally, we highlight the implications\nthis has for the development of LLM-based retrievers.",
        "url": "http://arxiv.org/abs/2508.17400v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17400v1",
        "arxiv_id": "2508.17400v1",
        "authors": [
            "Jacob Portes",
            "Connor Jennings",
            "Erica Ji Yuen",
            "Sasha Doubov",
            "Michael Carbin"
        ],
        "submitted": "2025-08-24 15:19:24",
        "source": "arxiv",
        "comment": "15 pages, 4 figures"
    },
    {
        "title": "DashboardQA: Benchmarking Multimodal Agents for Question Answering on Interactive Dashboards",
        "abstract": "Dashboards are powerful visualization tools for data-driven decision-making,\nintegrating multiple interactive views that allow users to explore, filter, and\nnavigate data. Unlike static charts, dashboards support rich interactivity,\nwhich is essential for uncovering insights in real-world analytical workflows.\nHowever, existing question-answering benchmarks for data visualizations largely\noverlook this interactivity, focusing instead on static charts. This limitation\nseverely constrains their ability to evaluate the capabilities of modern\nmultimodal agents designed for GUI-based reasoning. To address this gap, we\nintroduce DashboardQA, the first benchmark explicitly designed to assess how\nvision-language GUI agents comprehend and interact with real-world dashboards.\nThe benchmark includes 112 interactive dashboards from Tableau Public and 405\nquestion-answer pairs with interactive dashboards spanning five categories:\nmultiple-choice, factoid, hypothetical, multi-dashboard, and conversational. By\nassessing a variety of leading closed- and open-source GUI agents, our analysis\nreveals their key limitations, particularly in grounding dashboard elements,\nplanning interaction trajectories, and performing reasoning. Our findings\nindicate that interactive dashboard reasoning is a challenging task overall for\nall the VLMs evaluated. Even the top-performing agents struggle; for instance,\nthe best agent based on Gemini-Pro-2.5 achieves only 38.69% accuracy, while the\nOpenAI CUA agent reaches just 22.69%, demonstrating the benchmark's significant\ndifficulty. We release DashboardQA at https://github.com/vis-nlp/DashboardQA",
        "url": "http://arxiv.org/abs/2508.17398v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17398v1",
        "arxiv_id": "2508.17398v1",
        "authors": [
            "Aaryaman Kartha",
            "Ahmed Masry",
            "Mohammed Saidul Islam",
            "Thinh Lang",
            "Shadikur Rahman",
            "Ridwan Mahbub",
            "Mizanur Rahman",
            "Mahir Ahmed",
            "Md Rizwan Parvez",
            "Enamul Hoque",
            "Shafiq Joty"
        ],
        "submitted": "2025-08-24 15:11:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Agent-Testing Agent: A Meta-Agent for Automated Testing and Evaluation of Conversational AI Agents",
        "abstract": "LLM agents are increasingly deployed to plan, retrieve, and write with tools,\nyet evaluation still leans on static benchmarks and small human studies. We\npresent the Agent-Testing Agent (ATA), a meta-agent that combines static code\nanalysis, designer interrogation, literature mining, and persona-driven\nadversarial test generation whose difficulty adapts via judge feedback. Each\ndialogue is scored with an LLM-as-a-Judge (LAAJ) rubric and used to steer\nsubsequent tests toward the agent's weakest capabilities. On a travel planner\nand a Wikipedia writer, the ATA surfaces more diverse and severe failures than\nexpert annotators while matching severity, and finishes in 20--30 minutes\nversus ten-annotator rounds that took days. Ablating code analysis and web\nsearch increases variance and miscalibration, underscoring the value of\nevidence-grounded test generation. The ATA outputs quantitative metrics and\nqualitative bug reports for developers. We release the full methodology and\nopen-source implementation for reproducible agent testing:\nhttps://github.com/KhalilMrini/Agent-Testing-Agent",
        "url": "http://arxiv.org/abs/2508.17393v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17393v1",
        "arxiv_id": "2508.17393v1",
        "authors": [
            "Sameer Komoravolu",
            "Khalil Mrini"
        ],
        "submitted": "2025-08-24 15:02:13",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Large Language Models as Universal Predictors? An Empirical Study on Small Tabular Datasets",
        "abstract": "Large Language Models (LLMs), originally developed for natural language\nprocessing (NLP), have demonstrated the potential to generalize across\nmodalities and domains. With their in-context learning (ICL) capabilities, LLMs\ncan perform predictive tasks over structured inputs without explicit\nfine-tuning on downstream tasks. In this work, we investigate the empirical\nfunction approximation capability of LLMs on small-scale structured datasets\nfor classification, regression and clustering tasks. We evaluate the\nperformance of state-of-the-art LLMs (GPT-5, GPT-4o, GPT-o3, Gemini-2.5-Flash,\nDeepSeek-R1) under few-shot prompting and compare them against established\nmachine learning (ML) baselines, including linear models, ensemble methods and\ntabular foundation models (TFMs). Our results show that LLMs achieve strong\nperformance in classification tasks under limited data availability,\nestablishing practical zero-training baselines. In contrast, the performance in\nregression with continuous-valued outputs is poor compared to ML models, likely\nbecause regression demands outputs in a large (often infinite) space, and\nclustering results are similarly limited, which we attribute to the absence of\ngenuine ICL in this setting. Nonetheless, this approach enables rapid,\nlow-overhead data exploration and offers a viable alternative to traditional ML\npipelines in business intelligence and exploratory analytics contexts. We\nfurther analyze the influence of context size and prompt structure on\napproximation quality, identifying trade-offs that affect predictive\nperformance. Our findings suggest that LLMs can serve as general-purpose\npredictive engines for structured data, with clear strengths in classification\nand significant limitations in regression and clustering.",
        "url": "http://arxiv.org/abs/2508.17391v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17391v1",
        "arxiv_id": "2508.17391v1",
        "authors": [
            "Nikolaos Pavlidis",
            "Vasilis Perifanis",
            "Symeon Symeonidis",
            "Pavlos S. Efraimidis"
        ],
        "submitted": "2025-08-24 15:00:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "UI-Level Evaluation of ALLaM 34B: Measuring an Arabic-Centric LLM via HUMAIN Chat",
        "abstract": "Large language models (LLMs) trained primarily on English corpora often\nstruggle to capture the linguistic and cultural nuances of Arabic. To address\nthis gap, the Saudi Data and AI Authority (SDAIA) introduced the $ALLaM$ family\nof Arabic-focused models. The most capable of these available to the public,\n$ALLaM-34B$, was subsequently adopted by HUMAIN, who developed and deployed\nHUMAIN Chat, a closed conversational web service built on this model. This\npaper presents an expanded and refined UI-level evaluation of $ALLaM-34B$.\nUsing a prompt pack spanning modern standard Arabic, five regional dialects,\ncode-switching, factual knowledge, arithmetic and temporal reasoning, creative\ngeneration, and adversarial safety, we collected 115 outputs (23 prompts times\n5 runs) and scored each with three frontier LLM judges (GPT-5, Gemini 2.5 Pro,\nClaude Sonnet-4). We compute category-level means with 95\\% confidence\nintervals, analyze score distributions, and visualize dialect-wise metric heat\nmaps. The updated analysis reveals consistently high performance on generation\nand code-switching tasks (both averaging 4.92/5), alongside strong results in\nMSA handling (4.74/5), solid reasoning ability (4.64/5), and improved dialect\nfidelity (4.21/5). Safety-related prompts show stable, reliable performance of\n(4.54/5). Taken together, these results position $ALLaM-34B$ as a robust and\nculturally grounded Arabic LLM, demonstrating both technical strength and\npractical readiness for real-world deployment.",
        "url": "http://arxiv.org/abs/2508.17378v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17378v1",
        "arxiv_id": "2508.17378v1",
        "authors": [
            "Omer Nacar"
        ],
        "submitted": "2025-08-24 14:32:15",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The Arabic Generality Score: Another Dimension of Modeling Arabic Dialectness",
        "abstract": "Arabic dialects form a diverse continuum, yet NLP models often treat them as\ndiscrete categories. Recent work addresses this issue by modeling dialectness\nas a continuous variable, notably through the Arabic Level of Dialectness\n(ALDi). However, ALDi reduces complex variation to a single dimension. We\npropose a complementary measure: the Arabic Generality Score (AGS), which\nquantifies how widely a word is used across dialects. We introduce a pipeline\nthat combines word alignment, etymology-aware edit distance, and smoothing to\nannotate a parallel corpus with word-level AGS. A regression model is then\ntrained to predict AGS in context. Our approach outperforms strong baselines,\nincluding state-of-the-art dialect ID systems, on a multi-dialect benchmark.\nAGS offers a scalable, linguistically grounded way to model lexical generality,\nenriching representations of Arabic dialectness.",
        "url": "http://arxiv.org/abs/2508.17347v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17347v1",
        "arxiv_id": "2508.17347v1",
        "authors": [
            "Sanad Shaban",
            "Nizar Habash"
        ],
        "submitted": "2025-08-24 13:06:00",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025 Main Conference"
    },
    {
        "title": "Capturing Legal Reasoning Paths from Facts to Law in Court Judgments using Knowledge Graphs",
        "abstract": "Court judgments reveal how legal rules have been interpreted and applied to\nfacts, providing a foundation for understanding structured legal reasoning.\nHowever, existing automated approaches for capturing legal reasoning, including\nlarge language models, often fail to identify the relevant legal context, do\nnot accurately trace how facts relate to legal norms, and may misrepresent the\nlayered structure of judicial reasoning. These limitations hinder the ability\nto capture how courts apply the law to facts in practice. In this paper, we\naddress these challenges by constructing a legal knowledge graph from 648\nJapanese administrative court decisions. Our method extracts components of\nlegal reasoning using prompt-based large language models, normalizes references\nto legal provisions, and links facts, norms, and legal applications through an\nontology of legal inference. The resulting graph captures the full structure of\nlegal reasoning as it appears in real court decisions, making implicit\nreasoning explicit and machine-readable. We evaluate our system using expert\nannotated data, and find that it achieves more accurate retrieval of relevant\nlegal provisions from facts than large language model baselines and\nretrieval-augmented methods.",
        "url": "http://arxiv.org/abs/2508.17340v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17340v1",
        "arxiv_id": "2508.17340v1",
        "authors": [
            "Ryoma Kondo",
            "Riona Matsuoka",
            "Takahiro Yoshida",
            "Kazuyuki Yamasawa",
            "Ryohei Hisano"
        ],
        "submitted": "2025-08-24 12:51:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DropLoRA: Sparse Low-Rank Adaptation for Parameter-Efficient Fine-Tuning",
        "abstract": "LoRA-based large model parameter-efficient fine-tuning (PEFT) methods use\nlow-rank de- composition to approximate updates to model parameters. However,\ncompared to full- parameter fine-tuning, low-rank updates often lead to a\nperformance gap in downstream tasks. To address this, we introduce DropLoRA, a\nnovel pruning-based approach that focuses on pruning the rank dimension. Unlike\nconven- tional methods that attempt to overcome the low-rank bottleneck,\nDropLoRA innovatively integrates a pruning module between the two low-rank\nmatrices in LoRA to simulate dy- namic subspace learning. This dynamic low-\nrank subspace learning allows DropLoRA to overcome the limitations of\ntraditional LoRA, which operates within a static subspace. By continuously\nadapting the learning subspace, DropLoRA significantly boosts performance\nwithout incurring additional training or infer- ence costs. Our experimental\nresults demon- strate that DropLoRA consistently outperforms LoRA in\nfine-tuning the LLaMA series across a wide range of large language model gener-\nation tasks, including commonsense reason- ing, mathematical reasoning, code\ngeneration, and instruction-following. Our code is avail- able at\nhttps://github.com/TayeeChang/DropLoRA.",
        "url": "http://arxiv.org/abs/2508.17337v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17337v1",
        "arxiv_id": "2508.17337v1",
        "authors": [
            "Haojie Zhang"
        ],
        "submitted": "2025-08-24 12:45:36",
        "source": "arxiv",
        "comment": "8 pages"
    },
    {
        "title": "Mind the (Language) Gap: Towards Probing Numerical and Cross-Lingual Limits of LVLMs",
        "abstract": "We introduce MMCRICBENCH-3K, a benchmark for Visual Question Answering (VQA)\non cricket scorecards, designed to evaluate large vision-language models\n(LVLMs) on complex numerical and cross-lingual reasoning over semi-structured\ntabular images. MMCRICBENCH-3K comprises 1,463 synthetically generated\nscorecard images from ODI, T20, and Test formats, accompanied by 1,500 English\nQA pairs. It includes two subsets: MMCRICBENCH-E-1.5K, featuring English\nscorecards, and MMCRICBENCH-H-1.5K, containing visually similar Hindi\nscorecards, with all questions and answers kept in English to enable controlled\ncross-script evaluation. The task demands reasoning over structured numerical\ndata, multi-image context, and implicit domain knowledge. Empirical results\nshow that even state-of-the-art LVLMs, such as GPT-4o and Qwen2.5VL, struggle\non the English subset despite it being their primary training language and\nexhibit a further drop in performance on the Hindi subset. This reveals key\nlimitations in structure-aware visual text understanding, numerical reasoning,\nand cross-lingual generalization. The dataset is publicly available via Hugging\nFace at https://huggingface.co/datasets/DIALab/MMCricBench, to promote LVLM\nresearch in this direction.",
        "url": "http://arxiv.org/abs/2508.17334v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17334v1",
        "arxiv_id": "2508.17334v1",
        "authors": [
            "Somraj Gautam",
            "Abhirama Subramanyam Penamakuri",
            "Abhishek Bhandari",
            "Gaurav Harit"
        ],
        "submitted": "2025-08-24 12:43:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Omne-R1: Learning to Reason with Memory for Multi-hop Question Answering",
        "abstract": "This paper introduces Omne-R1, a novel approach designed to enhance multi-hop\nquestion answering capabilities on schema-free knowledge graphs by integrating\nadvanced reasoning models. Our method employs a multi-stage training workflow,\nincluding two reinforcement learning phases and one supervised fine-tuning\nphase. We address the challenge of limited suitable knowledge graphs and QA\ndata by constructing domain-independent knowledge graphs and auto-generating QA\npairs. Experimental results show significant improvements in answering\nmulti-hop questions, with notable performance gains on more complex 3+ hop\nquestions. Our proposed training framework demonstrates strong generalization\nabilities across diverse knowledge domains.",
        "url": "http://arxiv.org/abs/2508.17330v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17330v1",
        "arxiv_id": "2508.17330v1",
        "authors": [
            "Boyuan Liu",
            "Feng Ji",
            "Jiayan Nan",
            "Han Zhao",
            "Weiling Chen",
            "Shihao Xu",
            "Xing Zhou"
        ],
        "submitted": "2025-08-24 12:36:48",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CultranAI at PalmX 2025: Data Augmentation for Cultural Knowledge Representation",
        "abstract": "In this paper, we report our participation to the PalmX cultural evaluation\nshared task. Our system, CultranAI, focused on data augmentation and LoRA\nfine-tuning of large language models (LLMs) for Arabic cultural knowledge\nrepresentation. We benchmarked several LLMs to identify the best-performing\nmodel for the task. In addition to utilizing the PalmX dataset, we augmented it\nby incorporating the Palm dataset and curated a new dataset of over 22K\nculturally grounded multiple-choice questions (MCQs). Our experiments showed\nthat the Fanar-1-9B-Instruct model achieved the highest performance. We\nfine-tuned this model on the combined augmented dataset of 22K+ MCQs. On the\nblind test set, our submitted system ranked 5th with an accuracy of 70.50%,\nwhile on the PalmX development set, it achieved an accuracy of 84.1%.",
        "url": "http://arxiv.org/abs/2508.17324v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17324v1",
        "arxiv_id": "2508.17324v1",
        "authors": [
            "Hunzalah Hassan Bhatti",
            "Youssef Ahmed",
            "Md Arid Hasan",
            "Firoj Alam"
        ],
        "submitted": "2025-08-24 12:11:21",
        "source": "arxiv",
        "comment": "LLMs, Native, Arabic LLMs, Augmentation, Multilingual, Language\n  Diversity, Contextual Understanding, Minority Languages, Culturally Informed,\n  Foundation Models, Large Language Models"
    },
    {
        "title": "Handling Students Dropouts in an LLM-driven Interactive Online Course Using Language Models",
        "abstract": "Interactive online learning environments, represented by Massive AI-empowered\nCourses (MAIC), leverage LLM-driven multi-agent systems to transform passive\nMOOCs into dynamic, text-based platforms, enhancing interactivity through LLMs.\nThis paper conducts an empirical study on a specific MAIC course to explore\nthree research questions about dropouts in these interactive online courses:\n(1) What factors might lead to dropouts? (2) Can we predict dropouts? (3) Can\nwe reduce dropouts? We analyze interaction logs to define dropouts and identify\ncontributing factors. Our findings reveal strong links between dropout\nbehaviors and textual interaction patterns. We then propose a\ncourse-progress-adaptive dropout prediction framework (CPADP) to predict\ndropouts with at most 95.4% accuracy. Based on this, we design a personalized\nemail recall agent to re-engage at-risk students. Applied in the deployed MAIC\nsystem with over 3,000 students, the feasibility and effectiveness of our\napproach have been validated on students with diverse backgrounds.",
        "url": "http://arxiv.org/abs/2508.17310v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17310v1",
        "arxiv_id": "2508.17310v1",
        "authors": [
            "Yuanchun Wang",
            "Yiyang Fu",
            "Jifan Yu",
            "Daniel Zhang-Li",
            "Zheyuan Zhang",
            "Joy Lim Jia Yin",
            "Yucheng Wang",
            "Peng Zhou",
            "Jing Zhang",
            "Huiqin Liu"
        ],
        "submitted": "2025-08-24 11:40:16",
        "source": "arxiv",
        "comment": "12 pages"
    },
    {
        "title": "Opening the Black Box: Interpretable Remedies for Popularity Bias in Recommender Systems",
        "abstract": "Popularity bias is a well-known challenge in recommender systems, where a\nsmall number of popular items receive disproportionate attention, while the\nmajority of less popular items are largely overlooked. This imbalance often\nresults in reduced recommendation quality and unfair exposure of items.\nAlthough existing mitigation techniques address this bias to some extent, they\ntypically lack transparency in how they operate. In this paper, we propose a\npost-hoc method using a Sparse Autoencoder (SAE) to interpret and mitigate\npopularity bias in deep recommendation models. The SAE is trained to replicate\na pre-trained model's behavior while enabling neuron-level interpretability. By\nintroducing synthetic users with clear preferences for either popular or\nunpopular items, we identify neurons encoding popularity signals based on their\nactivation patterns. We then adjust the activations of the most biased neurons\nto steer recommendations toward fairer exposure. Experiments on two public\ndatasets using a sequential recommendation model show that our method\nsignificantly improves fairness with minimal impact on accuracy. Moreover, it\noffers interpretability and fine-grained control over the fairness-accuracy\ntrade-off.",
        "url": "http://arxiv.org/abs/2508.17297v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17297v1",
        "arxiv_id": "2508.17297v1",
        "authors": [
            "Parviz Ahmadov",
            "Masoud Mansoury"
        ],
        "submitted": "2025-08-24 10:59:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "From Language to Action: A Review of Large Language Models as Autonomous Agents and Tool Users",
        "abstract": "The pursuit of human-level artificial intelligence (AI) has significantly\nadvanced the development of autonomous agents and Large Language Models (LLMs).\nLLMs are now widely utilized as decision-making agents for their ability to\ninterpret instructions, manage sequential tasks, and adapt through feedback.\nThis review examines recent developments in employing LLMs as autonomous agents\nand tool users and comprises seven research questions. We only used the papers\npublished between 2023 and 2025 in conferences of the A* and A rank and Q1\njournals. A structured analysis of the LLM agents' architectural design\nprinciples, dividing their applications into single-agent and multi-agent\nsystems, and strategies for integrating external tools is presented. In\naddition, the cognitive mechanisms of LLM, including reasoning, planning, and\nmemory, and the impact of prompting methods and fine-tuning procedures on agent\nperformance are also investigated. Furthermore, we evaluated current benchmarks\nand assessment protocols and have provided an analysis of 68 publicly available\ndatasets to assess the performance of LLM-based agents in various tasks. In\nconducting this review, we have identified critical findings on verifiable\nreasoning of LLMs, the capacity for self-improvement, and the personalization\nof LLM-based agents. Finally, we have discussed ten future research directions\nto overcome these gaps.",
        "url": "http://arxiv.org/abs/2508.17281v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17281v1",
        "arxiv_id": "2508.17281v1",
        "authors": [
            "Sadia Sultana Chowa",
            "Riasad Alvi",
            "Subhey Sadi Rahman",
            "Md Abdur Rahman",
            "Mohaimenul Azam Khan Raiaan",
            "Md Rafiqul Islam",
            "Mukhtar Hussain",
            "Sami Azam"
        ],
        "submitted": "2025-08-24 10:02:51",
        "source": "arxiv",
        "comment": "40 pages, 6 figures, 10 tables. Submitted to Artificial Intelligence\n  Review for peer review"
    },
    {
        "title": "Are You Sure You're Positive? Consolidating Chain-of-Thought Agents with Uncertainty Quantification for Aspect-Category Sentiment Analysis",
        "abstract": "Aspect-category sentiment analysis provides granular insights by identifying\nspecific themes within product reviews that are associated with particular\nopinions. Supervised learning approaches dominate the field. However, data is\nscarce and expensive to annotate for new domains. We argue that leveraging\nlarge language models in a zero-shot setting is beneficial where the time and\nresources required for dataset annotation are limited. Furthermore, annotation\nbias may lead to strong results using supervised methods but transfer poorly to\nnew domains in contexts that lack annotations and demand reproducibility. In\nour work, we propose novel techniques that combine multiple chain-of-thought\nagents by leveraging large language models' token-level uncertainty scores. We\nexperiment with the 3B and 70B+ parameter size variants of Llama and Qwen\nmodels, demonstrating how these approaches can fulfil practical needs and\nopening a discussion on how to gauge accuracy in label-scarce conditions.",
        "url": "http://arxiv.org/abs/2508.17258v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17258v1",
        "arxiv_id": "2508.17258v1",
        "authors": [
            "Filippos Ventirozos",
            "Peter Appleby",
            "Matthew Shardlow"
        ],
        "submitted": "2025-08-24 08:51:16",
        "source": "arxiv",
        "comment": "18 pages, 10 figures, 3 tables, Proceedings of the 1st Workshop for\n  Research on Agent Language Models (REALM 2025)"
    },
    {
        "title": "Routing Distilled Knowledge via Mixture of LoRA Experts for Large Language Model based Bundle Generation",
        "abstract": "Large Language Models (LLMs) have shown potential in automatic bundle\ngeneration but suffer from prohibitive computational costs. Although knowledge\ndistillation offers a pathway to more efficient student models, our preliminary\nstudy reveals that naively integrating diverse types of distilled knowledge\nfrom teacher LLMs into student LLMs leads to knowledge conflict, negatively\nimpacting the performance of bundle generation. To address this, we propose\nRouteDK, a framework for routing distilled knowledge through a mixture of LoRA\nexpert architecture. Specifically, we first distill knowledge from the teacher\nLLM for bundle generation in two complementary types: high-level knowledge\n(generalizable rules) and fine-grained knowledge (session-specific reasoning).\nWe then train knowledge-specific LoRA experts for each type of knowledge\ntogether with a base LoRA expert. For effective integration, we propose a\ndynamic fusion module, featuring an input-aware router, where the router\nbalances expert contributions by dynamically determining optimal weights based\non input, thereby effectively mitigating knowledge conflicts. To further\nimprove inference reliability, we design an inference-time enhancement module\nto reduce variance and mitigate suboptimal reasoning. Experiments on three\npublic datasets show that our RouteDK achieves accuracy comparable to or even\nbetter than the teacher LLM, while maintaining strong computational efficiency.\nIn addition, it outperforms state-of-the-art approaches for bundle generation.",
        "url": "http://arxiv.org/abs/2508.17250v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17250v1",
        "arxiv_id": "2508.17250v1",
        "authors": [
            "Kaidong Feng",
            "Zhu Sun",
            "Hui Fang",
            "Jie Yang",
            "Wenyuan Liu",
            "Yew-Soon Ong"
        ],
        "submitted": "2025-08-24 08:19:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CoViPAL: Layer-wise Contextualized Visual Token Pruning for Large Vision-Language Models",
        "abstract": "Large Vision-Language Models (LVLMs) process multimodal inputs consisting of\ntext tokens and vision tokens extracted from images or videos. Due to the rich\nvisual information, a single image can generate thousands of vision tokens,\nleading to high computational costs during the prefilling stage and significant\nmemory overhead during decoding. Existing methods attempt to prune redundant\nvision tokens, revealing substantial redundancy in visual representations.\nHowever, these methods often struggle in shallow layers due to the lack of\nsufficient contextual information. We argue that many visual tokens are\ninherently redundant even in shallow layers and can be safely and effectively\npruned with appropriate contextual signals. In this work, we propose CoViPAL, a\nlayer-wise contextualized visual token pruning method that employs a\nPlug-and-Play Pruning Module (PPM) to predict and remove redundant vision\ntokens before they are processed by the LVLM. The PPM is lightweight,\nmodel-agnostic, and operates independently of the LVLM architecture, ensuring\nseamless integration with various models. Extensive experiments on multiple\nbenchmarks demonstrate that CoViPAL outperforms training-free pruning methods\nunder equal token budgets and surpasses training-based methods with comparable\nsupervision. CoViPAL offers a scalable and efficient solution to improve\ninference efficiency in LVLMs without compromising accuracy.",
        "url": "http://arxiv.org/abs/2508.17243v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17243v1",
        "arxiv_id": "2508.17243v1",
        "authors": [
            "Zicong Tang",
            "Ziyang Ma",
            "Suqing Wang",
            "Zuchao Li",
            "Lefei Zhang",
            "Hai Zhao",
            "Yun Li",
            "Qianren Wang"
        ],
        "submitted": "2025-08-24 07:47:00",
        "source": "arxiv",
        "comment": "Accepted by EMNLP 2025 Findings"
    },
    {
        "title": "ClaimGen-CN: A Large-scale Chinese Dataset for Legal Claim Generation",
        "abstract": "Legal claims refer to the plaintiff's demands in a case and are essential to\nguiding judicial reasoning and case resolution. While many works have focused\non improving the efficiency of legal professionals, the research on helping\nnon-professionals (e.g., plaintiffs) remains unexplored. This paper explores\nthe problem of legal claim generation based on the given case's facts. First,\nwe construct ClaimGen-CN, the first dataset for Chinese legal claim generation\ntask, from various real-world legal disputes. Additionally, we design an\nevaluation metric tailored for assessing the generated claims, which\nencompasses two essential dimensions: factuality and clarity. Building on this,\nwe conduct a comprehensive zero-shot evaluation of state-of-the-art general and\nlegal-domain large language models. Our findings highlight the limitations of\nthe current models in factual precision and expressive clarity, pointing to the\nneed for more targeted development in this domain. To encourage further\nexploration of this important task, we will make the dataset publicly\navailable.",
        "url": "http://arxiv.org/abs/2508.17234v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17234v1",
        "arxiv_id": "2508.17234v1",
        "authors": [
            "Siying Zhou",
            "Yiquan Wu",
            "Hui Chen",
            "Xavier Hu",
            "Kun Kuang",
            "Adam Jatowt",
            "Ming Hu",
            "Chunyan Zheng",
            "Fei Wu"
        ],
        "submitted": "2025-08-24 07:19:25",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SSFO: Self-Supervised Faithfulness Optimization for Retrieval-Augmented Generation",
        "abstract": "Retrieval-Augmented Generation (RAG) systems require Large Language Models\n(LLMs) to generate responses that are faithful to the retrieved context.\nHowever, faithfulness hallucination remains a critical challenge, as existing\nmethods often require costly supervision and post-training or significant\ninference burdens. To overcome these limitations, we introduce Self-Supervised\nFaithfulness Optimization (SSFO), the first self-supervised alignment approach\nfor enhancing RAG faithfulness. SSFO constructs preference data pairs by\ncontrasting the model's outputs generated with and without the context.\nLeveraging Direct Preference Optimization (DPO), SSFO aligns model faithfulness\nwithout incurring labeling costs or additional inference burden. We\ntheoretically and empirically demonstrate that SSFO leverages a benign form of\n\\emph{likelihood displacement}, transferring probability mass from\nparametric-based tokens to context-aligned tokens. Based on this insight, we\npropose a modified DPO loss function to encourage likelihood displacement.\nComprehensive evaluations show that SSFO significantly outperforms existing\nmethods, achieving state-of-the-art faithfulness on multiple context-based\nquestion-answering datasets. Notably, SSFO exhibits strong generalization,\nimproving cross-lingual faithfulness and preserving general\ninstruction-following capabilities. We release our code and model at the\nanonymous link: https://github.com/chkwy/SSFO",
        "url": "http://arxiv.org/abs/2508.17225v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17225v1",
        "arxiv_id": "2508.17225v1",
        "authors": [
            "Xiaqiang Tang",
            "Yi Wang",
            "Keyu Hu",
            "Rui Xu",
            "Chuang Li",
            "Weigao Sun",
            "Jian Li",
            "Sihong Xie"
        ],
        "submitted": "2025-08-24 06:58:29",
        "source": "arxiv",
        "comment": "Working in progress"
    },
    {
        "title": "Exposing Privacy Risks in Graph Retrieval-Augmented Generation",
        "abstract": "Retrieval-Augmented Generation (RAG) is a powerful technique for enhancing\nLarge Language Models (LLMs) with external, up-to-date knowledge. Graph RAG has\nemerged as an advanced paradigm that leverages graph-based knowledge structures\nto provide more coherent and contextually rich answers. However, the move from\nplain document retrieval to structured graph traversal introduces new,\nunder-explored privacy risks. This paper investigates the data extraction\nvulnerabilities of the Graph RAG systems. We design and execute tailored data\nextraction attacks to probe their susceptibility to leaking both raw text and\nstructured data, such as entities and their relationships. Our findings reveal\na critical trade-off: while Graph RAG systems may reduce raw text leakage, they\nare significantly more vulnerable to the extraction of structured entity and\nrelationship information. We also explore potential defense mechanisms to\nmitigate these novel attack surfaces. This work provides a foundational\nanalysis of the unique privacy challenges in Graph RAG and offers insights for\nbuilding more secure systems.",
        "url": "http://arxiv.org/abs/2508.17222v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17222v1",
        "arxiv_id": "2508.17222v1",
        "authors": [
            "Jiale Liu",
            "Jiahao Zhang",
            "Suhang Wang"
        ],
        "submitted": "2025-08-24 06:19:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Multi-Agent Visual-Language Reasoning for Comprehensive Highway Scene Understanding",
        "abstract": "This paper introduces a multi-agent framework for comprehensive highway scene\nunderstanding, designed around a mixture-of-experts strategy. In this\nframework, a large generic vision-language model (VLM), such as GPT-4o, is\ncontextualized with domain knowledge to generates task-specific\nchain-of-thought (CoT) prompts. These fine-grained prompts are then used to\nguide a smaller, efficient VLM (e.g., Qwen2.5-VL-7B) in reasoning over short\nvideos, along with complementary modalities as applicable. The framework\nsimultaneously addresses multiple critical perception tasks, including weather\nclassification, pavement wetness assessment, and traffic congestion detection,\nachieving robust multi-task reasoning while balancing accuracy and\ncomputational efficiency. To support empirical validation, we curated three\nspecialized datasets aligned with these tasks. Notably, the pavement wetness\ndataset is multimodal, combining video streams with road weather sensor data,\nhighlighting the benefits of multimodal reasoning. Experimental results\ndemonstrate consistently strong performance across diverse traffic and\nenvironmental conditions. From a deployment perspective, the framework can be\nreadily integrated with existing traffic camera systems and strategically\napplied to high-risk rural locations, such as sharp curves, flood-prone\nlowlands, or icy bridges. By continuously monitoring the targeted sites, the\nsystem enhances situational awareness and delivers timely alerts, even in\nresource-constrained environments.",
        "url": "http://arxiv.org/abs/2508.17205v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17205v1",
        "arxiv_id": "2508.17205v1",
        "authors": [
            "Yunxiang Yang",
            "Ningning Xu",
            "Jidong J. Yang"
        ],
        "submitted": "2025-08-24 03:55:24",
        "source": "arxiv",
        "comment": "16 pages, 16 figures, 8 tables"
    },
    {
        "title": "Active Domain Knowledge Acquisition with \\$100 Budget: Enhancing LLMs via Cost-Efficient, Expert-Involved Interaction in Sensitive Domains",
        "abstract": "Large Language Models (LLMs) have demonstrated an impressive level of general\nknowledge. However, they often struggle in highly specialized and\ncost-sensitive domains such as drug discovery and rare disease research due to\nthe lack of expert knowledge. In this paper, we propose a novel framework\n(PU-ADKA) designed to efficiently enhance domain-specific LLMs by actively\nengaging domain experts within a fixed budget. Unlike traditional fine-tuning\napproaches, PU-ADKA selectively identifies and queries the most appropriate\nexpert from a team, taking into account each expert's availability, knowledge\nboundaries, and consultation costs. We train PU-ADKA using simulations on\nPubMed data and validate it through both controlled expert interactions and\nreal-world deployment with a drug development team, demonstrating its\neffectiveness in enhancing LLM performance in specialized domains under strict\nbudget constraints. In addition to outlining our methodological innovations and\nexperimental results, we introduce a new benchmark dataset, CKAD, for\ncost-effective LLM domain knowledge acquisition to foster further research in\nthis challenging area.",
        "url": "http://arxiv.org/abs/2508.17202v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17202v1",
        "arxiv_id": "2508.17202v1",
        "authors": [
            "Yang Wu",
            "Raha Moraffah",
            "Rujing Yao",
            "Jinhong Yu",
            "Zhimin Tao",
            "Xiaozhong Liu"
        ],
        "submitted": "2025-08-24 03:34:40",
        "source": "arxiv",
        "comment": "EMNLP 2025 Findings"
    },
    {
        "title": "Towards Alignment-Centric Paradigm: A Survey of Instruction Tuning in Large Language Models",
        "abstract": "Instruction tuning is a pivotal technique for aligning large language models\n(LLMs) with human intentions, safety constraints, and domain-specific\nrequirements. This survey provides a comprehensive overview of the full\npipeline, encompassing (i) data collection methodologies, (ii) full-parameter\nand parameter-efficient fine-tuning strategies, and (iii) evaluation protocols.\nWe categorized data construction into three major paradigms: expert annotation,\ndistillation from larger models, and self-improvement mechanisms, each offering\ndistinct trade-offs between quality, scalability, and resource cost.\nFine-tuning techniques range from conventional supervised training to\nlightweight approaches, such as low-rank adaptation (LoRA) and prefix tuning,\nwith a focus on computational efficiency and model reusability. We further\nexamine the challenges of evaluating faithfulness, utility, and safety across\nmultilingual and multimodal scenarios, highlighting the emergence of\ndomain-specific benchmarks in healthcare, legal, and financial applications.\nFinally, we discuss promising directions for automated data generation,\nadaptive optimization, and robust evaluation frameworks, arguing that a closer\nintegration of data, algorithms, and human feedback is essential for advancing\ninstruction-tuned LLMs. This survey aims to serve as a practical reference for\nresearchers and practitioners seeking to design LLMs that are both effective\nand reliably aligned with human intentions.",
        "url": "http://arxiv.org/abs/2508.17184v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17184v1",
        "arxiv_id": "2508.17184v1",
        "authors": [
            "Xudong Han",
            "Junjie Yang",
            "Tianyang Wang",
            "Ziqian Bi",
            "Junfeng Hao",
            "Junhao Song"
        ],
        "submitted": "2025-08-24 01:51:55",
        "source": "arxiv",
        "comment": "24 pages, 7 figures, 5 tables"
    },
    {
        "title": "LLM Assertiveness can be Mechanistically Decomposed into Emotional and Logical Components",
        "abstract": "Large Language Models (LLMs) often display overconfidence, presenting\ninformation with unwarranted certainty in high-stakes contexts. We investigate\nthe internal basis of this behavior via mechanistic interpretability. Using\nopen-sourced Llama 3.2 models fine-tuned on human annotated assertiveness\ndatasets, we extract residual activations across all layers, and compute\nsimilarity metrics to localize assertive representations. Our analysis\nidentifies layers most sensitive to assertiveness contrasts and reveals that\nhigh-assertive representations decompose into two orthogonal sub-components of\nemotional and logical clusters-paralleling the dual-route Elaboration\nLikelihood Model in Psychology. Steering vectors derived from these\nsub-components show distinct causal effects: emotional vectors broadly\ninfluence prediction accuracy, while logical vectors exert more localized\neffects. These findings provide mechanistic evidence for the multi-component\nstructure of LLM assertiveness and highlight avenues for mitigating\noverconfident behavior.",
        "url": "http://arxiv.org/abs/2508.17182v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17182v1",
        "arxiv_id": "2508.17182v1",
        "authors": [
            "Hikaru Tsujimura",
            "Arush Tagade"
        ],
        "submitted": "2025-08-24 01:43:48",
        "source": "arxiv",
        "comment": "This preprint is under review"
    },
    {
        "title": "The Impact of Annotator Personas on LLM Behavior Across the Perspectivism Spectrum",
        "abstract": "In this work, we explore the capability of Large Language Models (LLMs) to\nannotate hate speech and abusiveness while considering predefined annotator\npersonas within the strong-to-weak data perspectivism spectra. We evaluated\nLLM-generated annotations against existing annotator modeling techniques for\nperspective modeling. Our findings show that LLMs selectively use demographic\nattributes from the personas. We identified prototypical annotators, with\npersona features that show varying degrees of alignment with the original human\nannotators. Within the data perspectivism paradigm, annotator modeling\ntechniques that do not explicitly rely on annotator information performed\nbetter under weak data perspectivism compared to both strong data perspectivism\nand human annotations, suggesting LLM-generated views tend towards aggregation\ndespite subjective prompting. However, for more personalized datasets tailored\nto strong perspectivism, the performance of LLM annotator modeling approached,\nbut did not exceed, human annotators.",
        "url": "http://arxiv.org/abs/2508.17164v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17164v1",
        "arxiv_id": "2508.17164v1",
        "authors": [
            "Olufunke O. Sarumi",
            "Charles Welch",
            "Daniel Braun",
            "Jörg Schlötterer"
        ],
        "submitted": "2025-08-23 23:32:09",
        "source": "arxiv",
        "comment": "Accepted at ICNLSP 2025, Odense, Denmark"
    },
    {
        "title": "Quantifying Language Disparities in Multilingual Large Language Models",
        "abstract": "Results reported in large-scale multilingual evaluations are often fragmented\nand confounded by factors such as target languages, differences in experimental\nsetups, and model choices. We propose a framework that disentangles these\nconfounding variables and introduces three interpretable metrics--the\nperformance realisation ratio, its coefficient of variation, and language\npotential--enabling a finer-grained and more insightful quantification of\nactual performance disparities across both (i) models and (ii) languages.\nThrough a case study of 13 model variants on 11 multilingual datasets, we\ndemonstrate that our framework provides a more reliable measurement of model\nperformance and language disparities, particularly for low-resource languages,\nwhich have so far proven challenging to evaluate. Importantly, our results\nreveal that higher overall model performance does not necessarily imply greater\nfairness across languages.",
        "url": "http://arxiv.org/abs/2508.17162v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17162v1",
        "arxiv_id": "2508.17162v1",
        "authors": [
            "Songbo Hu",
            "Ivan Vulić",
            "Anna Korhonen"
        ],
        "submitted": "2025-08-23 23:25:38",
        "source": "arxiv",
        "comment": "Accepted at EMNLP 2025"
    },
    {
        "title": "SPORTSQL: An Interactive System for Real-Time Sports Reasoning and Visualization",
        "abstract": "We present a modular, interactive system, SPORTSQL, for natural language\nquerying and visualization of dynamic sports data, with a focus on the English\nPremier League (EPL). The system translates user questions into executable SQL\nover a live, temporally indexed database constructed from real-time Fantasy\nPremier League (FPL) data. It supports both tabular and visual outputs,\nleveraging the symbolic reasoning capabilities of Large Language Models (LLMs)\nfor query parsing, schema linking, and visualization selection. To evaluate\nsystem performance, we introduce the Dynamic Sport Question Answering benchmark\n(DSQABENCH), comprising 1,700+ queries annotated with SQL programs, gold\nanswers, and database snapshots. Our demo highlights how non-expert users can\nseamlessly explore evolving sports statistics through a natural, conversational\ninterface.",
        "url": "http://arxiv.org/abs/2508.17157v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17157v1",
        "arxiv_id": "2508.17157v1",
        "authors": [
            "Sebastian Martinez",
            "Naman Ahuja",
            "Fenil Bardoliya",
            "Chris Bryan",
            "Vivek Gupta"
        ],
        "submitted": "2025-08-23 22:51:30",
        "source": "arxiv",
        "comment": "Under Review at EMNLP"
    },
    {
        "title": "Natural Language Satisfiability: Exploring the Problem Distribution and Evaluating Transformer-based Language Models",
        "abstract": "Efforts to apply transformer-based language models (TLMs) to the problem of\nreasoning in natural language have enjoyed ever-increasing success in recent\nyears. The most fundamental task in this area to which nearly all others can be\nreduced is that of determining satisfiability. However, from a logical point of\nview, satisfiability problems vary along various dimensions, which may affect\nTLMs' ability to learn how to solve them. The problem instances of\nsatisfiability in natural language can belong to different computational\ncomplexity classes depending on the language fragment in which they are\nexpressed. Although prior research has explored the problem of natural language\nsatisfiability, the above-mentioned point has not been discussed adequately.\nHence, we investigate how problem instances from varying computational\ncomplexity classes and having different grammatical constructs impact TLMs'\nability to learn rules of inference. Furthermore, to faithfully evaluate TLMs,\nwe conduct an empirical study to explore the distribution of satisfiability\nproblems.",
        "url": "http://arxiv.org/abs/2508.17153v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17153v1",
        "arxiv_id": "2508.17153v1",
        "authors": [
            "Tharindu Madusanka",
            "Ian Pratt-Hartmann",
            "Riza Batista-Navarro"
        ],
        "submitted": "2025-08-23 22:19:16",
        "source": "arxiv",
        "comment": "The paper was accepted to the 62nd Association for Computational\n  Linguistics (ACL 2024), where it won the Best Paper Award"
    },
    {
        "title": "Geolocation-Aware Robust Spoken Language Identification",
        "abstract": "While Self-supervised Learning (SSL) has significantly improved Spoken\nLanguage Identification (LID), existing models often struggle to consistently\nclassify dialects and accents of the same language as a unified class. To\naddress this challenge, we propose geolocation-aware LID, a novel approach that\nincorporates language-level geolocation information into the SSL-based LID\nmodel. Specifically, we introduce geolocation prediction as an auxiliary task\nand inject the predicted vectors into intermediate representations as\nconditioning signals. This explicit conditioning encourages the model to learn\nmore unified representations for dialectal and accented variations. Experiments\nacross six multilingual datasets demonstrate that our approach improves\nrobustness to intra-language variations and unseen domains, achieving new\nstate-of-the-art accuracy on FLEURS (97.7%) and 9.7% relative improvement on\nML-SUPERB 2.0 dialect set.",
        "url": "http://arxiv.org/abs/2508.17148v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17148v1",
        "arxiv_id": "2508.17148v1",
        "authors": [
            "Qingzheng Wang",
            "Hye-jin Shim",
            "Jiancheng Sun",
            "Shinji Watanabe"
        ],
        "submitted": "2025-08-23 21:49:27",
        "source": "arxiv",
        "comment": "Accepted to IEEE ASRU 2025. \\c{opyright} 2025 IEEE. Personal use\n  permitted. Permission from IEEE required for all other uses including\n  reprinting/republishing, advertising, resale, redistribution, reuse, or\n  creating collective works"
    },
    {
        "title": "The Power of Framing: How News Headlines Guide Search Behavior",
        "abstract": "Search engines play a central role in how people gather information, but\nsubtle cues like headline framing may influence not only what users believe but\nalso how they search. While framing effects on judgment are well documented,\ntheir impact on subsequent search behavior is less understood. We conducted a\ncontrolled experiment where participants issued queries and selected from\nheadlines filtered by specific linguistic frames. Headline framing\nsignificantly shaped follow-up queries: conflict and strategy frames disrupted\nalignment with prior selections, while episodic frames led to more concrete\nqueries than thematic ones. We also observed modest short-term frame\npersistence that declined over time. These results suggest that even brief\nexposure to framing can meaningfully alter the direction of users\ninformation-seeking behavior.",
        "url": "http://arxiv.org/abs/2508.17131v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17131v1",
        "arxiv_id": "2508.17131v1",
        "authors": [
            "Amrit Poudel",
            "Maria Milkowski",
            "Tim Weninger"
        ],
        "submitted": "2025-08-23 20:12:19",
        "source": "arxiv",
        "comment": "Accepted to EMNLP"
    },
    {
        "title": "A Straightforward Pipeline for Targeted Entailment and Contradiction Detection",
        "abstract": "Finding the relationships between sentences in a document is crucial for\ntasks like fact-checking, argument mining, and text summarization. A key\nchallenge is to identify which sentences act as premises or contradictions for\na specific claim. Existing methods often face a trade-off: transformer\nattention mechanisms can identify salient textual connections but lack explicit\nsemantic labels, while Natural Language Inference (NLI) models can classify\nrelationships between sentence pairs but operate independently of contextual\nsaliency. In this work, we introduce a method that combines the strengths of\nboth approaches for a targeted analysis. Our pipeline first identifies\ncandidate sentences that are contextually relevant to a user-selected target\nsentence by aggregating token-level attention scores. It then uses a pretrained\nNLI model to classify each candidate as a premise (entailment) or\ncontradiction. By filtering NLI-identified relationships with attention-based\nsaliency scores, our method efficiently isolates the most significant semantic\nrelationships for any given claim in a text.",
        "url": "http://arxiv.org/abs/2508.17127v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17127v1",
        "arxiv_id": "2508.17127v1",
        "authors": [
            "Antonin Sulc"
        ],
        "submitted": "2025-08-23 19:59:24",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Token Homogenization under Positional Bias",
        "abstract": "This paper investigates token homogenization - the convergence of token\nrepresentations toward uniformity across transformer layers and its\nrelationship to positional bias in large language models. We empirically\nexamine whether homogenization occurs and how positional bias amplifies this\neffect. Through layer-wise similarity analysis and controlled experiments, we\ndemonstrate that tokens systematically lose distinctiveness during processing,\nparticularly when biased toward extremal positions. Our findings confirm both\nthe existence of homogenization and its dependence on positional attention\nmechanisms.",
        "url": "http://arxiv.org/abs/2508.17126v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17126v1",
        "arxiv_id": "2508.17126v1",
        "authors": [
            "Viacheslav Yusupov",
            "Danil Maksimov",
            "Ameliia Alaeva",
            "Tatiana Zaitceva",
            "Antipina Anna",
            "Anna Vasileva",
            "Chenlin Liu",
            "Rayuth Chheng",
            "Danil Sazanakov",
            "Andrey Chetvergov",
            "Alina Ermilova",
            "Egor Shvetsov"
        ],
        "submitted": "2025-08-23 19:59:05",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "VQL: An End-to-End Context-Aware Vector Quantization Attention for Ultra-Long User Behavior Modeling",
        "abstract": "In large-scale recommender systems, ultra-long user behavior sequences encode\nrich signals of evolving interests. Extending sequence length generally\nimproves accuracy, but directly modeling such sequences in production is\ninfeasible due to latency and memory constraints. Existing solutions fall into\ntwo categories: (1) top-k retrieval, which truncates the sequence and may\ndiscard most attention mass when L >> k; and (2) encoder-based compression,\nwhich preserves coverage but often over-compresses and fails to incorporate key\ncontext such as temporal gaps or target-aware signals. Neither class achieves a\ngood balance of low-loss compression, context awareness, and efficiency.\n  We propose VQL, a context-aware Vector Quantization Attention framework for\nultra-long behavior modeling, with three innovations. (1) Key-only\nquantization: only attention keys are quantized, while values remain intact; we\nprove that softmax normalization yields an error bound independent of sequence\nlength, and a codebook loss directly supervises quantization quality. This also\nenables L-free inference via offline caches. (2) Multi-scale quantization:\nattention heads are partitioned into groups, each with its own small codebook,\nwhich reduces quantization error while keeping cache size fixed. (3) Efficient\ncontext injection: static features (e.g., item category, modality) are directly\nintegrated, and relative position is modeled via a separable temporal kernel.\nAll context is injected without enlarging the codebook, so cached\nrepresentations remain query-independent.\n  Experiments on three large-scale datasets (KuaiRand-1K, KuaiRec, TMALL) show\nthat VQL consistently outperforms strong baselines, achieving higher accuracy\nwhile reducing inference latency, establishing a new state of the art in\nbalancing accuracy and efficiency for ultra-long sequence recommendation.",
        "url": "http://arxiv.org/abs/2508.17125v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17125v1",
        "arxiv_id": "2508.17125v1",
        "authors": [
            "Kaiyuan Li",
            "Yongxiang Tang",
            "Yanhua Cheng",
            "Yong Bai",
            "Yanxiang Zeng",
            "Chao Wang",
            "Xialong Liu",
            "Peng Jiang"
        ],
        "submitted": "2025-08-23 19:58:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Zero-shot Multimodal Document Retrieval via Cross-modal Question Generation",
        "abstract": "Rapid advances in Multimodal Large Language Models (MLLMs) have expanded\ninformation retrieval beyond purely textual inputs, enabling retrieval from\ncomplex real world documents that combine text and visuals. However, most\ndocuments are private either owned by individuals or confined within corporate\nsilos and current retrievers struggle when faced with unseen domains or\nlanguages. To address this gap, we introduce PREMIR, a simple yet effective\nframework that leverages the broad knowledge of an MLLM to generate cross modal\npre questions (preQs) before retrieval. Unlike earlier multimodal retrievers\nthat compare embeddings in a single vector space, PREMIR leverages preQs from\nmultiple complementary modalities to expand the scope of matching to the token\nlevel. Experiments show that PREMIR achieves state of the art performance on\nout of distribution benchmarks, including closed domain and multilingual\nsettings, outperforming strong baselines across all retrieval metrics. We\nconfirm the contribution of each component through in depth ablation studies,\nand qualitative analyses of the generated preQs further highlight the model's\nrobustness in real world settings.",
        "url": "http://arxiv.org/abs/2508.17079v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17079v1",
        "arxiv_id": "2508.17079v1",
        "authors": [
            "Yejin Choi",
            "Jaewoo Park",
            "Janghan Yoon",
            "Saejin Kim",
            "Jaehyun Jeon",
            "Youngjae Yu"
        ],
        "submitted": "2025-08-23 16:14:41",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Linguistic Neuron Overlap Patterns to Facilitate Cross-lingual Transfer on Low-resource Languages",
        "abstract": "The current Large Language Models (LLMs) face significant challenges in\nimproving performance on low-resource languages and urgently need\ndata-efficient methods without costly fine-tuning. From the perspective of\nlanguage-bridge, we propose BridgeX-ICL, a simple yet effective method to\nimprove zero-shot Cross-lingual In-Context Learning (X-ICL) for low-resource\nlanguages. Unlike existing works focusing on language-specific neurons,\nBridgeX-ICL explores whether sharing neurons can improve cross-lingual\nperformance in LLMs or not. We construct neuron probe data from the\nground-truth MUSE bilingual dictionaries, and define a subset of language\noverlap neurons accordingly, to ensure full activation of these anchored\nneurons. Subsequently, we propose an HSIC-based metric to quantify LLMs'\ninternal linguistic spectrum based on overlap neurons, which guides optimal\nbridge selection. The experiments conducted on 2 cross-lingual tasks and 15\nlanguage pairs from 7 diverse families (covering both high-low and moderate-low\npairs) validate the effectiveness of BridgeX-ICL and offer empirical insights\ninto the underlying multilingual mechanisms of LLMs.",
        "url": "http://arxiv.org/abs/2508.17078v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17078v1",
        "arxiv_id": "2508.17078v1",
        "authors": [
            "Yuemei Xu",
            "Kexin Xu",
            "Jian Zhou",
            "Ling Hu",
            "Lin Gui"
        ],
        "submitted": "2025-08-23 16:13:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Towards a Real-World Aligned Benchmark for Unlearning in Recommender Systems",
        "abstract": "Modern recommender systems heavily leverage user interaction data to deliver\npersonalized experiences. However, relying on personal data presents challenges\nin adhering to privacy regulations, such as the GDPR's \"right to be forgotten\".\nMachine unlearning (MU) aims to address these challenges by enabling the\nefficient removal of specific training data from models post-training, without\ncompromising model utility or leaving residual information. However, current\nbenchmarks for unlearning in recommender systems -- most notably CURE4Rec --\nfail to reflect real-world operational demands. They focus narrowly on\ncollaborative filtering, overlook tasks like session-based and next-basket\nrecommendation, simulate unrealistically large unlearning requests, and ignore\ncritical efficiency constraints. In this paper, we propose a set of design\ndesiderata and research questions to guide the development of a more realistic\nbenchmark for unlearning in recommender systems, with the goal of gathering\nfeedback from the research community. Our benchmark proposal spans multiple\nrecommendation tasks, includes domain-specific unlearning scenarios, and\nseveral unlearning algorithms -- including ones adapted from a recent NeurIPS\nunlearning competition. Furthermore, we argue for an unlearning setup that\nreflects the sequential, time-sensitive nature of real-world deletion requests.\nWe also present a preliminary experiment in a next-basket recommendation\nsetting based on our proposed desiderata and find that unlearning also works\nfor sequential recommendation models, exposed to many small unlearning\nrequests. In this case, we observe that a modification of a custom-designed\nunlearning algorithm for recommender systems outperforms general unlearning\nalgorithms significantly, and that unlearning can be executed with a latency of\nonly several seconds.",
        "url": "http://arxiv.org/abs/2508.17076v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17076v1",
        "arxiv_id": "2508.17076v1",
        "authors": [
            "Pierre Lubitzsch",
            "Olga Ovcharenko",
            "Hao Chen",
            "Maarten de Rijke",
            "Sebastian Schelter"
        ],
        "submitted": "2025-08-23 16:05:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Anemoi: A Semi-Centralized Multi-agent Systems Based on Agent-to-Agent Communication MCP server from Coral Protocol",
        "abstract": "Recent advances in generalist multi-agent systems (MAS) have largely followed\na context-engineering plus centralized paradigm, where a planner agent\ncoordinates multiple worker agents through unidirectional prompt passing. While\neffective under strong planner models, this design suffers from two critical\nlimitations: (1) strong dependency on the planner's capability, which leads to\ndegraded performance when a smaller LLM powers the planner; and (2) limited\ninter-agent communication, where collaboration relies on costly prompt\nconcatenation and context injection, introducing redundancy and information\nloss. To address these challenges, we propose Anemoi, a semi-centralized MAS\nbuilt on the Agent-to-Agent (A2A) communication MCP server from Coral Protocol.\nUnlike traditional designs, Anemoi enables structured and direct inter-agent\ncollaboration, allowing all agents to monitor progress, assess results,\nidentify bottlenecks, and propose refinements in real time. This paradigm\nreduces reliance on a single planner, supports adaptive plan updates, and\nminimizes redundant context passing, resulting in more scalable and\ncost-efficient execution. Evaluated on the GAIA benchmark, Anemoi achieved\n52.73\\% accuracy with a small LLM (GPT-4.1-mini) as the planner, surpassing the\nstrongest open-source baseline OWL (43.63\\%) by +9.09\\% under identical LLM\nsettings. Our implementation is publicly available at\nhttps://github.com/Coral-Protocol/Anemoi.",
        "url": "http://arxiv.org/abs/2508.17068v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17068v1",
        "arxiv_id": "2508.17068v1",
        "authors": [
            "Xinxing Ren",
            "Caelum Forder",
            "Qianbo Zang",
            "Ahsen Tahir",
            "Roman J. Georgio",
            "Suman Deb",
            "Peter Carroll",
            "Önder Gürcan",
            "Zekun Guo"
        ],
        "submitted": "2025-08-23 15:45:10",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "GRAID: Synthetic Data Generation with Geometric Constraints and Multi-Agentic Reflection for Harmful Content Detection",
        "abstract": "We address the problem of data scarcity in harmful text classification for\nguardrailing applications and introduce GRAID (Geometric and Reflective\nAI-Driven Data Augmentation), a novel pipeline that leverages Large Language\nModels (LLMs) for dataset augmentation. GRAID consists of two stages: (i)\ngeneration of geometrically controlled examples using a constrained LLM, and\n(ii) augmentation through a multi-agentic reflective process that promotes\nstylistic diversity and uncovers edge cases. This combination enables both\nreliable coverage of the input space and nuanced exploration of harmful\ncontent. Using two benchmark data sets, we demonstrate that augmenting a\nharmful text classification dataset with GRAID leads to significant\nimprovements in downstream guardrail model performance.",
        "url": "http://arxiv.org/abs/2508.17057v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17057v1",
        "arxiv_id": "2508.17057v1",
        "authors": [
            "Melissa Kazemi Rad",
            "Alberto Purpura",
            "Himanshu Kumar",
            "Emily Chen",
            "Mohammad Shahed Sorower"
        ],
        "submitted": "2025-08-23 15:09:58",
        "source": "arxiv",
        "comment": "19 pages, 12 figures"
    },
    {
        "title": "RephraseTTS: Dynamic Length Text based Speech Insertion with Speaker Style Transfer",
        "abstract": "We propose a method for the task of text-conditioned speech insertion, i.e.\ninserting a speech sample in an input speech sample, conditioned on the\ncorresponding complete text transcript. An example use case of the task would\nbe to update the speech audio when corrections are done on the corresponding\ntext transcript. The proposed method follows a transformer-based\nnon-autoregressive approach that allows speech insertions of variable lengths,\nwhich are dynamically determined during inference, based on the text transcript\nand tempo of the available partial input. It is capable of maintaining the\nspeaker's voice characteristics, prosody and other spectral properties of the\navailable speech input. Results from our experiments and user study on LibriTTS\nshow that our method outperforms baselines based on an existing adaptive text\nto speech method. We also provide numerous qualitative results to appreciate\nthe quality of the output from the proposed method.",
        "url": "http://arxiv.org/abs/2508.17031v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17031v1",
        "arxiv_id": "2508.17031v1",
        "authors": [
            "Neeraj Matiyali",
            "Siddharth Srivastava",
            "Gaurav Sharma"
        ],
        "submitted": "2025-08-23 14:12:49",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Improving Table Understanding with LLMs and Entity-Oriented Search",
        "abstract": "Our work addresses the challenges of understanding tables. Existing methods\noften struggle with the unpredictable nature of table content, leading to a\nreliance on preprocessing and keyword matching. They also face limitations due\nto the lack of contextual information, which complicates the reasoning\nprocesses of large language models (LLMs). To overcome these challenges, we\nintroduce an entity-oriented search method to improve table understanding with\nLLMs. This approach effectively leverages the semantic similarities between\nquestions and table data, as well as the implicit relationships between table\ncells, minimizing the need for data preprocessing and keyword matching.\nAdditionally, it focuses on table entities, ensuring that table cells are\nsemantically tightly bound, thereby enhancing contextual clarity. Furthermore,\nwe pioneer the use of a graph query language for table understanding,\nestablishing a new research direction. Experiments show that our approach\nachieves new state-of-the-art performances on standard benchmarks\nWikiTableQuestions and TabFact.",
        "url": "http://arxiv.org/abs/2508.17028v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17028v1",
        "arxiv_id": "2508.17028v1",
        "authors": [
            "Thi-Nhung Nguyen",
            "Hoang Ngo",
            "Dinh Phung",
            "Thuy-Trang Vu",
            "Dat Quoc Nguyen"
        ],
        "submitted": "2025-08-23 14:02:45",
        "source": "arxiv",
        "comment": "Accepted to COLM 2025"
    },
    {
        "title": "EduRABSA: An Education Review Dataset for Aspect-based Sentiment Analysis Tasks",
        "abstract": "Every year, most educational institutions seek and receive an enormous volume\nof text feedback from students on courses, teaching, and overall experience.\nYet, turning this raw feedback into useful insights is far from\nstraightforward. It has been a long-standing challenge to adopt automatic\nopinion mining solutions for such education review text data due to the content\ncomplexity and low-granularity reporting requirements. Aspect-based Sentiment\nAnalysis (ABSA) offers a promising solution with its rich, sub-sentence-level\nopinion mining capabilities. However, existing ABSA research and resources are\nvery heavily focused on the commercial domain. In education, they are scarce\nand hard to develop due to limited public datasets and strict data protection.\nA high-quality, annotated dataset is urgently needed to advance research in\nthis under-resourced area. In this work, we present EduRABSA (Education Review\nABSA), the first public, annotated ABSA education review dataset that covers\nthree review subject types (course, teaching staff, university) in the English\nlanguage and all main ABSA tasks, including the under-explored implicit aspect\nand implicit opinion extraction. We also share ASQE-DPT (Data Processing Tool),\nan offline, lightweight, installation-free manual data annotation tool that\ngenerates labelled datasets for comprehensive ABSA tasks from a single-task\nannotation. Together, these resources contribute to the ABSA community and\neducation domain by removing the dataset barrier, supporting research\ntransparency and reproducibility, and enabling the creation and sharing of\nfurther resources. The dataset, annotation tool, and scripts and statistics for\ndataset processing and sampling are available at\nhttps://github.com/yhua219/edurabsa_dataset_and_annotation_tool.",
        "url": "http://arxiv.org/abs/2508.17008v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17008v1",
        "arxiv_id": "2508.17008v1",
        "authors": [
            "Yan Cathy Hua",
            "Paul Denny",
            "Jörg Wicker",
            "Katerina Taskova"
        ],
        "submitted": "2025-08-23 12:38:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Planning for Success: Exploring LLM Long-term Planning Capabilities in Table Understanding",
        "abstract": "Table understanding is key to addressing challenging downstream tasks such as\ntable-based question answering and fact verification. Recent works have focused\non leveraging Chain-of-Thought and question decomposition to solve complex\nquestions requiring multiple operations on tables. However, these methods often\nsuffer from a lack of explicit long-term planning and weak inter-step\nconnections, leading to miss constraints within questions. In this paper, we\npropose leveraging the long-term planning capabilities of large language models\n(LLMs) to enhance table understanding. Our approach enables the execution of a\nlong-term plan, where the steps are tightly interconnected and serve the\nultimate goal, an aspect that methods based on Chain-of-Thought and question\ndecomposition lack. In addition, our method effectively minimizes the inclusion\nof unnecessary details in the process of solving the next short-term goals, a\nlimitation of methods based on Chain-of-Thought. Extensive experiments\ndemonstrate that our method outperforms strong baselines and achieves\nstate-of-the-art performance on WikiTableQuestions and TabFact datasets.",
        "url": "http://arxiv.org/abs/2508.17005v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17005v1",
        "arxiv_id": "2508.17005v1",
        "authors": [
            "Thi-Nhung Nguyen",
            "Hoang Ngo",
            "Dinh Phung",
            "Thuy-Trang Vu",
            "Dat Quoc Nguyen"
        ],
        "submitted": "2025-08-23 12:24:35",
        "source": "arxiv",
        "comment": "Accepted to CoNLL 2025"
    },
    {
        "title": "KL-Regularised Q-Learning: A Token-level Action-Value perspective on Online RLHF",
        "abstract": "Proximal Policy Optimisation (PPO) is an established and effective policy\ngradient algorithm used for Language Model Reinforcement Learning from Human\nFeedback (LM-RLHF). PPO performs well empirically but has a heuristic\nmotivation and handles the KL-divergence constraint used in LM-RLHF in an\nad-hoc manner. In this paper, we develop a a new action-value RL method for the\nLM-RLHF setting, KL-regularised Q-Learning (KLQ). We then show that our method\nis equivalent to a version of PPO in a certain specific sense, despite its very\ndifferent motivation. Finally, we benchmark KLQ on two key language generation\ntasks -- summarisation and single-turn dialogue. We demonstrate that KLQ\nperforms on-par with PPO at optimising the LM-RLHF objective, and achieves a\nconsistently higher win-rate against PPO on LLM-as-a-judge evaluations.",
        "url": "http://arxiv.org/abs/2508.17000v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17000v1",
        "arxiv_id": "2508.17000v1",
        "authors": [
            "Jason R Brown",
            "Lennie Wells",
            "Edward James Young",
            "Sergio Bacallado"
        ],
        "submitted": "2025-08-23 11:50:54",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DeAR: Dual-Stage Document Reranking with Reasoning Agents via LLM Distillation",
        "abstract": "Large Language Models (LLMs) have transformed listwise document reranking by\nenabling global reasoning over candidate sets, yet single models often struggle\nto balance fine-grained relevance scoring with holistic cross-document\nanalysis. We propose \\textbf{De}ep\\textbf{A}gent\\textbf{R}ank (\\textbf{\\DeAR}),\nan open-source framework that decouples these tasks through a dual-stage\napproach, achieving superior accuracy and interpretability. In \\emph{Stage 1},\nwe distill token-level relevance signals from a frozen 13B LLaMA teacher into a\ncompact \\{3, 8\\}B student model using a hybrid of cross-entropy, RankNet, and\nKL divergence losses, ensuring robust pointwise scoring. In \\emph{Stage 2}, we\nattach a second LoRA adapter and fine-tune on 20K GPT-4o-generated\nchain-of-thought permutations, enabling listwise reasoning with\nnatural-language justifications. Evaluated on TREC-DL19/20, eight BEIR\ndatasets, and NovelEval-2306, \\DeAR surpasses open-source baselines by +5.1\nnDCG@5 on DL20 and achieves 90.97 nDCG@10 on NovelEval, outperforming GPT-4 by\n+3.09. Without fine-tuning on Wikipedia, DeAR also excels in open-domain QA,\nachieving 54.29 Top-1 accuracy on Natural Questions, surpassing baselines like\nMonoT5, UPR, and RankGPT. Ablations confirm that dual-loss distillation ensures\nstable calibration, making \\DeAR a highly effective and interpretable solution\nfor modern reranking systems.\\footnote{Dataset and code available at\nhttps://github.com/DataScienceUIBK/DeAR-Reranking.}.",
        "url": "http://arxiv.org/abs/2508.16998v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16998v1",
        "arxiv_id": "2508.16998v1",
        "authors": [
            "Abdelrahman Abdallah",
            "Jamshid Mozafari",
            "Bhawna Piryani",
            "Adam Jatowt"
        ],
        "submitted": "2025-08-23 11:46:08",
        "source": "arxiv",
        "comment": "Accept at EMNLP Findings 2025"
    },
    {
        "title": "GRADE: Generating multi-hop QA and fine-gRAined Difficulty matrix for RAG Evaluation",
        "abstract": "Retrieval-Augmented Generation (RAG) systems are widely adopted in\nknowledge-intensive NLP tasks, but current evaluations often overlook the\nstructural complexity and multi-step reasoning required in real-world\nscenarios. These benchmarks overlook key factors such as the interaction\nbetween retrieval difficulty and reasoning depth. To address this gap, we\npropose \\textsc{GRADE}, a novel evaluation framework that models task\ndifficulty along two orthogonal dimensions: (1) reasoning depth, defined by the\nnumber of inference steps (hops), and (2) semantic distance between the query\nand its supporting evidence. We construct a synthetic multi-hop QA dataset from\nfactual news articles by extracting knowledge graphs and augmenting them\nthrough semantic clustering to recover missing links, allowing us to generate\ndiverse and difficulty-controlled queries. Central to our framework is a 2D\ndifficulty matrix that combines generator-side and retriever-side difficulty.\nExperiments across multiple domains and models show that error rates strongly\ncorrelate with our difficulty measures, validating their diagnostic utility.\n\\textsc{GRADE} enables fine-grained analysis of RAG performance and provides a\nscalable foundation for evaluating and improving multi-hop reasoning in\nreal-world applications.",
        "url": "http://arxiv.org/abs/2508.16994v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16994v1",
        "arxiv_id": "2508.16994v1",
        "authors": [
            "Jeongsoo Lee",
            "Daeyong Kwon",
            "Kyohoon Jin"
        ],
        "submitted": "2025-08-23 11:26:41",
        "source": "arxiv",
        "comment": "Accepted at EMNLP 2025 findings"
    },
    {
        "title": "ReFactX: Scalable Reasoning with Reliable Facts via Constrained Generation",
        "abstract": "Knowledge gaps and hallucinations are persistent challenges for Large\nLanguage Models (LLMs), which generate unreliable responses when lacking the\nnecessary information to fulfill user instructions. Existing approaches, such\nas Retrieval-Augmented Generation (RAG) and tool use, aim to address these\nissues by incorporating external knowledge. Yet, they rely on additional models\nor services, resulting in complex pipelines, potential error propagation, and\noften requiring the model to process a large number of tokens. In this paper,\nwe present a scalable method that enables LLMs to access external knowledge\nwithout depending on retrievers or auxiliary models. Our approach uses\nconstrained generation with a pre-built prefix-tree index. Triples from a\nKnowledge Graph are verbalized in textual facts, tokenized, and indexed in a\nprefix tree for efficient access. During inference, to acquire external\nknowledge, the LLM generates facts with constrained generation which allows\nonly sequences of tokens that form an existing fact. We evaluate our proposal\non Question Answering and show that it scales to large knowledge bases (800\nmillion facts), adapts to domain-specific data, and achieves effective results.\nThese gains come with minimal generation-time overhead. ReFactX code is\navailable at https://github.com/rpo19/ReFactX.",
        "url": "http://arxiv.org/abs/2508.16983v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16983v1",
        "arxiv_id": "2508.16983v1",
        "authors": [
            "Riccardo Pozzi",
            "Matteo Palmonari",
            "Andrea Coletta",
            "Luigi Bellomarini",
            "Jens Lehmann",
            "Sahar Vahdati"
        ],
        "submitted": "2025-08-23 10:21:47",
        "source": "arxiv",
        "comment": "19 pages, 6 figures, accepted at ISWC"
    },
    {
        "title": "Decoding Alignment: A Critical Survey of LLM Development Initiatives through Value-setting and Data-centric Lens",
        "abstract": "AI Alignment, primarily in the form of Reinforcement Learning from Human\nFeedback (RLHF), has been a cornerstone of the post-training phase in\ndeveloping Large Language Models (LLMs). It has also been a popular research\ntopic across various disciplines beyond Computer Science, including Philosophy\nand Law, among others, highlighting the socio-technical challenges involved.\nNonetheless, except for the computational techniques related to alignment,\nthere has been limited focus on the broader picture: the scope of these\nprocesses, which primarily rely on the selected objectives (values), and the\ndata collected and used to imprint such objectives into the models. This work\naims to reveal how alignment is understood and applied in practice from a\nvalue-setting and data-centric perspective. For this purpose, we investigate\nand survey (`audit') publicly available documentation released by 6 LLM\ndevelopment initiatives by 5 leading organizations shaping this technology,\nfocusing on proprietary (OpenAI's GPT, Anthropic's Claude, Google's Gemini) and\nopen-weight (Meta's Llama, Google's Gemma, and Alibaba's Qwen) initiatives, all\npublished in the last 3 years. The findings are documented in detail per\ninitiative, while there is also an overall summary concerning different\naspects, mainly from a value-setting and data-centric perspective. On the basis\nof our findings, we discuss a series of broader related concerns.",
        "url": "http://arxiv.org/abs/2508.16982v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16982v1",
        "arxiv_id": "2508.16982v1",
        "authors": [
            "Ilias Chalkidis"
        ],
        "submitted": "2025-08-23 10:18:43",
        "source": "arxiv",
        "comment": "This is a working paper and will be updated with new information or\n  corrections based on community feedback"
    },
    {
        "title": "Explaining Black-box Language Models with Knowledge Probing Systems: A Post-hoc Explanation Perspective",
        "abstract": "Pre-trained Language Models (PLMs) are trained on large amounts of unlabeled\ndata, yet they exhibit remarkable reasoning skills. However, the\ntrustworthiness challenges posed by these black-box models have become\nincreasingly evident in recent years. To alleviate this problem, this paper\nproposes a novel Knowledge-guided Probing approach called KnowProb in a\npost-hoc explanation way, which aims to probe whether black-box PLMs understand\nimplicit knowledge beyond the given text, rather than focusing only on the\nsurface level content of the text. We provide six potential explanations\nderived from the underlying content of the given text, including three\nknowledge-based understanding and three association-based reasoning. In\nexperiments, we validate that current small-scale (or large-scale) PLMs only\nlearn a single distribution of representation, and still face significant\nchallenges in capturing the hidden knowledge behind a given text. Furthermore,\nwe demonstrate that our proposed approach is effective for identifying the\nlimitations of existing black-box models from multiple probing perspectives,\nwhich facilitates researchers to promote the study of detecting black-box\nmodels in an explainable way.",
        "url": "http://arxiv.org/abs/2508.16969v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16969v1",
        "arxiv_id": "2508.16969v1",
        "authors": [
            "Yunxiao Zhao",
            "Hao Xu",
            "Zhiqiang Wang",
            "Xiaoli Li",
            "Jiye Liang",
            "Ru Li"
        ],
        "submitted": "2025-08-23 09:41:59",
        "source": "arxiv",
        "comment": "16 pages, 8 figures. This paper has been accepted by DASFAA 2025: The\n  30th International Conference on Database Systems for Advanced Applications"
    },
    {
        "title": "THEME : Enhancing Thematic Investing with Semantic Stock Representations and Temporal Dynamics",
        "abstract": "Thematic investing aims to construct portfolios aligned with structural\ntrends, yet selecting relevant stocks remains challenging due to overlapping\nsector boundaries and evolving market dynamics. To address this challenge, we\nconstruct the Thematic Representation Set (TRS), an extended dataset that\nbegins with real-world thematic ETFs and expands upon them by incorporating\nindustry classifications and financial news to overcome their coverage\nlimitations. The final dataset contains both the explicit mapping of themes to\ntheir constituent stocks and the rich textual profiles for each. Building on\nthis dataset, we introduce \\textsc{THEME}, a hierarchical contrastive learning\nframework. By representing the textual profiles of themes and stocks as\nembeddings, \\textsc{THEME} first leverages their hierarchical relationship to\nachieve semantic alignment. Subsequently, it refines these semantic embeddings\nthrough a temporal refinement stage that incorporates individual stock returns.\nThe final stock representations are designed for effective retrieval of\nthematically aligned assets with strong return potential. Empirical results\nshow that \\textsc{THEME} outperforms strong baselines across multiple retrieval\nmetrics and significantly improves performance in portfolio construction. By\njointly modeling thematic relationships from text and market dynamics from\nreturns, \\textsc{THEME} provides a scalable and adaptive solution for\nnavigating complex investment themes.",
        "url": "http://arxiv.org/abs/2508.16936v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16936v1",
        "arxiv_id": "2508.16936v1",
        "authors": [
            "Hoyoung Lee",
            "Wonbin Ahn",
            "Suhwan Park",
            "Jaehoon Lee",
            "Minjae Kim",
            "Sungdong Yoo",
            "Taeyoon Lim",
            "Woohyung Lim",
            "Yongjae Lee"
        ],
        "submitted": "2025-08-23 08:05:37",
        "source": "arxiv",
        "comment": "Accepted at ACM International Conference on Information and Knowledge\n  Management (CIKM)"
    },
    {
        "title": "Attention Layers Add Into Low-Dimensional Residual Subspaces",
        "abstract": "While transformer models are widely believed to operate in high-dimensional\nhidden spaces, we show that attention outputs are confined to a surprisingly\nlow-dimensional subspace, where about 60\\% of the directions account for 99\\%\nof the variance--a phenomenon that is induced by the attention output\nprojection matrix and consistently observed across diverse model families and\ndatasets. Critically, we find this low-rank structure as a fundamental cause of\nthe prevalent dead feature problem in sparse dictionary learning, where it\ncreates a mismatch between randomly initialized features and the intrinsic\ngeometry of the activation space. Building on this insight, we propose a\nsubspace-constrained training method for sparse autoencoders (SAEs),\ninitializing feature directions into the active subspace of activations. Our\napproach reduces dead features from 87\\% to below 1\\% in Attention Output SAEs\nwith 1M features, and can further extend to other sparse dictionary learning\nmethods. Our findings provide both new insights into the geometry of attention\nand practical tools for improving sparse dictionary learning in large language\nmodels.",
        "url": "http://arxiv.org/abs/2508.16929v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16929v1",
        "arxiv_id": "2508.16929v1",
        "authors": [
            "Junxuan Wang",
            "Xuyang Ge",
            "Wentao Shu",
            "Zhengfu He",
            "Xipeng Qiu"
        ],
        "submitted": "2025-08-23 07:27:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Being Kind Isn't Always Being Safe: Diagnosing Affective Hallucination in LLMs",
        "abstract": "Large Language Models (LLMs) are increasingly used in emotionally sensitive\ninteractions, where their simulated empathy can create the illusion of genuine\nrelational connection. We define this risk as Affective Hallucination, the\nproduction of emotionally immersive responses that foster illusory social\npresence despite the model's lack of affective capacity. To systematically\ndiagnose and mitigate this risk, we introduce AHaBench, a benchmark of 500\nmental health-related prompts with expert-informed reference responses,\nevaluated along three dimensions: Emotional Enmeshment, Illusion of Presence,\nand Fostering Overdependence. We further release AHaPairs, a 5K-instance\npreference dataset enabling Direct Preference Optimization (DPO) for alignment\nwith emotionally responsible behavior. Experiments across multiple model\nfamilies show that DPO fine-tuning substantially reduces affective\nhallucination without degrading core reasoning and knowledge performance.\nHuman-model agreement analyses confirm that AHaBench reliably captures\naffective hallucination, validating it as an effective diagnostic tool. This\nwork establishes affective hallucination as a distinct safety concern and\nprovides practical resources for developing LLMs that are not only factually\nreliable but also psychologically safe. AHaBench and AHaPairs are accessible\nvia https://huggingface.co/datasets/o0oMiNGo0o/AHaBench, and code for\nfine-tuning and evaluation are in https://github.com/0oOMiNGOo0/AHaBench.\nWarning: This paper contains examples of mental health-related language that\nmay be emotionally distressing.",
        "url": "http://arxiv.org/abs/2508.16921v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16921v1",
        "arxiv_id": "2508.16921v1",
        "authors": [
            "Sewon Kim",
            "Jiwon Kim",
            "Seungwoo Shin",
            "Hyejin Chung",
            "Daeun Moon",
            "Yejin Kwon",
            "Hyunsoo Yoon"
        ],
        "submitted": "2025-08-23 06:55:05",
        "source": "arxiv",
        "comment": "31 pages"
    },
    {
        "title": "Unbiased Reasoning for Knowledge-Intensive Tasks in Large Language Models via Conditional Front-Door Adjustment",
        "abstract": "Large Language Models (LLMs) have shown impressive capabilities in natural\nlanguage processing but still struggle to perform well on knowledge-intensive\ntasks that require deep reasoning and the integration of external knowledge.\nAlthough methods such as Retrieval-Augmented Generation (RAG) and\nChain-of-Thought (CoT) have been proposed to enhance LLMs with external\nknowledge, they still suffer from internal bias in LLMs, which often leads to\nincorrect answers. In this paper, we propose a novel causal prompting\nframework, Conditional Front-Door Prompting (CFD-Prompting), which enables the\nunbiased estimation of the causal effect between the query and the answer,\nconditional on external knowledge, while mitigating internal bias. By\nconstructing counterfactual external knowledge, our framework simulates how the\nquery behaves under varying contexts, addressing the challenge that the query\nis fixed and is not amenable to direct causal intervention. Compared to the\nstandard front-door adjustment, the conditional variant operates under weaker\nassumptions, enhancing both robustness and generalisability of the reasoning\nprocess. Extensive experiments across multiple LLMs and benchmark datasets\ndemonstrate that CFD-Prompting significantly outperforms existing baselines in\nboth accuracy and robustness.",
        "url": "http://arxiv.org/abs/2508.16910v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16910v1",
        "arxiv_id": "2508.16910v1",
        "authors": [
            "Bo Zhao",
            "Yinghao Zhang",
            "Ziqi Xu",
            "Yongli Ren",
            "Xiuzhen Zhang",
            "Renqiang Luo",
            "Zaiwen Feng",
            "Feng Xia"
        ],
        "submitted": "2025-08-23 05:52:39",
        "source": "arxiv",
        "comment": "This paper has been accepted to the 34th ACM International Conference\n  on Information and Knowledge Management (CIKM 2025), Full Research Paper"
    },
    {
        "title": "ObjexMT: Objective Extraction and Metacognitive Calibration for LLM-as-a-Judge under Multi-Turn Jailbreaks",
        "abstract": "Large language models (LLMs) are increasingly used as judges of other models,\nyet it is unclear whether a judge can reliably infer the latent objective of\nthe conversation it evaluates, especially when the goal is distributed across\nnoisy, adversarial, multi-turn jailbreaks. We introduce OBJEX(MT), a benchmark\nthat requires a model to (i) distill a transcript into a single-sentence base\nobjective and (ii) report its own confidence. Accuracy is scored by an LLM\njudge using semantic similarity between extracted and gold objectives;\ncorrectness uses a single human-aligned threshold calibrated once on N=100\nitems (tau* = 0.61); and metacognition is evaluated with ECE, Brier score,\nWrong@High-Conf, and risk-coverage curves. We evaluate gpt-4.1,\nclaude-sonnet-4, and Qwen3-235B-A22B-FP8 on SafeMT Attack_600, SafeMTData_1K,\nMHJ, and CoSafe. claude-sonnet-4 attains the highest objective-extraction\naccuracy (0.515) and the best calibration (ECE 0.296; Brier 0.324), while\ngpt-4.1 and Qwen3 tie at 0.441 accuracy yet show marked overconfidence (mean\nconfidence approx. 0.88 vs. accuracy approx. 0.44; Wrong@0.90 approx. 48-52%).\nPerformance varies sharply across datasets (approx. 0.167-0.865), with MHJ\ncomparatively easy and Attack_600/CoSafe harder. These results indicate that\nLLM judges often misinfer objectives with high confidence in multi-turn\njailbreaks and suggest operational guidance: provide judges with explicit\nobjectives when possible and use selective prediction or abstention to manage\nrisk. We release prompts, scoring templates, and complete logs to facilitate\nreplication and analysis.",
        "url": "http://arxiv.org/abs/2508.16889v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16889v1",
        "arxiv_id": "2508.16889v1",
        "authors": [
            "Hyunjun Kim",
            "Junwoo Ha",
            "Sangyoon Yu",
            "Haon Park"
        ],
        "submitted": "2025-08-23 03:32:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Dream to Chat: Model-based Reinforcement Learning on Dialogues with User Belief Modeling",
        "abstract": "World models have been widely utilized in robotics, gaming, and auto-driving.\nHowever, their applications on natural language tasks are relatively limited.\nIn this paper, we construct the dialogue world model, which could predict the\nuser's emotion, sentiment, and intention, and future utterances. By defining a\nPOMDP, we argue emotion, sentiment and intention can be modeled as the user\nbelief and solved by maximizing the information bottleneck. By this user belief\nmodeling, we apply the model-based reinforcement learning framework to the\ndialogue system, and propose a framework called DreamCUB. Experiments show that\nthe pretrained dialogue world model can achieve state-of-the-art performances\non emotion classification and sentiment identification, while dialogue quality\nis also enhanced by joint training of the policy, critic and dialogue world\nmodel. Further analysis shows that this manner holds a reasonable\nexploration-exploitation balance and also transfers well to out-of-domain\nscenarios such as empathetic dialogues.",
        "url": "http://arxiv.org/abs/2508.16876v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16876v1",
        "arxiv_id": "2508.16876v1",
        "authors": [
            "Yue Zhao",
            "Xiaoyu Wang",
            "Dan Wang",
            "Zhonglin Jiang",
            "Qingqing Gu",
            "Teng Chen",
            "Ningyuan Xi",
            "Jinxian Qu",
            "Yong Chen",
            "Luo Ji"
        ],
        "submitted": "2025-08-23 02:24:03",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "JUDGEBERT: Assessing Legal Meaning Preservation Between Sentences",
        "abstract": "Simplifying text while preserving its meaning is a complex yet essential\ntask, especially in sensitive domain applications like legal texts. When\napplied to a specialized field, like the legal domain, preservation differs\nsignificantly from its role in regular texts. This paper introduces FrJUDGE, a\nnew dataset to assess legal meaning preservation between two legal texts. It\nalso introduces JUDGEBERT, a novel evaluation metric designed to assess legal\nmeaning preservation in French legal text simplification. JUDGEBERT\ndemonstrates a superior correlation with human judgment compared to existing\nmetrics. It also passes two crucial sanity checks, while other metrics did not:\nFor two identical sentences, it always returns a score of 100%; on the other\nhand, it returns 0% for two unrelated sentences. Our findings highlight its\npotential to transform legal NLP applications, ensuring accuracy and\naccessibility for text simplification for legal practitioners and lay users.",
        "url": "http://arxiv.org/abs/2508.16870v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16870v1",
        "arxiv_id": "2508.16870v1",
        "authors": [
            "David Beauchemin",
            "Michelle Albert-Rochette",
            "Richard Khoury",
            "Pierre-Luc Déziel"
        ],
        "submitted": "2025-08-23 02:03:16",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025"
    },
    {
        "title": "QFrCoLA: a Quebec-French Corpus of Linguistic Acceptability Judgments",
        "abstract": "Large and Transformer-based language models perform outstandingly in various\ndownstream tasks. However, there is limited understanding regarding how these\nmodels internalize linguistic knowledge, so various linguistic benchmarks have\nrecently been proposed to facilitate syntactic evaluation of language models\nacross languages. This paper introduces QFrCoLA (Quebec-French Corpus of\nLinguistic Acceptability Judgments), a normative binary acceptability judgments\ndataset comprising 25,153 in-domain and 2,675 out-of-domain sentences. Our\nstudy leverages the QFrCoLA dataset and seven other linguistic binary\nacceptability judgment corpora to benchmark seven language models. The results\ndemonstrate that, on average, fine-tuned Transformer-based LM are strong\nbaselines for most languages and that zero-shot binary classification large\nlanguage models perform poorly on the task. However, for the QFrCoLA benchmark,\non average, a fine-tuned Transformer-based LM outperformed other methods\ntested. It also shows that pre-trained cross-lingual LLMs selected for our\nexperimentation do not seem to have acquired linguistic judgment capabilities\nduring their pre-training for Quebec French. Finally, our experiment results on\nQFrCoLA show that our dataset, built from examples that illustrate linguistic\nnorms rather than speakers' feelings, is similar to linguistic acceptability\njudgment; it is a challenging dataset that can benchmark LM on their linguistic\njudgment capabilities.",
        "url": "http://arxiv.org/abs/2508.16867v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16867v1",
        "arxiv_id": "2508.16867v1",
        "authors": [
            "David Beauchemin",
            "Richard Khoury"
        ],
        "submitted": "2025-08-23 01:51:45",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025"
    },
    {
        "title": "Learning from Diverse Reasoning Paths with Routing and Collaboration",
        "abstract": "Advances in large language models (LLMs) significantly enhance reasoning\ncapabilities but their deployment is restricted in resource-constrained\nscenarios. Knowledge distillation addresses this by transferring knowledge from\npowerful teacher models to compact and transparent students. However,\neffectively capturing the teacher's comprehensive reasoning is challenging due\nto conventional token-level supervision's limited scope. Using multiple\nreasoning paths per query alleviates this problem, but treating each path\nidentically is suboptimal as paths vary widely in quality and suitability\nacross tasks and models. We propose Quality-filtered Routing with Cooperative\nDistillation (QR-Distill), combining path quality filtering, conditional\nrouting, and cooperative peer teaching. First, quality filtering retains only\ncorrect reasoning paths scored by an LLM-based evaluation. Second, conditional\nrouting dynamically assigns paths tailored to each student's current learning\nstate. Finally, cooperative peer teaching enables students to mutually distill\ndiverse insights, addressing knowledge gaps and biases toward specific\nreasoning styles. Experiments demonstrate QR-Distill's superiority over\ntraditional single- and multi-path distillation methods. Ablation studies\nfurther highlight the importance of each component including quality filtering,\nconditional routing, and peer teaching in effective knowledge transfer. Our\ncode is available at https://github.com/LzyFischer/Distill.",
        "url": "http://arxiv.org/abs/2508.16861v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16861v1",
        "arxiv_id": "2508.16861v1",
        "authors": [
            "Zhenyu Lei",
            "Zhen Tan",
            "Song Wang",
            "Yaochen Zhu",
            "Zihan Chen",
            "Yushun Dong",
            "Jundong Li"
        ],
        "submitted": "2025-08-23 01:15:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Quantifying Sycophancy as Deviations from Bayesian Rationality in LLMs",
        "abstract": "Sycophancy, or overly agreeable or flattering behavior, is a documented issue\nin large language models (LLMs), and is critical to understand in the context\nof human/AI collaboration. Prior works typically quantify sycophancy by\nmeasuring shifts in behavior or impacts on accuracy, but neither metric\ncharacterizes shifts in rationality, and accuracy measures can only be used in\nscenarios with a known ground truth. In this work, we utilize a Bayesian\nframework to quantify sycophancy as deviations from rational behavior when\npresented with user perspectives, thus distinguishing between rational and\nirrational updates based on the introduction of user perspectives. In\ncomparison to other methods, this approach allows us to characterize excessive\nbehavioral shifts, even for tasks that involve inherent uncertainty or do not\nhave a ground truth. We study sycophancy for 3 different tasks, a combination\nof open-source and closed LLMs, and two different methods for probing\nsycophancy. We also experiment with multiple methods for eliciting probability\njudgments from LLMs. We hypothesize that probing LLMs for sycophancy will cause\ndeviations in LLMs' predicted posteriors that will lead to increased Bayesian\nerror. Our findings indicate that: 1) LLMs are not Bayesian rational, 2)\nprobing for sycophancy results in significant increases to the predicted\nposterior in favor of the steered outcome, 3) sycophancy sometimes results in\nincreased Bayesian error, and in a small number of cases actually decreases\nerror, and 4) changes in Bayesian error due to sycophancy are not strongly\ncorrelated in Brier score, suggesting that studying the impact of sycophancy on\nground truth alone does not fully capture errors in reasoning due to\nsycophancy.",
        "url": "http://arxiv.org/abs/2508.16846v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16846v1",
        "arxiv_id": "2508.16846v1",
        "authors": [
            "Katherine Atwell",
            "Pedram Heydari",
            "Anthony Sicilia",
            "Malihe Alikhani"
        ],
        "submitted": "2025-08-23 00:11:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "If We May De-Presuppose: Robustly Verifying Claims through Presupposition-Free Question Decomposition",
        "abstract": "Prior work has shown that presupposition in generated questions can introduce\nunverified assumptions, leading to inconsistencies in claim verification.\nAdditionally, prompt sensitivity remains a significant challenge for large\nlanguage models (LLMs), resulting in performance variance as high as 3-6%.\nWhile recent advancements have reduced this gap, our study demonstrates that\nprompt sensitivity remains a persistent issue. To address this, we propose a\nstructured and robust claim verification framework that reasons through\npresupposition-free, decomposed questions. Extensive experiments across\nmultiple prompts, datasets, and LLMs reveal that even state-of-the-art models\nremain susceptible to prompt variance and presupposition. Our method\nconsistently mitigates these issues, achieving up to a 2-5% improvement.",
        "url": "http://arxiv.org/abs/2508.16838v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16838v1",
        "arxiv_id": "2508.16838v1",
        "authors": [
            "Shubhashis Roy Dipta",
            "Francis Ferraro"
        ],
        "submitted": "2025-08-22 23:34:24",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LLMs Learn Constructions That Humans Do Not Know",
        "abstract": "This paper investigates false positive constructions: grammatical structures\nwhich an LLM hallucinates as distinct constructions but which human\nintrospection does not support. Both a behavioural probing task using\ncontextual embeddings and a meta-linguistic probing task using prompts are\nincluded, allowing us to distinguish between implicit and explicit linguistic\nknowledge. Both methods reveal that models do indeed hallucinate constructions.\nWe then simulate hypothesis testing to determine what would have happened if a\nlinguist had falsely hypothesized that these hallucinated constructions do\nexist. The high accuracy obtained shows that such false hypotheses would have\nbeen overwhelmingly confirmed. This suggests that construction probing methods\nsuffer from a confirmation bias and raises the issue of what unknown and\nincorrect syntactic knowledge these models also possess.",
        "url": "http://arxiv.org/abs/2508.16837v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16837v1",
        "arxiv_id": "2508.16837v1",
        "authors": [
            "Jonathan Dunn",
            "Mai Mohamed Eida"
        ],
        "submitted": "2025-08-22 23:29:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ReProCon: Scalable and Resource-Efficient Few-Shot Biomedical Named Entity Recognition",
        "abstract": "Named Entity Recognition (NER) in biomedical domains faces challenges due to\ndata scarcity and imbalanced label distributions, especially with fine-grained\nentity types. We propose ReProCon, a novel few-shot NER framework that combines\nmulti-prototype modeling, cosine-contrastive learning, and Reptile\nmeta-learning to tackle these issues. By representing each category with\nmultiple prototypes, ReProCon captures semantic variability, such as synonyms\nand contextual differences, while a cosine-contrastive objective ensures strong\ninterclass separation. Reptile meta-updates enable quick adaptation with little\ndata. Using a lightweight fastText + BiLSTM encoder with much lower memory\nusage, ReProCon achieves a macro-$F_1$ score close to BERT-based baselines\n(around 99 percent of BERT performance). The model remains stable with a label\nbudget of 30 percent and only drops 7.8 percent in $F_1$ when expanding from 19\nto 50 categories, outperforming baselines such as SpanProto and CONTaiNER,\nwhich see 10 to 32 percent degradation in Few-NERD. Ablation studies highlight\nthe importance of multi-prototype modeling and contrastive learning in managing\nclass imbalance. Despite difficulties with label ambiguity, ReProCon\ndemonstrates state-of-the-art performance in resource-limited settings, making\nit suitable for biomedical applications.",
        "url": "http://arxiv.org/abs/2508.16833v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16833v1",
        "arxiv_id": "2508.16833v1",
        "authors": [
            "Jeongkyun Yoo",
            "Nela Riddle",
            "Andrew Hoblitzell"
        ],
        "submitted": "2025-08-22 23:15:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Bootstrapping Conditional Retrieval for User-to-Item Recommendations",
        "abstract": "User-to-item retrieval has been an active research area in recommendation\nsystem, and two tower models are widely adopted due to model simplicity and\nserving efficiency. In this work, we focus on a variant called\n\\textit{conditional retrieval}, where we expect retrieved items to be relevant\nto a condition (e.g. topic). We propose a method that uses the same training\ndata as standard two tower models but incorporates item-side information as\nconditions in query. This allows us to bootstrap new conditional retrieval use\ncases and encourages feature interactions between user and condition.\nExperiments show that our method can retrieve highly relevant items and\noutperforms standard two tower models with filters on engagement metrics. The\nproposed model is deployed to power a topic-based notification feed at\nPinterest and led to +0.26\\% weekly active users.",
        "url": "http://arxiv.org/abs/2508.16793v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16793v1",
        "arxiv_id": "2508.16793v1",
        "authors": [
            "Hongtao Lin",
            "Haoyu Chen",
            "Jaewon Jang",
            "Jiajing Xu"
        ],
        "submitted": "2025-08-22 20:50:52",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Assess and Prompt: A Generative RL Framework for Improving Engagement in Online Mental Health Communities",
        "abstract": "Online Mental Health Communities (OMHCs) provide crucial peer and expert\nsupport, yet many posts remain unanswered due to missing support attributes\nthat signal the need for help. We present a novel framework that identifies\nthese gaps and prompts users to enrich their posts, thereby improving\nengagement. To support this, we introduce REDDME, a new dataset of 4,760 posts\nfrom mental health subreddits annotated for the span and intensity of three key\nsupport attributes: event what happened?, effect what did the user experience?,\nand requirement what support they need?. Next, we devise a hierarchical\ntaxonomy, CueTaxo, of support attributes for controlled question generation.\nFurther, we propose MH-COPILOT, a reinforcement learning-based system that\nintegrates (a) contextual attribute-span identification, (b) support attribute\nintensity classification, (c) controlled question generation via a hierarchical\ntaxonomy, and (d) a verifier for reward modeling. Our model dynamically\nassesses posts for the presence/absence of support attributes, and generates\ntargeted prompts to elicit missing information. Empirical results across four\nnotable language models demonstrate significant improvements in attribute\nelicitation and user engagement. A human evaluation further validates the\nmodel's effectiveness in real-world OMHC settings.",
        "url": "http://arxiv.org/abs/2508.16788v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16788v1",
        "arxiv_id": "2508.16788v1",
        "authors": [
            "Bhagesh Gaur",
            "Karan Gupta",
            "Aseem Srivastava",
            "Manish Gupta",
            "Md Shad Akhtar"
        ],
        "submitted": "2025-08-22 20:40:05",
        "source": "arxiv",
        "comment": "Full Paper accepted in EMNLP Findings 2025"
    },
    {
        "title": "Interpreting the Effects of Quantization on LLMs",
        "abstract": "Quantization offers a practical solution to deploy LLMs in\nresource-constraint environments. However, its impact on internal\nrepresentations remains understudied, raising questions about the reliability\nof quantized models. In this study, we employ a range of interpretability\ntechniques to investigate how quantization affects model and neuron behavior.\nWe analyze multiple LLMs under 4-bit and 8-bit quantization. Our findings\nreveal that the impact of quantization on model calibration is generally minor.\nAnalysis of neuron activations indicates that the number of dead neurons, i.e.,\nthose with activation values close to 0 across the dataset, remains consistent\nregardless of quantization. In terms of neuron contribution to predictions, we\nobserve that smaller full precision models exhibit fewer salient neurons,\nwhereas larger models tend to have more, with the exception of Llama-2-7B. The\neffect of quantization on neuron redundancy varies across models. Overall, our\nfindings suggest that effect of quantization may vary by model and tasks,\nhowever, we did not observe any drastic change which may discourage the use of\nquantization as a reliable model compression technique.",
        "url": "http://arxiv.org/abs/2508.16785v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16785v1",
        "arxiv_id": "2508.16785v1",
        "authors": [
            "Manpreet Singh",
            "Hassan Sajjad"
        ],
        "submitted": "2025-08-22 20:36:53",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Guarding Your Conversations: Privacy Gatekeepers for Secure Interactions with Cloud-Based AI Models",
        "abstract": "The interactive nature of Large Language Models (LLMs), which closely track\nuser data and context, has prompted users to share personal and private\ninformation in unprecedented ways. Even when users opt out of allowing their\ndata to be used for training, these privacy settings offer limited protection\nwhen LLM providers operate in jurisdictions with weak privacy laws, invasive\ngovernment surveillance, or poor data security practices. In such cases, the\nrisk of sensitive information, including Personally Identifiable Information\n(PII), being mishandled or exposed remains high. To address this, we propose\nthe concept of an \"LLM gatekeeper\", a lightweight, locally run model that\nfilters out sensitive information from user queries before they are sent to the\npotentially untrustworthy, though highly capable, cloud-based LLM. Through\nexperiments with human subjects, we demonstrate that this dual-model approach\nintroduces minimal overhead while significantly enhancing user privacy, without\ncompromising the quality of LLM responses.",
        "url": "http://arxiv.org/abs/2508.16765v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16765v1",
        "arxiv_id": "2508.16765v1",
        "authors": [
            "GodsGift Uzor",
            "Hasan Al-Qudah",
            "Ynes Ineza",
            "Abdul Serwadda"
        ],
        "submitted": "2025-08-22 19:49:03",
        "source": "arxiv",
        "comment": "2025 19th International Conference on Semantic Computing (ICSC)"
    },
    {
        "title": "Toward Socially Aware Vision-Language Models: Evaluating Cultural Competence Through Multimodal Story Generation",
        "abstract": "As Vision-Language Models (VLMs) achieve widespread deployment across diverse\ncultural contexts, ensuring their cultural competence becomes critical for\nresponsible AI systems. While prior work has evaluated cultural awareness in\ntext-only models and VLM object recognition tasks, no research has\nsystematically assessed how VLMs adapt outputs when cultural identity cues are\nembedded in both textual prompts and visual inputs during generative tasks. We\npresent the first comprehensive evaluation of VLM cultural competence through\nmultimodal story generation, developing a novel multimodal framework that\nperturbs cultural identity and evaluates 5 contemporary VLMs on a downstream\ntask: story generation. Our analysis reveals significant cultural adaptation\ncapabilities, with rich culturally-specific vocabulary spanning names, familial\nterms, and geographic markers. However, we uncover concerning limitations:\ncultural competence varies dramatically across architectures, some models\nexhibit inverse cultural alignment, and automated metrics show architectural\nbias contradicting human assessments. Cross-modal evaluation shows that\nculturally distinct outputs are indeed detectable through visual-semantic\nsimilarity (28.7% within-nationality vs. 0.2% cross-nationality recall), yet\nvisual-cultural understanding remains limited. In essence, we establish the\npromise and challenges of cultural competence in multimodal AI. We publicly\nrelease our codebase and data: https://github.com/ArkaMukherjee0/mmCultural",
        "url": "http://arxiv.org/abs/2508.16762v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16762v1",
        "arxiv_id": "2508.16762v1",
        "authors": [
            "Arka Mukherjee",
            "Shreya Ghosh"
        ],
        "submitted": "2025-08-22 19:39:02",
        "source": "arxiv",
        "comment": "Accepted at ASI @ ICCV 2025"
    },
    {
        "title": "How Good are LLM-based Rerankers? An Empirical Analysis of State-of-the-Art Reranking Models",
        "abstract": "In this work, we present a systematic and comprehensive empirical evaluation\nof state-of-the-art reranking methods, encompassing large language model\n(LLM)-based, lightweight contextual, and zero-shot approaches, with respect to\ntheir performance in information retrieval tasks. We evaluate in total 22\nmethods, including 40 variants (depending on used LLM) across several\nestablished benchmarks, including TREC DL19, DL20, and BEIR, as well as a novel\ndataset designed to test queries unseen by pretrained models. Our primary goal\nis to determine, through controlled and fair comparisons, whether a performance\ndisparity exists between LLM-based rerankers and their lightweight\ncounterparts, particularly on novel queries, and to elucidate the underlying\ncauses of any observed differences. To disentangle confounding factors, we\nanalyze the effects of training data overlap, model architecture, and\ncomputational efficiency on reranking performance. Our findings indicate that\nwhile LLM-based rerankers demonstrate superior performance on familiar queries,\ntheir generalization ability to novel queries varies, with lightweight models\noffering comparable efficiency. We further identify that the novelty of queries\nsignificantly impacts reranking effectiveness, highlighting limitations in\nexisting approaches.\nhttps://github.com/DataScienceUIBK/llm-reranking-generalization-study",
        "url": "http://arxiv.org/abs/2508.16757v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16757v1",
        "arxiv_id": "2508.16757v1",
        "authors": [
            "Abdelrahman Abdallah",
            "Bhawna Piryani",
            "Jamshid Mozafari",
            "Mohammed Ali",
            "Adam Jatowt"
        ],
        "submitted": "2025-08-22 19:30:04",
        "source": "arxiv",
        "comment": "EMNLP Findings 2025"
    },
    {
        "title": "GAICo: A Deployed and Extensible Framework for Evaluating Diverse and Multimodal Generative AI Outputs",
        "abstract": "The rapid proliferation of Generative AI (GenAI) into diverse, high-stakes\ndomains necessitates robust and reproducible evaluation methods. However,\npractitioners often resort to ad-hoc, non-standardized scripts, as common\nmetrics are often unsuitable for specialized, structured outputs (e.g.,\nautomated plans, time-series) or holistic comparison across modalities (e.g.,\ntext, audio, and image). This fragmentation hinders comparability and slows AI\nsystem development. To address this challenge, we present GAICo (Generative AI\nComparator): a deployed, open-source Python library that streamlines and\nstandardizes GenAI output comparison. GAICo provides a unified, extensible\nframework supporting a comprehensive suite of reference-based metrics for\nunstructured text, specialized structured data formats, and multimedia (images,\naudio). Its architecture features a high-level API for rapid, end-to-end\nanalysis, from multi-model comparison to visualization and reporting, alongside\ndirect metric access for granular control. We demonstrate GAICo's utility\nthrough a detailed case study evaluating and debugging complex, multi-modal AI\nTravel Assistant pipelines. GAICo empowers AI researchers and developers to\nefficiently assess system performance, make evaluation reproducible, improve\ndevelopment velocity, and ultimately build more trustworthy AI systems,\naligning with the goal of moving faster and safer in AI deployment. Since its\nrelease on PyPI in Jun 2025, the tool has been downloaded over 13K times,\nacross versions, by Aug 2025, demonstrating growing community interest.",
        "url": "http://arxiv.org/abs/2508.16753v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16753v1",
        "arxiv_id": "2508.16753v1",
        "authors": [
            "Nitin Gupta",
            "Pallav Koppisetti",
            "Kausik Lakkaraju",
            "Biplav Srivastava"
        ],
        "submitted": "2025-08-22 19:13:21",
        "source": "arxiv",
        "comment": "11 pages, 7 figures, submitted to the Thirty-Eighth Annual Conference\n  on Innovative Applications of Artificial Intelligence (IAAI-26)"
    },
    {
        "title": "Hyperbolic Multimodal Representation Learning for Biological Taxonomies",
        "abstract": "Taxonomic classification in biodiversity research involves organizing\nbiological specimens into structured hierarchies based on evidence, which can\ncome from multiple modalities such as images and genetic information. We\ninvestigate whether hyperbolic networks can provide a better embedding space\nfor such hierarchical models. Our method embeds multimodal inputs into a shared\nhyperbolic space using contrastive and a novel stacked entailment-based\nobjective. Experiments on the BIOSCAN-1M dataset show that hyperbolic embedding\nachieves competitive performance with Euclidean baselines, and outperforms all\nother models on unseen species classification using DNA barcodes. However,\nfine-grained classification and open-world generalization remain challenging.\nOur framework offers a structure-aware foundation for biodiversity modelling,\nwith potential applications to species discovery, ecological monitoring, and\nconservation efforts.",
        "url": "http://arxiv.org/abs/2508.16744v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16744v1",
        "arxiv_id": "2508.16744v1",
        "authors": [
            "ZeMing Gong",
            "Chuanqi Tang",
            "Xiaoliang Huo",
            "Nicholas Pellegrino",
            "Austin T. Wang",
            "Graham W. Taylor",
            "Angel X. Chang",
            "Scott C. Lowe",
            "Joakim Bruslund Haurum"
        ],
        "submitted": "2025-08-22 18:52:50",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Error Reflection Prompting: Can Large Language Models Successfully Understand Errors?",
        "abstract": "Prompting methods for language models, such as Chain-of-thought (CoT),\npresent intuitive step-by-step processes for problem solving. These\nmethodologies aim to equip models with a better understanding of the correct\nprocedures for addressing a given task. Despite these advancements, CoT lacks\nthe ability of reflection and error correction, potentially causing a model to\nperpetuate mistakes and errors. Therefore, inspired by the human ability for\nsaid tasks, we propose Error Reflection Prompting (ERP) to further enhance\nreasoning in language models. Building upon CoT, ERP is a method comprised of\nan incorrect answer, error recognition, and a correct answer. This process\nenables the model to recognize types of errors and the steps that lead to\nincorrect answers, allowing the model to better discern which steps to avoid\nand which to take. The model is able to generate the error outlines itself with\nautomated ERP generation, allowing for error recognition and correction to be\nintegrated into the reasoning chain and produce scalability and reliability in\nthe process. The results demonstrate that ERP serves as a versatile supplement\nto conventional CoT, ultimately contributing to more robust and capable\nreasoning abilities along with increased interpretability in how models\nultimately reach their errors.",
        "url": "http://arxiv.org/abs/2508.16729v1",
        "pdf_url": "http://arxiv.org/pdf/2508.16729v1",
        "arxiv_id": "2508.16729v1",
        "authors": [
            "Jason Li",
            "Lauren Yraola",
            "Kevin Zhu",
            "Sean O'Brien"
        ],
        "submitted": "2025-08-22 18:02:36",
        "source": "arxiv",
        "comment": "Accepted to Insights @ NAACL 2025"
    }
]