[
    {
        "title": "Paired by the Teacher: Turning Unpaired Data into High-Fidelity Pairs for Low-Resource Text Generation",
        "abstract": "We present Paired by the Teacher (PbT), a two-stage teacher-student pipeline\nthat synthesizes accurate input-output pairs without human labels or parallel\ndata. In many low-resource natural language generation (NLG) scenarios,\npractitioners may have only raw outputs, like highlights, recaps, or questions,\nor only raw inputs, such as articles, dialogues, or paragraphs, but seldom\nboth. This mismatch forces small models to learn from very few examples or rely\non costly, broad-scope synthetic examples produced by large LLMs. PbT addresses\nthis by asking a teacher LLM to compress each unpaired example into a concise\nintermediate representation (IR), and training a student to reconstruct inputs\nfrom IRs. This enables outputs to be paired with student-generated inputs,\nyielding high-quality synthetic data. We evaluate PbT on five\nbenchmarks-document summarization (XSum, CNNDM), dialogue summarization\n(SAMSum, DialogSum), and question generation (SQuAD)-as well as an unpaired\nsetting on SwitchBoard (paired with DialogSum summaries). An 8B student trained\nonly on PbT data outperforms models trained on 70 B teacher-generated corpora\nand other unsupervised baselines, coming within 1.2 ROUGE-L of human-annotated\npairs and closing 82% of the oracle gap at one-third the annotation cost of\ndirect synthesis. Human evaluation on SwitchBoard further confirms that only\nPbT produces concise, faithful summaries aligned with the target style,\nhighlighting its advantage of generating in-domain sources that avoid the\nmismatch, limiting direct synthesis.",
        "url": "http://arxiv.org/abs/2509.25144v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25144v1",
        "arxiv_id": "2509.25144v1",
        "authors": [
            "Yen-Ju Lu",
            "Thomas Thebaud",
            "Laureano Moro-Velazquez",
            "Najim Dehak",
            "Jesus Villalba"
        ],
        "submitted": "2025-09-29 17:51:55",
        "source": "arxiv",
        "comment": "Accepted at EMNLP 2025 (Main Conference)"
    },
    {
        "title": "TemMed-Bench: Evaluating Temporal Medical Image Reasoning in Vision-Language Models",
        "abstract": "Existing medical reasoning benchmarks for vision-language models primarily\nfocus on analyzing a patient's condition based on an image from a single visit.\nHowever, this setting deviates significantly from real-world clinical practice,\nwhere doctors typically refer to a patient's historical conditions to provide a\ncomprehensive assessment by tracking their changes over time. In this paper, we\nintroduce TemMed-Bench, the first benchmark designed for analyzing changes in\npatients' conditions between different clinical visits, which challenges large\nvision-language models (LVLMs) to reason over temporal medical images.\nTemMed-Bench consists of a test set comprising three tasks - visual\nquestion-answering (VQA), report generation, and image-pair selection - and a\nsupplementary knowledge corpus of over 17,000 instances. With TemMed-Bench, we\nconduct an evaluation of six proprietary and six open-source LVLMs. Our results\nshow that most LVLMs lack the ability to analyze patients' condition changes\nover temporal medical images, and a large proportion perform only at a\nrandom-guessing level in the closed-book setting. In contrast, GPT o3, o4-mini\nand Claude 3.5 Sonnet demonstrate comparatively decent performance, though they\nhave yet to reach the desired level. Furthermore, we explore augmenting the\ninput with both retrieved visual and textual modalities in the medical domain.\nWe also show that multi-modal retrieval augmentation yields notably higher\nperformance gains than no retrieval and textual retrieval alone across most\nmodels on our benchmark, with the VQA task showing an average improvement of\n2.59%. Overall, we compose a benchmark grounded on real-world clinical\npractice, and it reveals LVLMs' limitations in temporal medical image\nreasoning, as well as highlighting the use of multi-modal retrieval\naugmentation as a potentially promising direction worth exploring to address\nthis challenge.",
        "url": "http://arxiv.org/abs/2509.25143v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25143v1",
        "arxiv_id": "2509.25143v1",
        "authors": [
            "Junyi Zhang",
            "Jia-Chen Gu",
            "Wenbo Hu",
            "Yu Zhou",
            "Robinson Piramuthu",
            "Nanyun Peng"
        ],
        "submitted": "2025-09-29 17:51:26",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ReasoningBank: Scaling Agent Self-Evolving with Reasoning Memory",
        "abstract": "With the growing adoption of large language model agents in persistent\nreal-world roles, they naturally encounter continuous streams of tasks. A key\nlimitation, however, is their failure to learn from the accumulated interaction\nhistory, forcing them to discard valuable insights and repeat past errors. We\npropose ReasoningBank, a novel memory framework that distills generalizable\nreasoning strategies from an agent's self-judged successful and failed\nexperiences. At test time, an agent retrieves relevant memories from\nReasoningBank to inform its interaction and then integrates new learnings back,\nenabling it to become more capable over time. Building on this powerful\nexperience learner, we further introduce memory-aware test-time scaling\n(MaTTS), which accelerates and diversifies this learning process by scaling up\nthe agent's interaction experience. By allocating more compute to each task,\nthe agent generates abundant, diverse experiences that provide rich contrastive\nsignals for synthesizing higher-quality memory. The better memory in turn\nguides more effective scaling, establishing a powerful synergy between memory\nand test-time scaling. Across web browsing and software engineering benchmarks,\nReasoningBank consistently outperforms existing memory mechanisms that store\nraw trajectories or only successful task routines, improving both effectiveness\nand efficiency; MaTTS further amplifies these gains. These findings establish\nmemory-driven experience scaling as a new scaling dimension, enabling agents to\nself-evolve with emergent behaviors naturally arise.",
        "url": "http://arxiv.org/abs/2509.25140v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25140v1",
        "arxiv_id": "2509.25140v1",
        "authors": [
            "Siru Ouyang",
            "Jun Yan",
            "I-Hung Hsu",
            "Yanfei Chen",
            "Ke Jiang",
            "Zifeng Wang",
            "Rujun Han",
            "Long T. Le",
            "Samira Daruki",
            "Xiangru Tang",
            "Vishy Tirumalashetty",
            "George Lee",
            "Mahsan Rofouei",
            "Hangfei Lin",
            "Jiawei Han",
            "Chen-Yu Lee",
            "Tomas Pfister"
        ],
        "submitted": "2025-09-29 17:51:03",
        "source": "arxiv",
        "comment": "11 pages, 7 figures, 4 tables"
    },
    {
        "title": "Investigating Language and Retrieval Bias in Multilingual Previously Fact-Checked Claim Detection",
        "abstract": "Multilingual Large Language Models (LLMs) offer powerful capabilities for\ncross-lingual fact-checking. However, these models often exhibit language bias,\nperforming disproportionately better on high-resource languages such as English\nthan on low-resource counterparts. We also present and inspect a novel concept\n- retrieval bias, when information retrieval systems tend to favor certain\ninformation over others, leaving the retrieval process skewed. In this paper,\nwe study language and retrieval bias in the context of Previously Fact-Checked\nClaim Detection (PFCD). We evaluate six open-source multilingual LLMs across 20\nlanguages using a fully multilingual prompting strategy, leveraging the AMC-16K\ndataset. By translating task prompts into each language, we uncover disparities\nin monolingual and cross-lingual performance and identify key trends based on\nmodel family, size, and prompting strategy. Our findings highlight persistent\nbias in LLM behavior and offer recommendations for improving equity in\nmultilingual fact-checking. To investigate retrieval bias, we employed\nmultilingual embedding models and look into the frequency of retrieved claims.\nOur analysis reveals that certain claims are retrieved disproportionately\nacross different posts, leading to inflated retrieval performance for popular\nclaims while under-representing less common ones.",
        "url": "http://arxiv.org/abs/2509.25138v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25138v1",
        "arxiv_id": "2509.25138v1",
        "authors": [
            "Ivan Vykopal",
            "Antonia Karamolegkou",
            "Jaroslav Kopčan",
            "Qiwei Peng",
            "Tomáš Javůrek",
            "Michal Gregor",
            "Marián Šimko"
        ],
        "submitted": "2025-09-29 17:50:32",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The Era of Real-World Human Interaction: RL from User Conversations",
        "abstract": "We posit that to achieve continual model improvement and multifaceted\nalignment, future models must learn from natural human interaction. Current\nconversational models are aligned using pre-annotated, expert-generated human\nfeedback. In this work, we introduce Reinforcement Learning from Human\nInteraction (RLHI), a paradigm that learns directly from in-the-wild user\nconversations. We develop two complementary methods: (1) RLHI with User-Guided\nRewrites, which revises unsatisfactory model outputs based on users'\nnatural-language follow-up responses, (2) RLHI with User-Based Rewards, which\nlearns via a reward model conditioned on knowledge of the user's long-term\ninteraction history (termed persona). Together, these methods link long-term\nuser personas to turn-level preferences via persona-conditioned preference\noptimization. Trained on conversations derived from WildChat, both RLHI\nvariants outperform strong baselines in personalization and\ninstruction-following, and similar feedback enhances performance on reasoning\nbenchmarks. These results suggest organic human interaction offers scalable,\neffective supervision for personalized alignment.",
        "url": "http://arxiv.org/abs/2509.25137v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25137v1",
        "arxiv_id": "2509.25137v1",
        "authors": [
            "Chuanyang Jin",
            "Jing Xu",
            "Bo Liu",
            "Leitian Tao",
            "Olga Golovneva",
            "Tianmin Shu",
            "Wenting Zhao",
            "Xian Li",
            "Jason Weston"
        ],
        "submitted": "2025-09-29 17:50:31",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Rethinking Entropy Regularization in Large Reasoning Models",
        "abstract": "Reinforcement learning with verifiable rewards (RLVR) has shown great promise\nin enhancing the reasoning abilities of large reasoning models (LRMs). However,\nit suffers from a critical issue: entropy collapse and premature convergence.\nNaive entropy regularization, a common approach for encouraging exploration in\nthe traditional RL literature, fails to address this problem in the context of\nLRM. Our analysis reveals that this failure stems from the vast action space\nand long trajectories in LRMs, which easily trigger a global entropy explosion\nas the model indiscriminately explores all possible actions and states. To\naddress this, we propose SIREN (SelectIve entRopy rEgularizatioN), a method\nthat confines exploration to a meaningful subset of actions and states. SIREN\nachieves this through a two-step entropy masking mechanism, consisting of a\ntop-p mask and a peak-entropy mask. In addition, regularization is transformed\ninto a self-anchored form to stabilize training. Across five mathematical\nbenchmarks, SIREN attains superior average performance over previous\nentropy-related RLVR approaches, exemplified by a +6.6 maj@k improvement on\nAIME24/25 with Qwen2.5-Math-7B. Further analysis confirms that SIREN promotes\ngreater response diversity and maintains entropy at an appropriate level, which\nhelps to preserve the validation pass@k throughout training. This effectively\nmitigates the premature convergence problem common in RLVR for LRM.",
        "url": "http://arxiv.org/abs/2509.25133v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25133v1",
        "arxiv_id": "2509.25133v1",
        "authors": [
            "Yuxian Jiang",
            "Yafu Li",
            "Guanxu Chen",
            "Dongrui Liu",
            "Yu Cheng",
            "Jing Shao"
        ],
        "submitted": "2025-09-29 17:49:25",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MGM-Omni: Scaling Omni LLMs to Personalized Long-Horizon Speech",
        "abstract": "We present MGM-Omni, a unified Omni LLM for omni-modal understanding and\nexpressive, long-horizon speech generation. Unlike cascaded pipelines that\nisolate speech synthesis, MGM-Omni adopts a \"brain-mouth\" design with a\ndual-track, token-based architecture that cleanly decouples multimodal\nreasoning from real-time speech generation. This design enables efficient\ncross-modal interaction and low-latency, streaming speech generation. For\nunderstanding, a unified training strategy coupled with a dual audio encoder\ndesign enables long-form audio perception across diverse acoustic conditions.\nFor generation, a chunk-based parallel decoding scheme narrows the text speech\ntoken-rate gap, accelerating inference and supporting streaming zero-shot voice\ncloning with stable timbre over extended durations. Compared to concurrent\nwork, MGM-Omni achieves these capabilities with markedly data-efficient\ntraining. Extensive experiments demonstrate that MGM-Omni outperforms existing\nopen source models in preserving timbre identity across extended sequences,\nproducing natural and context-aware speech, and achieving superior long-form\naudio and omnimodal understanding. MGM-Omni establishes an efficient,\nend-to-end paradigm for omnimodal understanding and controllable, personalised\nlong-horizon speech generation.",
        "url": "http://arxiv.org/abs/2509.25131v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25131v1",
        "arxiv_id": "2509.25131v1",
        "authors": [
            "Chengyao Wang",
            "Zhisheng Zhong",
            "Bohao Peng",
            "Senqiao Yang",
            "Yuqi Liu",
            "Haokun Gui",
            "Bin Xia",
            "Jingyao Li",
            "Bei Yu",
            "Jiaya Jia"
        ],
        "submitted": "2025-09-29 17:48:28",
        "source": "arxiv",
        "comment": "Code is available at https://github.com/dvlab-research/MGM-Omni"
    },
    {
        "title": "From $f(x)$ and $g(x)$ to $f(g(x))$: LLMs Learn New Skills in RL by Composing Old Ones",
        "abstract": "Does RL teach LLMs genuinely new skills, or does it merely activate existing\nones? This question lies at the core of ongoing debates about the role of RL in\nLLM post-training. On one side, strong empirical results can be achieved with\nRL even without preceding supervised finetuning; on the other, critics argue\nthat RL contributes little beyond reweighting existing reasoning strategies.\nThis work provides concrete evidence that LLMs can acquire genuinely new skills\nduring RL by composing existing ones, mirroring one of the central mechanisms\nby which humans acquire new cognitive skills. To mitigate data contamination\nand other confounding factors, and to allow precise control over task\ncomplexity, we develop a synthetic framework for our investigation.\nSpecifically, we define a skill as the ability to infer the output of a string\ntransformation function f(x) given x. When an LLM has already learned f and g\nprior to RL, our experiments reveal that RL enables it to learn unseen\ncompositions of them h(x)=g(f(x)). Further, this compositional ability\ngeneralizes to more difficult problems such as compositions of >2 functions\nunseen during RL training. Surprisingly, our experiments show that\ncompositional skill acquired on a source task transfers to a different target\ntask. This transfer happens even without compositional training on the target,\nrequiring only prior knowledge of the target's atomic skills. Our qualitative\nanalysis shows that RL fundamentally changes the reasoning behaviors of the\nmodels. In contrast, next-token training with the same data yields none of\nthese findings. Our systematic experiments provide fresh insights into LLM\nlearning, suggesting the value of first building base models with basic skills,\nthen using RL to incentivize advanced, generalizable skills for complex\nproblems.",
        "url": "http://arxiv.org/abs/2509.25123v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25123v1",
        "arxiv_id": "2509.25123v1",
        "authors": [
            "Lifan Yuan",
            "Weize Chen",
            "Yuchen Zhang",
            "Ganqu Cui",
            "Hanbin Wang",
            "Ziming You",
            "Ning Ding",
            "Zhiyuan Liu",
            "Maosong Sun",
            "Hao Peng"
        ],
        "submitted": "2025-09-29 17:44:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Knowledge Extraction on Semi-Structured Content: Does It Remain Relevant for Question Answering in the Era of LLMs?",
        "abstract": "The advent of Large Language Models (LLMs) has significantly advanced\nweb-based Question Answering (QA) systems over semi-structured content, raising\nquestions about the continued utility of knowledge extraction for question\nanswering. This paper investigates the value of triple extraction in this new\nparadigm by extending an existing benchmark with knowledge extraction\nannotations and evaluating commercial and open-source LLMs of varying sizes.\nOur results show that web-scale knowledge extraction remains a challenging task\nfor LLMs. Despite achieving high QA accuracy, LLMs can still benefit from\nknowledge extraction, through augmentation with extracted triples and\nmulti-task learning. These findings provide insights into the evolving role of\nknowledge triple extraction in web-based QA and highlight strategies for\nmaximizing LLM effectiveness across different model sizes and resource\nsettings.",
        "url": "http://arxiv.org/abs/2509.25107v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25107v1",
        "arxiv_id": "2509.25107v1",
        "authors": [
            "Kai Sun",
            "Yin Huang",
            "Srishti Mehra",
            "Mohammad Kachuee",
            "Xilun Chen",
            "Renjie Tao",
            "Zhaojiang Lin",
            "Andrea Jessee",
            "Nirav Shah",
            "Alex Betty",
            "Yue Liu",
            "Anuj Kumar",
            "Wen-tau Yih",
            "Xin Luna Dong"
        ],
        "submitted": "2025-09-29 17:39:19",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Towards Personalized Deep Research: Benchmarks and Evaluations",
        "abstract": "Deep Research Agents (DRAs) can autonomously conduct complex investigations\nand generate comprehensive reports, demonstrating strong real-world potential.\nHowever, existing evaluations mostly rely on close-ended benchmarks, while\nopen-ended deep research benchmarks remain scarce and typically neglect\npersonalized scenarios. To bridge this gap, we introduce Personalized Deep\nResearch Bench, the first benchmark for evaluating personalization in DRAs. It\npairs 50 diverse research tasks across 10 domains with 25 authentic user\nprofiles that combine structured persona attributes with dynamic real-world\ncontexts, yielding 250 realistic user-task queries. To assess system\nperformance, we propose the PQR Evaluation Framework, which jointly measures\n(P) Personalization Alignment, (Q) Content Quality, and (R) Factual\nReliability. Our experiments on a range of systems highlight current\ncapabilities and limitations in handling personalized deep research. This work\nestablishes a rigorous foundation for developing and evaluating the next\ngeneration of truly personalized AI research assistants.",
        "url": "http://arxiv.org/abs/2509.25106v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25106v1",
        "arxiv_id": "2509.25106v1",
        "authors": [
            "Yuan Liang",
            "Jiaxian Li",
            "Yuqing Wang",
            "Piaohong Wang",
            "Motong Tian",
            "Pai Liu",
            "Shuofei Qiao",
            "Runnan Fang",
            "He Zhu",
            "Ge Zhang",
            "Minghao Liu",
            "Yuchen Eleanor Jiang",
            "Ningyu Zhang",
            "Wangchunshu Zhou"
        ],
        "submitted": "2025-09-29 17:39:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ORPO-Distill: Mixed-Policy Preference Optimization for Cross-Architecture LLM Distillation",
        "abstract": "We introduce ORPO-Distill, a general-purpose method for cross-architecture\nLLM distillation that formulates the problem as a preference optimization task.\nUnlike standard CoT distillation, the approach transfers knowledge through\ndiverse reasoning traces. It employs an Odds-Ratio Preference Optimization\nobjective that contrasts teacher and student traces for more effective\nlearning, and adopts a mixed-policy strategy for utilizing student-generated\noutputs, outperforming both off- and on-policy alternatives. Experiments on\nfive datasets and multiple student models show consistent improvements over\nconventional black-box KD baselines.",
        "url": "http://arxiv.org/abs/2509.25100v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25100v1",
        "arxiv_id": "2509.25100v1",
        "authors": [
            "Aasheesh Singh",
            "Vishal Vaddina",
            "Dagnachew Birru"
        ],
        "submitted": "2025-09-29 17:34:02",
        "source": "arxiv",
        "comment": "Accepted at NeurIPS 2025, Efficient Reasoning Workshop"
    },
    {
        "title": "Scaling with Collapse: Efficient and Predictable Training of LLM Families",
        "abstract": "Effective LLM training relies on *consistency*, meaning that key quantities\n-- such as final losses and optimal hyperparameters -- scale predictably across\nmodel sizes. Qiu et al. (2025) recently showed that this consistency extends\nbeyond scalars: whole training loss curves can *collapse* onto a universal\ntrajectory after a simple normalization. What remains unclear is whether this\nphenomenon holds for LLM families trained under *practical scaling recipes*,\nwhere width, depth, learning rate, batch size, and weight decay are scaled\njointly. We show that it does: loss curves collapse across scales precisely\nwhen optimization hyperparameters are set optimally for the given data budget,\nin accordance with recent empirical scaling laws. Collapse thus emerges as a\nsignature of compute-efficient training. We demonstrate two applications at\nscale: (1) deviation-from-collapse provides a sensitive, early diagnostic of\ntraining pathologies, and (2) the predictability of collapsed curves enables\nearly stopping in large-scale hyperparameter tuning. Finally, we train a\ncompetitive LLM family, *Celerity*, using these insights, highlighting collapse\nas an effective tool for developing efficient LLMs.",
        "url": "http://arxiv.org/abs/2509.25087v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25087v1",
        "arxiv_id": "2509.25087v1",
        "authors": [
            "Shane Bergsma",
            "Bin Claire Zhang",
            "Nolan Dey",
            "Shaheer Muhammad",
            "Gurpreet Gosal",
            "Joel Hestness"
        ],
        "submitted": "2025-09-29 17:26:11",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Towards Trustworthy Lexical Simplification: Exploring Safety and Efficiency with Small LLMs",
        "abstract": "Despite their strong performance, large language models (LLMs) face\nchallenges in real-world application of lexical simplification (LS),\nparticularly in privacy-sensitive and resource-constrained environments.\nMoreover, since vulnerable user groups (e.g., people with disabilities) are one\nof the key target groups of this technology, it is crucial to ensure the safety\nand correctness of the output of LS systems. To address these issues, we\npropose an efficient framework for LS systems that utilizes small LLMs\ndeployable in local environments. Within this framework, we explore knowledge\ndistillation with synthesized data and in-context learning as baselines. Our\nexperiments in five languages evaluate model outputs both automatically and\nmanually. Our manual analysis reveals that while knowledge distillation boosts\nautomatic metric scores, it also introduces a safety trade-off by increasing\nharmful simplifications. Importantly, we find that the model's output\nprobability is a useful signal for detecting harmful simplifications.\nLeveraging this, we propose a filtering strategy that suppresses harmful\nsimplifications while largely preserving beneficial ones. This work establishes\na benchmark for efficient and safe LS with small LLMs. It highlights the key\ntrade-offs between performance, efficiency, and safety, and demonstrates a\npromising approach for safe real-world deployment.",
        "url": "http://arxiv.org/abs/2509.25086v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25086v1",
        "arxiv_id": "2509.25086v1",
        "authors": [
            "Akio Hayakawa",
            "Stefan Bott",
            "Horacio Saggion"
        ],
        "submitted": "2025-09-29 17:25:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "jina-reranker-v3: Last but Not Late Interaction for Document Reranking",
        "abstract": "jina-reranker-v3 is a 0.6B parameter multilingual document reranker that\nintroduces a novel last but not late interaction. Unlike late interaction\nmodels such as ColBERT that perform separate encoding followed by multi-vector\nmatching, our approach conducts causal self-attention between query and\ndocuments within the same context window, enabling rich cross-document\ninteractions before extracting contextual embeddings from the last token of\neach document. This compact architecture achieves state-of-the-art BEIR\nperformance with 61.94 nDCG@10 while being ten times smaller than generative\nlistwise rerankers.",
        "url": "http://arxiv.org/abs/2509.25085v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25085v1",
        "arxiv_id": "2509.25085v1",
        "authors": [
            "Feng Wang",
            "Yuqing Li",
            "Han Xiao"
        ],
        "submitted": "2025-09-29 17:23:54",
        "source": "arxiv",
        "comment": "early draft, CoIR table needs to be updated"
    },
    {
        "title": "Scaling Generalist Data-Analytic Agents",
        "abstract": "Data-analytic agents are emerging as a key catalyst for automated scientific\ndiscovery and for the vision of Innovating AI. Current approaches, however,\nrely heavily on prompt engineering over proprietary models, while open-source\nmodels struggle to face diverse-format, large-scale data files and\nlong-horizon, multi-step reasoning that real-world analytics demands. This\npaper introduces DataMind, a scalable data synthesis and agent training recipe\ndesigned to build generalist data-analytic agents. DataMind tackles three key\nchallenges in building open-source data-analytic agents, including insufficient\ndata resources, improper training strategy, and unstable code-based multi-turn\nrollout. Concretely, DataMind applies 1) a fine-grained task taxonomy and a\nrecursive easy-to-hard task composition mechanism to increase the diversity and\ndifficulty of synthesized queries; 2) a knowledge-augmented trajectory sampling\nstrategy followed by model-based and rule-based filtering; 3) a dynamically\nadjustable training objective combining both SFT and RL losses; 4) a\nmemory-frugal and stable code-based multi-turn rollout framework. Built on\nDataMind, we curate DataMind-12K, a high-quality trajectory set spanning\ndiverse domains, task categories, and data file formats for data-analytic\ntasks. Trained on DataMind-12K, our DataMind-14B achieves state-of-the-art with\nan average score of 71.16% on multiple data analysis benchmarks, outperforming\nthe strongest proprietary baselines DeepSeek-V3.1 and GPT-5. Our DataMind-7B\nalso performs best among all open-source models with a score of 68.10%. We also\nincorporate some empirical insights gained from our exploratory trials into the\nanalysis experiments, aiming to provide actionable insights about agentic\ntraining for the community. We will release DataMind-12K and DataMind-7B,14B\nfor the community's future research.",
        "url": "http://arxiv.org/abs/2509.25084v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25084v1",
        "arxiv_id": "2509.25084v1",
        "authors": [
            "Shuofei Qiao",
            "Yanqiu Zhao",
            "Zhisong Qiu",
            "Xiaobin Wang",
            "Jintian Zhang",
            "Zhao Bin",
            "Ningyu Zhang",
            "Yong Jiang",
            "Pengjun Xie",
            "Fei Huang",
            "Huajun Chen"
        ],
        "submitted": "2025-09-29 17:23:08",
        "source": "arxiv",
        "comment": "Work in progress"
    },
    {
        "title": "An empirical study on the limitation of Transformers in program trace generation",
        "abstract": "We study Transformers on the task \\emph{program trace generation} (PTG),\nwhere models produce step-by-step execution traces for synthetic programs.\nUnlike existing algorithmic problems, PTG externalizes reasoning through long\ntraces where each step is trivial. We train small Transformers with diverse\nmodifications, including alternative position encodings, softmax replacements,\nhybrid model, and short convolutions. While these models achieve strong\nin-distribution accuracy, they exhibit systematic failures when generalizing to\nvarious factors (e.g., program length, trace steps), though some designs\nsignificantly improve generalization.",
        "url": "http://arxiv.org/abs/2509.25073v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25073v1",
        "arxiv_id": "2509.25073v1",
        "authors": [
            "Simeng Sun"
        ],
        "submitted": "2025-09-29 17:17:07",
        "source": "arxiv",
        "comment": "two-page extended abstract"
    },
    {
        "title": "Learning from Convenience Samples: A Case Study on Fine-Tuning LLMs for Survey Non-response in the German Longitudinal Election Study",
        "abstract": "Survey researchers face two key challenges: the rising costs of probability\nsamples and missing data (e.g., non-response or attrition), which can undermine\ninference and increase the use of convenience samples. Recent work explores\nusing large language models (LLMs) to simulate respondents via persona-based\nprompts, often without labeled data. We study a more practical setting where\npartial survey responses exist: we fine-tune LLMs on available data to impute\nself-reported vote choice under both random and systematic nonresponse, using\nthe German Longitudinal Election Study. We compare zero-shot prompting and\nsupervised fine-tuning against tabular classifiers (e.g., CatBoost) and test\nhow different convenience samples (e.g., students) used for fine-tuning affect\ngeneralization.\n  Our results show that when data are missing completely at random, fine-tuned\nLLMs match tabular classifiers but outperform zero-shot approaches. When only\nbiased convenience samples are available, fine-tuning small (3B to 8B)\nopen-source LLMs can recover both individual-level predictions and\npopulation-level distributions more accurately than zero-shot and often better\nthan tabular methods. This suggests fine-tuned LLMs offer a promising strategy\nfor researchers working with non-probability samples or systematic missingness,\nand may enable new survey designs requiring only easily accessible\nsubpopulations.",
        "url": "http://arxiv.org/abs/2509.25063v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25063v1",
        "arxiv_id": "2509.25063v1",
        "authors": [
            "Tobias Holtdirk",
            "Dennis Assenmacher",
            "Arnim Bleier",
            "Claudia Wagner"
        ],
        "submitted": "2025-09-29 17:12:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Confidence-Guided Error Correction for Disordered Speech Recognition",
        "abstract": "We investigate the use of large language models (LLMs) as post-processing\nmodules for automatic speech recognition (ASR), focusing on their ability to\nperform error correction for disordered speech. In particular, we propose\nconfidence-informed prompting, where word-level uncertainty estimates are\nembedded directly into LLM training to improve robustness and generalization\nacross speakers and datasets. This approach directs the model to uncertain ASR\nregions and reduces overcorrection. We fine-tune a LLaMA 3.1 model and compare\nour approach to both transcript-only fine-tuning and post hoc confidence-based\nfiltering. Evaluations show that our method achieves a 10% relative WER\nreduction compared to naive LLM correction on the Speech Accessibility Project\nspontaneous speech and a 47% reduction on TORGO, demonstrating the\neffectiveness of confidence-aware fine-tuning for impaired speech.",
        "url": "http://arxiv.org/abs/2509.25048v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25048v1",
        "arxiv_id": "2509.25048v1",
        "authors": [
            "Abner Hernandez",
            "Tomás Arias Vergara",
            "Andreas Maier",
            "Paula Andrea Pérez-Toro"
        ],
        "submitted": "2025-09-29 17:00:38",
        "source": "arxiv",
        "comment": "Preprint submitted to ICASSP"
    },
    {
        "title": "Hyperdimensional Probe: Decoding LLM Representations via Vector Symbolic Architectures",
        "abstract": "Despite their capabilities, Large Language Models (LLMs) remain opaque with\nlimited understanding of their internal representations. Current\ninterpretability methods, such as direct logit attribution (DLA) and sparse\nautoencoders (SAEs), provide restricted insight due to limitations such as the\nmodel's output vocabulary or unclear feature names. This work introduces\nHyperdimensional Probe, a novel paradigm for decoding information from the LLM\nvector space. It combines ideas from symbolic representations and neural\nprobing to project the model's residual stream into interpretable concepts via\nVector Symbolic Architectures (VSAs). This probe combines the strengths of SAEs\nand conventional probes while overcoming their key limitations. We validate our\ndecoding paradigm with controlled input-completion tasks, probing the model's\nfinal state before next-token prediction on inputs spanning syntactic pattern\nrecognition, key-value associations, and abstract inference. We further assess\nit in a question-answering setting, examining the state of the model both\nbefore and after text generation. Our experiments show that our probe reliably\nextracts meaningful concepts across varied LLMs, embedding sizes, and input\ndomains, also helping identify LLM failures. Our work advances information\ndecoding in LLM vector space, enabling extracting more informative,\ninterpretable, and structured features from neural representations.",
        "url": "http://arxiv.org/abs/2509.25045v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25045v1",
        "arxiv_id": "2509.25045v1",
        "authors": [
            "Marco Bronzini",
            "Carlo Nicolini",
            "Bruno Lepri",
            "Jacopo Staiano",
            "Andrea Passerini"
        ],
        "submitted": "2025-09-29 16:59:07",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "GateMABSA: Aspect-Image Gated Fusion for Multimodal Aspect-based Sentiment Analysis",
        "abstract": "Aspect-based Sentiment Analysis (ABSA) has recently advanced into the\nmultimodal domain, where user-generated content often combines text and images.\nHowever, existing multimodal ABSA (MABSA) models struggle to filter noisy\nvisual signals, and effectively align aspects with opinion-bearing content\nacross modalities. To address these challenges, we propose GateMABSA, a novel\ngated multimodal architecture that integrates syntactic, semantic, and\nfusion-aware mLSTM. Specifically, GateMABSA introduces three specialized\nmLSTMs: Syn-mLSTM to incorporate syntactic structure, Sem-mLSTM to emphasize\naspect--semantic relevance, and Fuse-mLSTM to perform selective multimodal\nfusion. Extensive experiments on two benchmark Twitter datasets demonstrate\nthat GateMABSA outperforms several baselines.",
        "url": "http://arxiv.org/abs/2509.25037v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25037v1",
        "arxiv_id": "2509.25037v1",
        "authors": [
            "Adamu Lawan",
            "Haruna Yunusa"
        ],
        "submitted": "2025-09-29 16:56:10",
        "source": "arxiv",
        "comment": "6 pages, 2 tables"
    },
    {
        "title": "Ultra-Fast Language Generation via Discrete Diffusion Divergence Instruct",
        "abstract": "Fast generation of language texts is the holy grail that people pursue in the\nAI era. In this work, we introduced Discrete Diffusion Divergence Instruct\n(DiDi-Instruct), a training-based method that leads to fast language generation\nmodels by initializing from a pre-trained (masked) discrete diffusion language\nmodel (dLLM). The resulting DiDi-Instruct model outperforms the dLLM\ncounterparts and the GPT-2 baseline with 64x acceleration. In the theoretical\npart of the paper, we build the foundation of DiDi-Instruct in a framework of\nintegral KL-divergence minimization, with practical training algorithms. We\nalso introduce techniques like grouped reward normalization, intermediate-state\nmatching, and the reward-guided ancestral sampler (RGAS) that significantly\nimprove the training stability, the model coverage, and the inference\nperformances. On OpenWebText, DiDi-Instruct outperforms all accelerated\nlanguage generation models as well as the GPT-2 baseline and the standard\ndLLMs, achieving sample perplexities ranging from 62.2 (8 NFEs) to 18.4 (128\nNFEs). These performance gains are accomplished with a negligible entropy loss\nof about 1% and 20x less additional training wall-clock time. We further\nvalidate the robustness and effectiveness of DiDi-Instruct through extensive\nablation studies, model scaling, and the generation of discrete protein\nsequences. In conclusion, DiDi-Instruct is an efficient yet effective\ndistillation method, enabling language generation in the blink of an eye. We\nwill release both code and models at github.com/haoyangzheng-ai/didi-instruct.",
        "url": "http://arxiv.org/abs/2509.25035v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25035v1",
        "arxiv_id": "2509.25035v1",
        "authors": [
            "Haoyang Zheng",
            "Xinyang Liu",
            "Cindy Xiangrui Kong",
            "Nan Jiang",
            "Zheyuan Hu",
            "Weijian Luo",
            "Wei Deng",
            "Guang Lin"
        ],
        "submitted": "2025-09-29 16:55:44",
        "source": "arxiv",
        "comment": "56 pages, 7 figures, 7 tables"
    },
    {
        "title": "Circuit Distillation",
        "abstract": "Model distillation typically focuses on behavioral mimicry, where a student\nmodel is trained to replicate a teacher's output while treating its internal\ncomputations as a black box. In this work we propose an alternative approach:\nDistilling the underlying computational mechanisms implemented by a teacher\nmodel. Specifically, we propose circuit distillation, which introduces an\nobjective to align internal representations between analogous circuit\ncomponents in teacher and student models. We propose a method to match\n``functionally correspondent'' circuit components and introduce a loss\nreflecting similarities between the representations that these induce. We\nevaluate circuit distillation on entity tracking and theory of mind (ToM) tasks\nusing models from the Llama3 family. Our results demonstrate that circuit\ndistillation outperforms standard distillation, successfully transferring\nalgorithmic capabilities by adjusting only a small, targeted subset of student\nmodel parameters. This work establishes the feasibility of transferring\nmechanisms, which may in turn allow for efficient distillation of targeted\nteacher capabilities via interpretable and controllable internal student\nmechanisms.",
        "url": "http://arxiv.org/abs/2509.25002v1",
        "pdf_url": "http://arxiv.org/pdf/2509.25002v1",
        "arxiv_id": "2509.25002v1",
        "authors": [
            "Somin Wadhwa",
            "Silvio Amir",
            "Byron C. Wallace"
        ],
        "submitted": "2025-09-29 16:28:36",
        "source": "arxiv",
        "comment": "Preprint; Under Review"
    },
    {
        "title": "Generalized Correctness Models: Learning Calibrated and Model-Agnostic Correctness Predictors from Historical Patterns",
        "abstract": "Generating accurate and calibrated confidence estimates is critical for\ndeploying LLMs in high-stakes or user-facing applications, and remains an open\nchallenge. Prior research has often framed confidence as a problem of eliciting\na model's \"self-knowledge\", i.e., the ability of an LLM to judge whether its\nown answers are correct; this approach implicitly assumes that there is some\nprivileged information about the answer's correctness that is accessible to the\nmodel itself. However, our experiments reveal that an LLM attempting to predict\nthe correctness of its own outputs generally performs no better than an\nunrelated LLM. Moreover, we hypothesize that a key factor in building a\n\"Correctness Model\" (CM) is exposure to a target model's historical\npredictions. We propose multiple methods to inject this historical correctness\ninformation, creating a Generalized Correctness Model (GCM). We first show that\nGCMs can be trained on the correctness data from many LLMs and learn patterns\nfor correctness prediction applicable across datasets and models. We then use\nCMs as a lens for studying the source of correctness prediction ability and its\ngeneralization, systematically controlling their training data and finding that\nanswer phrasing is a strong predictor for correctness. We further explore\nalternative methods of injecting history without training an LLM, finding that\nincluding history as in-context examples can help improve correctness\nprediction, and post-hoc calibration can provide complementary reductions in\ncalibration error. We evaluate GCMs based on Qwen3-8B across 5 model families\nand the MMLU and TriviaQA datasets, as well as on a downstream selective\nprediction task, finding that reliable LLM confidence estimation is a\ngeneralizable and model-agnostic skill learned by systematically encoding\ncorrectness history rather than a model-specific skill reliant on\nself-introspection.",
        "url": "http://arxiv.org/abs/2509.24988v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24988v1",
        "arxiv_id": "2509.24988v1",
        "authors": [
            "Hanqi Xiao",
            "Vaidehi Patil",
            "Hyunji Lee",
            "Elias Stengel-Eskin",
            "Mohit Bansal"
        ],
        "submitted": "2025-09-29 16:19:01",
        "source": "arxiv",
        "comment": "Code:\n  https://github.com/The-Inscrutable-X/CalibratedModelAgnosticCorrectness"
    },
    {
        "title": "DiffTester: Accelerating Unit Test Generation for Diffusion LLMs via Repetitive Pattern",
        "abstract": "Software development relies heavily on extensive unit testing, which makes\nthe efficiency of automated Unit Test Generation (UTG) particularly important.\nHowever, most existing LLMs generate test cases one token at a time in each\nforward pass, which leads to inefficient UTG. Recently, diffusion LLMs (dLLMs)\nhave emerged, offering promising parallel generation capabilities and showing\nstrong potential for efficient UTG. Despite this advantage, their application\nto UTG is still constrained by a clear trade-off between efficiency and test\nquality, since increasing the number of tokens generated in each step often\ncauses a sharp decline in the quality of test cases. To overcome this\nlimitation, we present DiffTester, an acceleration framework specifically\ntailored for dLLMs in UTG. The key idea of DiffTester is that unit tests\ntargeting the same focal method often share repetitive structural patterns. By\ndynamically identifying these common patterns through abstract syntax tree\nanalysis during generation, DiffTester adaptively increases the number of\ntokens produced at each step without compromising the quality of the output. To\nenable comprehensive evaluation, we extend the original TestEval benchmark,\nwhich was limited to Python, by introducing additional programming languages\nincluding Java and C++. Extensive experiments on three benchmarks with two\nrepresentative models show that DiffTester delivers significant acceleration\nwhile preserving test coverage. Moreover, DiffTester generalizes well across\ndifferent dLLMs and programming languages, providing a practical and scalable\nsolution for efficient UTG in software development. Code and data are publicly\navailable at https://github.com/wellbeingyang/DLM4UTG-open .",
        "url": "http://arxiv.org/abs/2509.24975v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24975v1",
        "arxiv_id": "2509.24975v1",
        "authors": [
            "Lekang Yang",
            "Yuetong Liu",
            "Yitong Zhang",
            "Jia Li"
        ],
        "submitted": "2025-09-29 16:04:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SemanticShield: LLM-Powered Audits Expose Shilling Attacks in Recommender Systems",
        "abstract": "Recommender systems (RS) are widely used in e-commerce for personalized\nsuggestions, yet their openness makes them susceptible to shilling attacks,\nwhere adversaries inject fake behaviors to manipulate recommendations. Most\nexisting defenses emphasize user-side behaviors while overlooking item-side\nfeatures such as titles and descriptions that can expose malicious intent. To\naddress this gap, we propose a two-stage detection framework that integrates\nitem-side semantics via large language models (LLMs). The first stage\npre-screens suspicious users using low-cost behavioral criteria, and the second\nstage employs LLM-based auditing to evaluate semantic consistency. Furthermore,\nwe enhance the auditing model through reinforcement fine-tuning on a\nlightweight LLM with carefully designed reward functions, yielding a\nspecialized detector called SemanticShield. Experiments on six representative\nattack strategies demonstrate the effectiveness of SemanticShield against\nshilling attacks, and further evaluation on previously unseen attack methods\nshows its strong generalization capability. Code is available at\nhttps://github.com/FrankenstLee/SemanticShield.",
        "url": "http://arxiv.org/abs/2509.24961v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24961v1",
        "arxiv_id": "2509.24961v1",
        "authors": [
            "Kaihong Li",
            "Huichi Zhou",
            "Bin Ma",
            "Fangjun Huang"
        ],
        "submitted": "2025-09-29 15:53:47",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The Dialogue That Heals: A Comprehensive Evaluation of Doctor Agents' Inquiry Capability",
        "abstract": "An effective physician should possess a combination of empathy, expertise,\npatience, and clear communication when treating a patient. Recent advances have\nsuccessfully endowed AI doctors with expert diagnostic skills, particularly the\nability to actively seek information through inquiry. However, other essential\nqualities of a good doctor remain overlooked. To bridge this gap, we present\nMAQuE(Medical Agent Questioning Evaluation), the largest-ever benchmark for the\nautomatic and comprehensive evaluation of medical multi-turn questioning. It\nfeatures 3,000 realistically simulated patient agents that exhibit diverse\nlinguistic patterns, cognitive limitations, emotional responses, and tendencies\nfor passive disclosure. We also introduce a multi-faceted evaluation framework,\ncovering task success, inquiry proficiency, dialogue competence, inquiry\nefficiency, and patient experience. Experiments on different LLMs reveal\nsubstantial challenges across the evaluation aspects. Even state-of-the-art\nmodels show significant room for improvement in their inquiry capabilities.\nThese models are highly sensitive to variations in realistic patient behavior,\nwhich considerably impacts diagnostic accuracy. Furthermore, our fine-grained\nmetrics expose trade-offs between different evaluation perspectives,\nhighlighting the challenge of balancing performance and practicality in\nreal-world clinical settings.",
        "url": "http://arxiv.org/abs/2509.24958v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24958v1",
        "arxiv_id": "2509.24958v1",
        "authors": [
            "Linlu Gong",
            "Ante Wang",
            "Yunghwei Lai",
            "Weizhi Ma",
            "Yang Liu"
        ],
        "submitted": "2025-09-29 15:52:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MobileLLM-R1: Exploring the Limits of Sub-Billion Language Model Reasoners with Open Training Recipes",
        "abstract": "The paradigm shift in large language models (LLMs) from instinctive responses\nto chain-of-thought (CoT) reasoning has fueled two prevailing assumptions: (1)\nreasoning capabilities only emerge in sufficiently large models, and (2) such\ncapabilities require training on massive datasets. While the first assumption\nhas already been challenged by recent sub-billion-parameter reasoning models\nsuch as Qwen3-0.6B and DeepSeek distilled variants, the second remains largely\nunquestioned. In this work, we revisit the necessity of scaling to extremely\nlarge corpora (>10T tokens) for reasoning emergence. By carefully curating and\nresampling open-source datasets that we identify as beneficial under our\ndesigned metrics, we demonstrate that strong reasoning abilities can emerge\nwith far less data. Specifically, we show that only ~2T tokens of high-quality\ndata are sufficient, and pre-training with 4.2T tokens on the dataset resampled\nfrom these ~2T tokens, followed by a established post-training procedure,\nenables the development of MobileLLM-R1, a series of sub-billion-parameter\nreasoning models that substantially outperform prior models trained on fully\nopen-sourced data. For example, MobileLLM-R1-950M achieves an AIME score of\n15.5, compared to just 0.6 for OLMo-2-1.48B and 0.3 for SmolLM-2-1.7B.\nRemarkably, despite being trained on only 11.7% of the tokens compared to\nQwen3's proprietary 36T-token corpus for pretraining, MobileLLM-R1-950M matches\nor surpasses Qwen3-0.6B across multiple reasoning benchmarks. To facilitate\nfurther research in this direction, we have released the complete training\nrecipe, data sources, data mixing ratio, and model checkpoints, together with\nthe key insights obtained throughout this study.",
        "url": "http://arxiv.org/abs/2509.24945v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24945v1",
        "arxiv_id": "2509.24945v1",
        "authors": [
            "Changsheng Zhao",
            "Ernie Chang",
            "Zechun Liu",
            "Chia-Jung Chang",
            "Wei Wen",
            "Chen Lai",
            "Rick Cao",
            "Yuandong Tian",
            "Raghuraman Krishnamoorthi",
            "Yangyang Shi",
            "Vikas Chandra"
        ],
        "submitted": "2025-09-29 15:43:59",
        "source": "arxiv",
        "comment": "Model:\n  https://huggingface.co/collections/facebook/mobilellm-r1-68c4597b104fac45f28f448e"
    },
    {
        "title": "How Well Do LLMs Imitate Human Writing Style?",
        "abstract": "Large language models (LLMs) can generate fluent text, but their ability to\nreplicate the distinctive style of a specific human author remains unclear. We\npresent a fast, training-free framework for authorship verification and style\nimitation analysis. The method integrates TF-IDF character n-grams with\ntransformer embeddings and classifies text pairs through empirical distance\ndistributions, eliminating the need for supervised training or threshold\ntuning. It achieves 97.5\\% accuracy on academic essays and 94.5\\% in\ncross-domain evaluation, while reducing training time by 91.8\\% and memory\nusage by 59\\% relative to parameter-based baselines. Using this framework, we\nevaluate five LLMs from three separate families (Llama, Qwen, Mixtral) across\nfour prompting strategies - zero-shot, one-shot, few-shot, and text completion.\nResults show that the prompting strategy has a more substantial influence on\nstyle fidelity than model size: few-shot prompting yields up to 23.5x higher\nstyle-matching accuracy than zero-shot, and completion prompting reaches 99.9\\%\nagreement with the original author's style. Crucially, high-fidelity imitation\ndoes not imply human-like unpredictability - human essays average a perplexity\nof 29.5, whereas matched LLM outputs average only 15.2. These findings\ndemonstrate that stylistic fidelity and statistical detectability are\nseparable, establishing a reproducible basis for future work in authorship\nmodeling, detection, and identity-conditioned generation.",
        "url": "http://arxiv.org/abs/2509.24930v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24930v1",
        "arxiv_id": "2509.24930v1",
        "authors": [
            "Rebira Jemama",
            "Rajesh Kumar"
        ],
        "submitted": "2025-09-29 15:34:40",
        "source": "arxiv",
        "comment": "IEEE UEMCON 2025, 11 pages, 4 figures, and 4 tables"
    },
    {
        "title": "When Greedy Wins: Emergent Exploitation Bias in Meta-Bandit LLM Training",
        "abstract": "While Large Language Models (LLMs) hold promise to become autonomous agents,\nthey often explore suboptimally in sequential decision-making. Recent work has\nsought to enhance this capability via supervised fine-tuning (SFT) or\nreinforcement learning (RL), improving regret on the classic multi-armed bandit\ntask. However, it remains unclear how these learning methods shape exploration\nstrategies and how well they generalize. We investigate both paradigms by\ntraining LLMs with SFT on expert trajectories and RL with a range of tailored\nreward signals including a strategic, regret-shaped reward to reduce variance,\nand an algorithmic reward that enables oracle imitation. The resulting agents\noutperform pre-trained models and achieve performance comparable to Upper\nConfidence Bound (UCB) and Thompson Sampling, with robust generalization to 6x\nlonger horizons and across bandit families. Behavioral analysis reveals that\ngains often stem from more sophisticated but greedier exploitation: RL/SFT\nagents are more prone to early catastrophic failure than pre-trained models,\nprematurely abandoning exploration. Furthermore, agents trained to imitate UCB\nlearn to outperform their teacher by adopting more exploitative variants. Our\nfindings clarify when each training paradigm is preferable and advocate\ntailored reward design and evaluation beyond average regret to promote robust\nexploratory behavior.",
        "url": "http://arxiv.org/abs/2509.24923v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24923v1",
        "arxiv_id": "2509.24923v1",
        "authors": [
            "Sanxing Chen",
            "Xiaoyin Chen",
            "Yukun Huang",
            "Roy Xie",
            "Bhuwan Dhingra"
        ],
        "submitted": "2025-09-29 15:25:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MASLegalBench: Benchmarking Multi-Agent Systems in Deductive Legal Reasoning",
        "abstract": "Multi-agent systems (MAS), leveraging the remarkable capabilities of Large\nLanguage Models (LLMs), show great potential in addressing complex tasks. In\nthis context, integrating MAS with legal tasks is a crucial step. While\nprevious studies have developed legal benchmarks for LLM agents, none are\nspecifically designed to consider the unique advantages of MAS, such as task\ndecomposition, agent specialization, and flexible training. In fact, the lack\nof evaluation methods limits the potential of MAS in the legal domain. To\naddress this gap, we propose MASLegalBench, a legal benchmark tailored for MAS\nand designed with a deductive reasoning approach. Our benchmark uses GDPR as\nthe application scenario, encompassing extensive background knowledge and\ncovering complex reasoning processes that effectively reflect the intricacies\nof real-world legal situations. Furthermore, we manually design various\nrole-based MAS and conduct extensive experiments using different\nstate-of-the-art LLMs. Our results highlight the strengths, limitations, and\npotential areas for improvement of existing models and MAS architectures.",
        "url": "http://arxiv.org/abs/2509.24922v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24922v2",
        "arxiv_id": "2509.24922v2",
        "authors": [
            "Huihao Jing",
            "Wenbin Hu",
            "Hongyu Luo",
            "Jianhui Yang",
            "Wei Fan",
            "Haoran Li",
            "Yangqiu Song"
        ],
        "submitted": "2025-09-29 15:24:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "BOE-XSUM: Extreme Summarization in Clear Language of Spanish Legal Decrees and Notifications",
        "abstract": "The ability to summarize long documents succinctly is increasingly important\nin daily life due to information overload, yet there is a notable lack of such\nsummaries for Spanish documents in general, and in the legal domain in\nparticular. In this work, we present BOE-XSUM, a curated dataset comprising\n3,648 concise, plain-language summaries of documents sourced from Spain's\n``Bolet\\'{\\i}n Oficial del Estado'' (BOE), the State Official Gazette. Each\nentry in the dataset includes a short summary, the original text, and its\ndocument type label. We evaluate the performance of medium-sized large language\nmodels (LLMs) fine-tuned on BOE-XSUM, comparing them to general-purpose\ngenerative models in a zero-shot setting. Results show that fine-tuned models\nsignificantly outperform their non-specialized counterparts. Notably, the\nbest-performing model -- BERTIN GPT-J 6B (32-bit precision) -- achieves a 24\\%\nperformance gain over the top zero-shot model, DeepSeek-R1 (accuracies of\n41.6\\% vs.\\ 33.5\\%).",
        "url": "http://arxiv.org/abs/2509.24908v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24908v1",
        "arxiv_id": "2509.24908v1",
        "authors": [
            "Andrés Fernández García",
            "Javier de la Rosa",
            "Julio Gonzalo",
            "Roser Morante",
            "Enrique Amigó",
            "Alejandro Benito-Santos",
            "Jorge Carrillo-de-Albornoz",
            "Víctor Fresno",
            "Adrian Ghajari",
            "Guillermo Marco",
            "Laura Plaza",
            "Eva Sánchez Salido"
        ],
        "submitted": "2025-09-29 15:15:17",
        "source": "arxiv",
        "comment": "Published in SEPLN 2025. 20 pages, 4 figures"
    },
    {
        "title": "Neural network embeddings recover value dimensions from psychometric survey items on par with human data",
        "abstract": "This study introduces \"Survey and Questionnaire Item Embeddings\nDifferentials\" (SQuID), a novel methodological approach that enables neural\nnetwork embeddings to effectively recover latent dimensions from psychometric\nsurvey items. We demonstrate that embeddings derived from large language\nmodels, when processed with SQuID, can recover the structure of human values\nobtained from human rater judgments on the Revised Portrait Value Questionnaire\n(PVQ-RR). Our experimental validation compares multiple embedding models across\na number of evaluation metrics. Unlike previous approaches, SQuID successfully\naddresses the challenge of obtaining negative correlations between dimensions\nwithout requiring domain-specific fine-tuning. Quantitative analysis reveals\nthat our embedding-based approach explains 55% of variance in\ndimension-dimension similarities compared to human data. Multidimensional\nscaling configurations from both types of data show fair factor congruence\ncoefficients and largely follow the underlying theory. These results\ndemonstrate that semantic embeddings can effectively replicate psychometric\nstructures previously established through extensive human surveys. The approach\noffers substantial advantages in cost, scalability and flexibility while\nmaintaining comparable quality to traditional methods. Our findings have\nsignificant implications for psychometrics and social science research,\nproviding a complementary methodology that could expand the scope of human\nbehavior and experience represented in measurement tools.",
        "url": "http://arxiv.org/abs/2509.24906v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24906v1",
        "arxiv_id": "2509.24906v1",
        "authors": [
            "Max Pellert",
            "Clemens M. Lechner",
            "Indira Sen",
            "Markus Strohmaier"
        ],
        "submitted": "2025-09-29 15:14:54",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MMRQA: Signal-Enhanced Multimodal Large Language Models for MRI Quality Assessment",
        "abstract": "Magnetic resonance imaging (MRI) quality assessment is crucial for clinical\ndecision-making, yet remains challenging due to data scarcity and protocol\nvariability. Traditional approaches face fundamental trade-offs: signal-based\nmethods like MRIQC provide quantitative metrics but lack semantic\nunderstanding, while deep learning approaches achieve high accuracy but\nsacrifice interpretability. To address these limitations, we introduce the\nMultimodal MRI Quality Assessment (MMRQA) framework, pioneering the integration\nof multimodal large language models (MLLMs) with acquisition-aware signal\nprocessing. MMRQA combines three key innovations: robust metric extraction via\nMRQy augmented with simulated artifacts, structured transformation of metrics\ninto question-answer pairs using Qwen, and parameter-efficient fusion through\nLow-Rank Adaptation (LoRA) of LLaVA-OneVision. Evaluated on MR-ART, FastMRI,\nand MyConnectome benchmarks, MMRQA achieves state-of-the-art performance with\nstrong zero-shot generalization, as validated by comprehensive ablation\nstudies. By bridging quantitative analysis with semantic reasoning, our\nframework generates clinically interpretable outputs that enhance quality\ncontrol in dynamic medical settings.",
        "url": "http://arxiv.org/abs/2509.24888v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24888v1",
        "arxiv_id": "2509.24888v1",
        "authors": [
            "Fankai Jia",
            "Daisong Gan",
            "Zhe Zhang",
            "Zhaochi Wen",
            "Chenchen Dan",
            "Dong Liang",
            "Haifeng Wang"
        ],
        "submitted": "2025-09-29 15:00:19",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Expanding Computation Spaces of LLMs at Inference Time",
        "abstract": "Chain-of-thought (CoT) rationale enables language models to use additional\ntask-related text for problem-solving, benefiting not only from detailed\nreasoning steps but also from the expanded computational space of longer\ninputs. Prior work has trained filler or special tokens to serve as additional\ncomputation spaces. In this study, we investigate whether language models can\nleverage artificially inserted sequences of filler tokens solely at inference.\nWe first identify effective token types, numbers, and insertion locations, then\nexamine at what stage of training models begin to exploit the expanded\ncomputation space, and finally analyze dynamics within these spaces via\nattention maps. Experiments on models ranging from 1.7B to 32B across\nopen-domain QA and math tasks show that appropriate token types and counts\nvary, but placing filler tokens directly before the final 'Answer:' token is\nmost effective. Smaller models benefit most, up to 12.372 percentage points in\nSmolLM2-1.7B-Instruct, indicating that these spaces act as additional\ncomputational capacity rather than redundant input. Attention maps reveal that\nexpanded spaces often continue the original attention mechanism and sometimes\nfocus on questions or answer options, suggesting meaningful computation for\nproblem-solving.",
        "url": "http://arxiv.org/abs/2509.24884v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24884v1",
        "arxiv_id": "2509.24884v1",
        "authors": [
            "Yoonna Jang",
            "Kisu Yang",
            "Isabelle Augenstein"
        ],
        "submitted": "2025-09-29 14:59:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Retro*: Optimizing LLMs for Reasoning-Intensive Document Retrieval",
        "abstract": "With the growing popularity of LLM agents and RAG, it has become increasingly\nimportant to retrieve documents that are essential for solving a task, even\nwhen their connection to the task is indirect or implicit. Addressing this\nproblem requires fine-grained reasoning to accurately assess the relevance\nbetween the task and each candidate document. This capability, however, poses a\nsignificant challenge for existing IR techniques. Despite recent progress in\nreasoning-enhanced IR, existing approaches still face significant challenges in\napplicability, scalability, and efficiency. In this work, we propose Retro*, a\nnovel approach for reasoning-intensive document retrieval. Our method\nintroduces a rubric-based relevance scoring mechanism, enabling the model to\nreason about the relationship between a task and a document based on explicitly\ndefined criteria, whereby producing a fine-grained, interpretable relevance\nscore. Retro* also supports test-time scaling by combining multiple reasoning\ntrajectories via score integration, which produces more reliable relevance\nestimates. To optimize Retro*'s reasoning capabilities, we introduce a novel\nreinforcement learning algorithm tailored for its relevance scoring mechanism,\nwhich employs two composite rewards to fully exploit the trajectories of each\ntraining sample. Our experiments show that Retro* outperforms existing document\nretrieval methods with notable advantages, leading to state-of-the-art\nperformance on the BRIGHT benchmark.",
        "url": "http://arxiv.org/abs/2509.24869v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24869v1",
        "arxiv_id": "2509.24869v1",
        "authors": [
            "Junwei Lan",
            "Jianlyu Chen",
            "Zheng Liu",
            "Chaofan Li",
            "Siqi Bao",
            "Defu Lian"
        ],
        "submitted": "2025-09-29 14:53:05",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Metaphor identification using large language models: A comparison of RAG, prompt engineering, and fine-tuning",
        "abstract": "Metaphor is a pervasive feature of discourse and a powerful lens for\nexamining cognition, emotion, and ideology. Large-scale analysis, however, has\nbeen constrained by the need for manual annotation due to the context-sensitive\nnature of metaphor. This study investigates the potential of large language\nmodels (LLMs) to automate metaphor identification in full texts. We compare\nthree methods: (i) retrieval-augmented generation (RAG), where the model is\nprovided with a codebook and instructed to annotate texts based on its rules\nand examples; (ii) prompt engineering, where we design task-specific verbal\ninstructions; and (iii) fine-tuning, where the model is trained on hand-coded\ntexts to optimize performance. Within prompt engineering, we test zero-shot,\nfew-shot, and chain-of-thought strategies. Our results show that\nstate-of-the-art closed-source LLMs can achieve high accuracy, with fine-tuning\nyielding a median F1 score of 0.79. A comparison of human and LLM outputs\nreveals that most discrepancies are systematic, reflecting well-known grey\nareas and conceptual challenges in metaphor theory. We propose that LLMs can be\nused to at least partly automate metaphor identification and can serve as a\ntestbed for developing and refining metaphor identification protocols and the\ntheory that underpins them.",
        "url": "http://arxiv.org/abs/2509.24866v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24866v1",
        "arxiv_id": "2509.24866v1",
        "authors": [
            "Matteo Fuoli",
            "Weihang Huang",
            "Jeannette Littlemore",
            "Sarah Turner",
            "Ellen Wilding"
        ],
        "submitted": "2025-09-29 14:50:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Between Help and Harm: An Evaluation of Mental Health Crisis Handling by LLMs",
        "abstract": "The widespread use of chatbots powered by large language models (LLMs) such\nas ChatGPT and Llama has fundamentally reshaped how people seek information and\nadvice across domains. Increasingly, these chatbots are being used in\nhigh-stakes contexts, including emotional support and mental health concerns.\nWhile LLMs can offer scalable support, their ability to safely detect and\nrespond to acute mental health crises remains poorly understood. Progress is\nhampered by the absence of unified crisis taxonomies, robust annotated\nbenchmarks, and empirical evaluations grounded in clinical best practices. In\nthis work, we address these gaps by introducing a unified taxonomy of six\nclinically-informed mental health crisis categories, curating a diverse\nevaluation dataset, and establishing an expert-designed protocol for assessing\nresponse appropriateness. We systematically benchmark three state-of-the-art\nLLMs for their ability to classify crisis types and generate safe, appropriate\nresponses. The results reveal that while LLMs are highly consistent and\ngenerally reliable in addressing explicit crisis disclosures, significant risks\nremain. A non-negligible proportion of responses are rated as inappropriate or\nharmful, with responses generated by an open-weight model exhibiting higher\nfailure rates than those generated by the commercial ones. We also identify\nsystemic weaknesses in handling indirect or ambiguous risk signals, a reliance\non formulaic and inauthentic default replies, and frequent misalignment with\nuser context. These findings underscore the urgent need for enhanced\nsafeguards, improved crisis detection, and context-aware interventions in LLM\ndeployments. Our taxonomy, datasets, and evaluation framework lay the\ngroundwork for ongoing research and responsible innovation in AI-driven mental\nhealth support, helping to minimize harm and better protect vulnerable users.",
        "url": "http://arxiv.org/abs/2509.24857v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24857v1",
        "arxiv_id": "2509.24857v1",
        "authors": [
            "Adrian Arnaiz-Rodriguez",
            "Miguel Baidal",
            "Erik Derner",
            "Jenn Layton Annable",
            "Mark Ball",
            "Mark Ince",
            "Elvira Perez Vallejos",
            "Nuria Oliver"
        ],
        "submitted": "2025-09-29 14:42:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Hierarchical Error Correction for Large Language Models: A Systematic Framework for Domain-Specific AI Quality Enhancement",
        "abstract": "Large Language Models face significant performance challenges in specialized\ndomains, with state-of-the-art models achieving only 45.9% accuracy on medical\ncoding tasks. This study proposes a Hierarchical Error Correction (HEC)\nframework that addresses domain-specific AI limitations through systematic\nerror analysis and targeted intervention strategies.\n  We analyze error patterns across four specialized domains and find that AI\nerrors follow consistent hierarchical structures: Knowledge-layer errors\n(58.4%), Reasoning-layer errors (39.6%), and Complexity-layer errors (2.0%).\nBased on these patterns, we develop a three-stage correction framework that\naddresses errors according to their hierarchical importance and demonstrates\nthat framework effectiveness correlates inversely with baseline task\nperformance.\n  Experimental validation across medical transcription (4,921 cases), legal\ndocument classification (1,000 cases), political bias detection (645 cases),\nand legal reasoning (1,000 cases) shows consistent improvements. Cross-model\nvalidation across five LLM architectures demonstrates average improvements of\n11.2 percentage points (p < 0.001). However, analysis reveals framework\nlimitations in high-baseline tasks (>75% accuracy), where hierarchical\nintervention may interfere with effective reasoning processes.\n  The results suggest that systematic error analysis can guide effective AI\nenhancement strategies in specialized domains, particularly for\nmoderate-baseline tasks, while highlighting the importance of understanding\nframework boundaries for optimal deployment.",
        "url": "http://arxiv.org/abs/2509.24841v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24841v1",
        "arxiv_id": "2509.24841v1",
        "authors": [
            "Zhilong Zhao",
            "Yindi Liu"
        ],
        "submitted": "2025-09-29 14:21:05",
        "source": "arxiv",
        "comment": "10 pages, 4 figures, 4 tables"
    },
    {
        "title": "Pushing LLMs to Their Logical Reasoning Bound: The Role of Data Reasoning Intensity",
        "abstract": "Recent advances in large language models (LLMs) highlight the importance of\ntraining data structure and quality in shaping reasoning behavior. However,\nmost existing approaches focus on transforming data formats while neglecting\nthe internal reasoning complexity of training samples, leaving the reasoning\npotential of data under-explored and underutilized. In this work, we posit that\nLLM logical reasoning performance is jointly constrained by the potential of\nthe training data and the cognitive capacity of the model. To make this\nrelationship measurable, we introduce Data Reasoning Intensity (DRI), a novel\nmetric that quantifies the latent logical reasoning complexity of samples by\ndecomposing and aggregating their logical structures. This allows us to analyze\nhow well current LLMs utilize logical reasoning signals and identify\nperformance gaps relative to data potential. Based on this insight, we\nintroduce a re-cognizing optimization strategy that systematically enhances the\nlogical reasoning intensity of training data. Rather than increasing data\nvolume, our method re-optimizes existing samples to better align with the LLM's\nlogical reasoning boundary. Extensive experiments show that our approach\nsignificantly improves performance and generalization over data-centric\nstrategies. We further validate our method under a reinforcement learning\nframework. Our results indicate that prioritizing reasoning complexity in data\nrather than sheer scale or superficial form is essential to realizing LLMs'\nfull cognitive potential.",
        "url": "http://arxiv.org/abs/2509.24836v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24836v2",
        "arxiv_id": "2509.24836v2",
        "authors": [
            "Zhen Bi",
            "Zhenlin Hu",
            "Jinnan Yang",
            "Mingyang Chen",
            "Cheng Deng",
            "Yida Xue",
            "Zeyu Yang",
            "Qing Shen",
            "Zhenfang Liu",
            "Kang Zhao",
            "Ningyu Zhang",
            "Jungang Lou"
        ],
        "submitted": "2025-09-29 14:20:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SemShareKV: Efficient KVCache Sharing for Semantically Similar Prompts via Token-Level LSH Matching",
        "abstract": "As large language models (LLMs) continue to scale, the memory footprint of\nkey-value (KV) caches during inference has become a significant bottleneck.\nExisting approaches primarily focus on compressing KV caches within a single\nprompt or reusing shared prefixes or frequently ocurred text segments across\nprompts. However, such strategies are limited in scenarios where prompts are\nsemantically similar but lexically different, which frequently occurs in tasks\nsuch as multi-document summarization and conversational agents. We propose\n\\textit{SemShareKV}, a KV cache sharing and compression framework that\naccelerates LLM inference by reusing KVCache in semantically similar prompts.\nInstead of relying on exact token matches, SemShareKV applies fuzzy token\nmatching using locality-sensitive hashing (LSH) on token embeddings and\nincorporates Rotary Position Embedding (RoPE) to better preserve positional\ninformation. By selectively reusing relevant key-value pairs from a reference\nprompt's cache, SemShareKV reduces redundant computation while maintaining\noutput quality. Experiments on diverse summarization datasets show up to\n6.25$\\times$ speedup and 42\\% lower GPU memory usage with 5k tokens input, with\nnegligible quality degradation. These results highlight the potential of\nsemantic-aware cache sharing for efficient LLM inference.",
        "url": "http://arxiv.org/abs/2509.24832v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24832v1",
        "arxiv_id": "2509.24832v1",
        "authors": [
            "Xinye Zhao",
            "Spyridon Mastorakis"
        ],
        "submitted": "2025-09-29 14:16:13",
        "source": "arxiv",
        "comment": "11 figures, 14pages"
    },
    {
        "title": "DiaCDM: Cognitive Diagnosis in Teacher-Student Dialogues using the Initiation-Response-Evaluation Framework",
        "abstract": "While cognitive diagnosis (CD) effectively assesses students' knowledge\nmastery from structured test data, applying it to real-world teacher-student\ndialogues presents two fundamental challenges. Traditional CD models lack a\nsuitable framework for handling dynamic, unstructured dialogues, and it's\ndifficult to accurately extract diagnostic semantics from lengthy dialogues. To\novercome these hurdles, we propose DiaCDM, an innovative model. We've adapted\nthe initiation-response-evaluation (IRE) framework from educational theory to\ndesign a diagnostic framework tailored for dialogue. We also developed a unique\ngraph-based encoding method that integrates teacher questions with relevant\nknowledge components to capture key information more precisely. To our\nknowledge, this is the first exploration of cognitive diagnosis in a dialogue\nsetting. Experiments on three real-world dialogue datasets confirm that DiaCDM\nnot only significantly improves diagnostic accuracy but also enhances the\nresults' interpretability, providing teachers with a powerful tool for\nassessing students' cognitive states. The code is available at\nhttps://github.com/Mind-Lab-ECNU/DiaCDM/tree/main.",
        "url": "http://arxiv.org/abs/2509.24821v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24821v1",
        "arxiv_id": "2509.24821v1",
        "authors": [
            "Rui Jia",
            "Yuang Wei",
            "Ruijia Li",
            "Yuang-Hao Jiang",
            "Xinyu Xie",
            "Yaomin Shen",
            "Min Zhang",
            "Bo Jiang"
        ],
        "submitted": "2025-09-29 14:09:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "KnowGuard: Knowledge-Driven Abstention for Multi-Round Clinical Reasoning",
        "abstract": "In clinical practice, physicians refrain from making decisions when patient\ninformation is insufficient. This behavior, known as abstention, is a critical\nsafety mechanism preventing potentially harmful misdiagnoses. Recent\ninvestigations have reported the application of large language models (LLMs) in\nmedical scenarios. However, existing LLMs struggle with the abstentions,\nfrequently providing overconfident responses despite incomplete information.\nThis limitation stems from conventional abstention methods relying solely on\nmodel self-assessments, which lack systematic strategies to identify knowledge\nboundaries with external medical evidences. To address this, we propose\n\\textbf{KnowGuard}, a novel \\textit{investigate-before-abstain} paradigm that\nintegrates systematic knowledge graph exploration for clinical decision-making.\nOur approach consists of two key stages operating on a shared contextualized\nevidence pool: 1) an evidence discovery stage that systematically explores the\nmedical knowledge space through graph expansion and direct retrieval, and 2) an\nevidence evaluation stage that ranks evidence using multiple factors to adapt\nexploration based on patient context and conversation history. This two-stage\napproach enables systematic knowledge graph exploration, allowing models to\ntrace structured reasoning paths and recognize insufficient medical evidence.\nWe evaluate our abstention approach using open-ended multi-round clinical\nbenchmarks that mimic realistic diagnostic scenarios, assessing abstention\nquality through accuracy-efficiency trade-offs beyond existing closed-form\nevaluations. Experimental evidences clearly demonstrate that KnowGuard\noutperforms state-of-the-art abstention approaches, improving diagnostic\naccuracy by 3.93\\% while reducing unnecessary interaction by 7.27 turns on\naverage.",
        "url": "http://arxiv.org/abs/2509.24816v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24816v1",
        "arxiv_id": "2509.24816v1",
        "authors": [
            "Xilin Dang",
            "Kexin Chen",
            "Xiaorui Su",
            "Ayush Noori",
            "Iñaki Arango",
            "Lucas Vittor",
            "Xinyi Long",
            "Yuyang Du",
            "Marinka Zitnik",
            "Pheng Ann Heng"
        ],
        "submitted": "2025-09-29 14:03:01",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Efficient Sketching and Nearest Neighbor Search Algorithms for Sparse Vector Sets",
        "abstract": "Sparse embeddings of data form an attractive class due to their inherent\ninterpretability: Every dimension is tied to a term in some vocabulary, making\nit easy to visually decipher the latent space. Sparsity, however, poses unique\nchallenges for Approximate Nearest Neighbor Search (ANNS) which finds, from a\ncollection of vectors, the k vectors closest to a query. To encourage research\non this underexplored topic, sparse ANNS featured prominently in a BigANN\nChallenge at NeurIPS 2023, where approximate algorithms were evaluated on large\nbenchmark datasets by throughput and accuracy. In this work, we introduce a set\nof novel data structures and algorithmic methods, a combination of which leads\nto an elegant, effective, and highly efficient solution to sparse ANNS. Our\ncontributions range from a theoretically-grounded sketching algorithm for\nsparse vectors to reduce their effective dimensionality while preserving inner\nproduct-induced ranks; a geometric organization of the inverted index; and the\nblending of local and global information to improve the efficiency and efficacy\nof ANNS. Empirically, our final algorithm, dubbed Seismic, reaches\nsub-millisecond per-query latency with high accuracy on a large-scale benchmark\ndataset using a single CPU.",
        "url": "http://arxiv.org/abs/2509.24815v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24815v1",
        "arxiv_id": "2509.24815v1",
        "authors": [
            "Sebastian Bruch",
            "Franco Maria Nardini",
            "Cosimo Rulli",
            "Rossano Venturini"
        ],
        "submitted": "2025-09-29 14:02:45",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Evaluating Spatiotemporal Consistency in Automatically Generated Sewing Instructions",
        "abstract": "In this paper, we propose a novel, automatic tree-based evaluation metric for\nLLM-generated step-by-step assembly instructions, that more accurately reflects\nspatiotemporal aspects of construction than traditional metrics such as BLEU\nand BERT similarity scores. We apply our proposed metric to the domain of\nsewing instructions, and show that our metric better correlates with\nmanually-annotated error counts as well as human quality ratings, demonstrating\nour metric's superiority for evaluating the spatiotemporal soundness of sewing\ninstructions. Further experiments show that our metric is more robust than\ntraditional approaches against artificially-constructed counterfactual examples\nthat are specifically constructed to confound metrics that rely on textual\nsimilarity.",
        "url": "http://arxiv.org/abs/2509.24792v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24792v1",
        "arxiv_id": "2509.24792v1",
        "authors": [
            "Luisa Geiger",
            "Mareike Hartmann",
            "Michael Sullivan",
            "Alexander Koller"
        ],
        "submitted": "2025-09-29 13:46:27",
        "source": "arxiv",
        "comment": "18 pages, 14 figures; to be published in EMNLP 2025 proceedings"
    },
    {
        "title": "SeaPO: Strategic Error Amplification for Robust Preference Optimization of Large Language Models",
        "abstract": "Existing alignment methods for preference optimization of large language\nmodels (LLMs) aim to enhance model performance by utilizing pairs of positive\nand negative samples. However, due to the limited capacity of models in scoring\nor generating responses, the quality of positive and negative samples may\nbecome similar during training, which complicates optimization for preference\nlearning. To address this issue, we introduce SeaPO, a Strategic Error\nAmplification method that leverages three error types commonly occurring in\nLLMs to introduce specific error patterns into the model Preference\nOptimization. This strategy ensures that negative samples are more erroneous\nthan positive samples and preference-based training is employed to mitigate the\noccurrence of these errors, thereby enhancing model performance. Evaluations\nacross five capability dimensions and different model scales (1.5B to 14B)\ndemonstrate that the generated data significantly improved overall model\nperformance, particularly in terms of truthfulness, with improvements of 5-10\npercentage points observed. Further analysis reveals that task performance\nvaries depending on the error types introduced. Injecting the most common error\ntypes improves performance in related tasks, while a mix of error types leads\nto a broader performance enhancement: most tasks show stable improvements,\nwhile a few tasks exhibit significant gains.",
        "url": "http://arxiv.org/abs/2509.24781v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24781v1",
        "arxiv_id": "2509.24781v1",
        "authors": [
            "Jun Rao",
            "Yunjie Liao",
            "Xuebo Liu",
            "Zepeng Lin",
            "Lian Lian",
            "Dong Jin",
            "Shengjun Cheng",
            "Jun Yu",
            "Min Zhang"
        ],
        "submitted": "2025-09-29 13:42:41",
        "source": "arxiv",
        "comment": "EMNLP 2025 Findings"
    },
    {
        "title": "VSSFlow: Unifying Video-conditioned Sound and Speech Generation via Joint Learning",
        "abstract": "Video-conditioned sound and speech generation, encompassing video-to-sound\n(V2S) and visual text-to-speech (VisualTTS) tasks, are conventionally addressed\nas separate tasks, with limited exploration to unify them within a signle\nframework. Recent attempts to unify V2S and VisualTTS face challenges in\nhandling distinct condition types (e.g., heterogeneous video and transcript\nconditions) and require complex training stages. Unifying these two tasks\nremains an open problem. To bridge this gap, we present VSSFlow, which\nseamlessly integrates both V2S and VisualTTS tasks into a unified flow-matching\nframework. VSSFlow uses a novel condition aggregation mechanism to handle\ndistinct input signals. We find that cross-attention and self-attention layer\nexhibit different inductive biases in the process of introducing condition.\nTherefore, VSSFlow leverages these inductive biases to effectively handle\ndifferent representations: cross-attention for ambiguous video conditions and\nself-attention for more deterministic speech transcripts. Furthermore, contrary\nto the prevailing belief that joint training on the two tasks requires complex\ntraining strategies and may degrade performance, we find that VSSFlow benefits\nfrom the end-to-end joint learning process for sound and speech generation\nwithout extra designs on training stages. Detailed analysis attributes it to\nthe learned general audio prior shared between tasks, which accelerates\nconvergence, enhances conditional generation, and stabilizes the\nclassifier-free guidance process. Extensive experiments demonstrate that\nVSSFlow surpasses the state-of-the-art domain-specific baselines on both V2S\nand VisualTTS benchmarks, underscoring the critical potential of unified\ngenerative models.",
        "url": "http://arxiv.org/abs/2509.24773v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24773v2",
        "arxiv_id": "2509.24773v2",
        "authors": [
            "Xin Cheng",
            "Yuyue Wang",
            "Xihua Wang",
            "Yihan Wu",
            "Kaisi Guan",
            "Yijing Chen",
            "Peng Zhang",
            "Xiaojiang Liu",
            "Meng Cao",
            "Ruihua Song"
        ],
        "submitted": "2025-09-29 13:38:24",
        "source": "arxiv",
        "comment": "Paper Under Review"
    },
    {
        "title": "LatentEvolve: Self-Evolving Test-Time Scaling in Latent Space",
        "abstract": "Test-time Scaling (TTS) has been demonstrated to significantly enhance the\nreasoning capabilities of Large Language Models (LLMs) during the inference\nphase without altering model parameters. However, existing TTS methods are\nlargely independent, implying that LLMs have not yet evolved to progressively\nlearn how to scale more effectively. With the objective of evolving LLMs to\nlearn ``how to scale test-time computation,'' we propose LatentEvolve, a\nself-evolving latent TTS framework inspired by the complementary learning\nsystem (CLS) theory. Analogous to the human brain's dual system of a\nfast-recall hippocampus and a slow-consolidating neocortex, LatentEvolve\ncomprises two evolutionary components: \\textit{daytime scaling}, which rapidly\nretrieves historical latent representations to better guide current LLM\nreasoning; and \\textit{nighttime scaling}, which integrates past latent\noptimizations in a manner akin to the human brain's consolidation of\nexperiences during sleep. The alternation of daytime and nighttime processes\nfacilitates a fast and slow evolution of LLM TTS, mirroring human cognitive\ndynamics in a fully unsupervised manner. Extensive experiments across eight\nbenchmarks and five model backbones demonstrate that our LatentEvolve surpasses\nstate-of-the-art TTS methods such as LatentSeek and TTRL by up to $13.33\\%$ and\nexhibits exceptional cross-domain and cross-backbone generalization.",
        "url": "http://arxiv.org/abs/2509.24771v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24771v1",
        "arxiv_id": "2509.24771v1",
        "authors": [
            "Guibin Zhang",
            "Fanci Meng",
            "Guancheng Wan",
            "Zherui Li",
            "Kun Wang",
            "Zhenfei Yin",
            "Lei Bai",
            "Shuicheng Yan"
        ],
        "submitted": "2025-09-29 13:37:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ProxyAttn: Guided Sparse Attention via Representative Heads",
        "abstract": "The quadratic complexity of attention mechanisms limits the efficiency of\nLarge Language Models (LLMs) on long-text tasks. Recently, methods that\ndynamically estimate block importance have enabled efficient block sparse\nattention, leading to significant acceleration in long-text pre-filling of\nLLMs. However, their coarse-grained estimation inevitably leads to performance\ndegradation at high sparsity rates. In this work, we propose ProxyAttn, a\ntraining-free sparse attention algorithm that achieves more precise block\nestimation by compressing the dimension of attention heads. Based on our\nobservation of the similarity among multiple attention heads, we use the scores\nof pooled representative heads to approximate the scores for all heads. To\naccount for the varying sparsity among heads, we also propose a block-aware\ndynamic budget estimation method. By combining the scores from representative\nproxy heads with multi-head dynamic budgets, we achieve a more fine-grained\nblock importance evaluation at low computational cost. Experiments on a variety\nof mainstream models and extensive benchmarks confirm the underlying similarity\namong attention heads. Leveraging a fine-grained estimation, the proposed\nmethod achieves substantial gains in performance and efficiency compared to\nexisting methods. More precisely, ProxyAttn can achieve up to 10.3x attention\nacceleration and 2.4x prefilling acceleration without significant performance\nloss. Our code is available at https://github.com/wyxstriker/ProxyAttn.",
        "url": "http://arxiv.org/abs/2509.24745v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24745v1",
        "arxiv_id": "2509.24745v1",
        "authors": [
            "Yixuan Wang",
            "Huang He",
            "Siqi Bao",
            "Hua Wu",
            "Haifeng Wang",
            "Qingfu Zhu",
            "Wanxiang Che"
        ],
        "submitted": "2025-09-29 13:10:39",
        "source": "arxiv",
        "comment": "14pages, 5figures"
    },
    {
        "title": "Socratic-Zero : Bootstrapping Reasoning via Data-Free Agent Co-evolution",
        "abstract": "Recent breakthroughs in large language models (LLMs) on reasoning tasks rely\nheavily on massive, high-quality datasets-typically human-annotated and thus\ndifficult to scale. While data synthesis or distillation offers a promising\nalternative, existing methods struggle with inconsistent data quality and an\ninability to dynamically adapt to the evolving capabilities of the model,\nleading to suboptimal training signals. To address these limitations, we\nintroduce Socratic-Zero, a fully autonomous framework that generates\nhigh-quality training data from minimal seed examples through the co-evolution\nof three agents: the Teacher, the Solver, and the Generator. The Solver\ncontinuously refines its reasoning by learning from preference feedback on both\nsuccessful and failed trajectories; the Teacher adaptively crafts increasingly\nchallenging questions based on the Solver's weaknesses; and the Generator\ndistills the Teacher's question-design strategy to enable scalable,\nhigh-fidelity curriculum generation. This closed-loop system produces a\nself-improving curriculum-requiring no pre-existing tasks or labels.\nRemarkably, starting from only 100 seed questions, our Socratic-Solver-8B\nachieves an average gain of +20.2 percentage points over prior data synthesis\nmethods across seven mathematical reasoning benchmarks (AMC23, AIME24-25,\nOlympiad, MATH-500, Minerva, and GSM8K), with consistent gains on both Qwen3\nand GLM4 series models. Even more surprisingly, synthetic data from\nSocratic-Generator-32B enables student LLMs to achieve superior performance\ncompared to other state-of-the-art (SOTA) commercial LLMs on these benchmarks,\nincluding Qwen3-235B-A22B, DeepSeek-V3.1-671B, GPT-5, Gemini-2.5-Pro, Grok-4,\nand Claude-4.1-Opus.",
        "url": "http://arxiv.org/abs/2509.24726v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24726v1",
        "arxiv_id": "2509.24726v1",
        "authors": [
            "Shaobo Wang",
            "Zhengbo Jiao",
            "Zifan Zhang",
            "Yilang Peng",
            "Xu Ze",
            "Boyu Yang",
            "Wei Wang",
            "Hu Wei",
            "Linfeng Zhang"
        ],
        "submitted": "2025-09-29 12:54:07",
        "source": "arxiv",
        "comment": "23 pages, 3 figures"
    },
    {
        "title": "On the Self-awareness of Large Reasoning Models' Capability Boundaries",
        "abstract": "Large Reasoning Models (LRMs) have shown impressive performance on complex\nreasoning tasks such as mathematics, yet they also display misbehaviors that\nexpose their limitations. In particular, when faced with hard questions, LRMs\noften engage in unproductive reasoning until context limit, producing wrong\nanswers while wasting substantial computation. This phenomenon reflects a\nfundamental issue: current answering paradigms overlook the relationship\nbetween questions and LRMs' capability boundaries. In this paper, we\ninvestigate whether LRMs possess self-awareness of capability boundaries. We\nbegin by an observation that LRMs may know what they cannot solve through\nexpressed reasoning confidence. For black-box models, we find that reasoning\nexpressions reveal boundary signals, with accelerated growing confidence\ntrajectory for solvable problems but convergent uncertainty trajectory for\nunsolvable ones. For white-box models, we show that hidden states of the last\ninput token encode boundary information, with solvable and unsolvable problems\nlinearly separable even before reasoning begins. Building on these findings, we\npropose two simple yet effective optimization strategies: reasoning expression\nmonitoring and hidden states monitoring. Experiments demonstrate that these\nboundary-aware strategies enable LRMs to avoid unproductive reasoning without\nsacrificing accuracy, significantly improving reliability and efficiency by\ncutting token usage up to 62.7 - 93.6%.",
        "url": "http://arxiv.org/abs/2509.24711v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24711v1",
        "arxiv_id": "2509.24711v1",
        "authors": [
            "Qingjie Zhang",
            "Yujia Fu",
            "Yang Wang",
            "Liu Yan",
            "Tao Wei",
            "Ke Xu",
            "Minlie Huang",
            "Han Qiu"
        ],
        "submitted": "2025-09-29 12:40:47",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MemGen: Weaving Generative Latent Memory for Self-Evolving Agents",
        "abstract": "Agent memory shapes how Large Language Model (LLM)-powered agents, akin to\nthe human brain, progressively refine themselves through environment\ninteractions. Existing paradigms remain constrained: parametric memory forcibly\nadjusts model parameters, and retrieval-based memory externalizes experience\ninto structured databases, yet neither captures the fluid interweaving of\nreasoning and memory that underlies human cognition. To address this gap, we\npropose MemGen, a dynamic generative memory framework that equips agents with a\nhuman-esque cognitive faculty. It consists of a \\textit{memory trigger}, which\nmonitors the agent's reasoning state to decide explicit memory invocation, and\na \\textit{memory weaver}, which takes the agent's current state as stimulus to\nconstruct a latent token sequence as machine-native memory to enrich its\nreasoning. In this way, MemGen enables agents to recall and augment latent\nmemory throughout reasoning, producing a tightly interwoven cycle of memory and\ncognition. Extensive experiments across eight benchmarks show that MemGen\nsurpasses leading external memory systems such as ExpeL and AWM by up to\n$38.22\\%$, exceeds GRPO by up to $13.44\\%$, and exhibits strong cross-domain\ngeneralization ability. More importantly, we find that without explicit\nsupervision, MemGen spontaneously evolves distinct human-like memory faculties,\nincluding planning memory, procedural memory, and working memory, suggesting an\nemergent trajectory toward more naturalistic forms of machine cognition.",
        "url": "http://arxiv.org/abs/2509.24704v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24704v1",
        "arxiv_id": "2509.24704v1",
        "authors": [
            "Guibin Zhang",
            "Muxin Fu",
            "Shuicheng Yan"
        ],
        "submitted": "2025-09-29 12:33:13",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Reference-Free Rating of LLM Responses via Latent Information",
        "abstract": "How reliable are single-response LLM-as-a-judge ratings without references,\nand can we obtain fine-grained, deterministic scores in this setting? We study\nthe common practice of asking a judge model to assign Likert-scale scores to\nfree-text responses and show two systematic issues: scores are unstable under\nsampling and poorly calibrated, leading to compression near the top of the\nscale and frequent ties. We then propose and evaluate Latent Judges, which\nderive scalar ratings from internal model signals: (i) probability-weighted\nscores over integer ratings, (ii) verifier-style probabilities of \"yes\", and\n(iii) linear probes trained on model activations at the rating position. Across\na broad suite of pairwise and single-rating benchmarks, latent methods match or\nsurpass standard prompting, with consistent gains on pairwise accuracy and\nlistwise ranking relevant to Best-of-N selection. Probability-weighted scores\nachieve the strongest single-rating correlations, while probes recover useful\nsignals when output logits are miscalibrated. These results indicate that\nlatent information provides deterministic and more discriminative signals for\nreference-free evaluation, and can improve selection and training approaches\nlike Best-of-$N$, multi-teacher distillation, and routing.",
        "url": "http://arxiv.org/abs/2509.24678v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24678v1",
        "arxiv_id": "2509.24678v1",
        "authors": [
            "Leander Girrbach",
            "Chi-Ping Su",
            "Tankred Saanum",
            "Richard Socher",
            "Eric Schulz",
            "Zeynep Akata"
        ],
        "submitted": "2025-09-29 12:15:52",
        "source": "arxiv",
        "comment": "21 pages"
    },
    {
        "title": "Understanding the Dilemma of Unlearning for Large Language Models",
        "abstract": "Unlearning seeks to remove specific knowledge from large language models\n(LLMs), but its effectiveness remains contested. On one side, \"forgotten\"\nknowledge can often be recovered through interventions such as light\nfine-tuning; on the other side, unlearning may induce catastrophic forgetting\nthat degrades general capabilities. Despite active exploration of unlearning\nmethods, interpretability analyses of the mechanism are scarce due to the\ndifficulty of tracing knowledge in LLMs' complex architectures. We address this\ngap by proposing unPact, an interpretable framework for unlearning via prompt\nattribution and contribution tracking. Typically, it quantifies each prompt\ntoken's influence on outputs, enabling pre- and post-unlearning comparisons to\nreveal what changes. Across six mainstream unlearning methods, three LLMs, and\nthree benchmarks, we find that: (1) Unlearning appears to be effective by\ndisrupting focus on keywords in prompt; (2) Much of the knowledge is not truly\nerased and can be recovered by simply emphasizing these keywords in prompts,\nwithout modifying the model's weights; (3) Catastrophic forgetting arises from\nindiscriminate penalization of all tokens. Taken together, our results suggest\nan unlearning dilemma: existing methods tend either to be insufficient -\nknowledge remains recoverable by keyword emphasis, or overly destructive -\ngeneral performance collapses due to catastrophic forgetting, still leaving a\ngap to reliable unlearning.",
        "url": "http://arxiv.org/abs/2509.24675v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24675v1",
        "arxiv_id": "2509.24675v1",
        "authors": [
            "Qingjie Zhang",
            "Haoting Qian",
            "Zhicong Huang",
            "Cheng Hong",
            "Minlie Huang",
            "Ke Xu",
            "Chao Zhang",
            "Han Qiu"
        ],
        "submitted": "2025-09-29 12:15:19",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "InfLLM-V2: Dense-Sparse Switchable Attention for Seamless Short-to-Long Adaptation",
        "abstract": "Long-sequence processing is a critical capability for modern large language\nmodels. However, the self-attention mechanism in the standard Transformer\narchitecture faces severe computational and memory bottlenecks when processing\nlong sequences. While trainable sparse attention methods offer a promising\nsolution, existing approaches such as NSA introduce excessive extra parameters\nand disrupt the conventional \\textit{pretrain-on-short, finetune-on-long}\nworkflow, resulting in slow convergence and difficulty in acceleration. To\novercome these limitations, we introduce dense-sparse switchable attention\nframework, termed as InfLLM-V2. InfLLM-V2 is a trainable sparse attention that\nseamlessly adapts models from short to long sequences. Specifically, InfLLM-V2\nreuses dense attention parameters through parameter-free architecture\nmodification, maintaining consistency between short and long sequence\nprocessing. Additionally, InfLLM-V2 ensures computational efficiency across all\nsequence lengths, by using dense attention for short inputs and smoothly\ntransitioning to sparse attention for long sequences. To achieve practical\nacceleration, we further introduce an efficient implementation of InfLLM-V2\nthat significantly reduces the computational overhead. Our experiments on\nlong-context understanding and chain-of-thought reasoning demonstrate that\nInfLLM-V2 is 4$\\times$ faster than dense attention while retaining 98.1% and\n99.7% of the performance, respectively. Based on the InfLLM-V2 framework, we\nhave trained and open-sourced MiniCPM4.1\n(https://huggingface.co/openbmb/MiniCPM4.1-8B), a hybrid reasoning model,\nproviding a reproducible implementation for the research community.",
        "url": "http://arxiv.org/abs/2509.24663v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24663v1",
        "arxiv_id": "2509.24663v1",
        "authors": [
            "Weilin Zhao",
            "Zihan Zhou",
            "Zhou Su",
            "Chaojun Xiao",
            "Yuxuan Li",
            "Yanghao Li",
            "Yudi Zhang",
            "Weilun Zhao",
            "Zhen Li",
            "Yuxiang Huang",
            "Ao Sun",
            "Xu Han",
            "Zhiyuan Liu"
        ],
        "submitted": "2025-09-29 12:08:33",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Hype or not? Formalizing Automatic Promotional Language Detection in Biomedical Research",
        "abstract": "In science, promotional language ('hype') is increasing and can undermine\nobjective evaluation of evidence, impede research development, and erode trust\nin science. In this paper, we introduce the task of automatic detection of\nhype, which we define as hyperbolic or subjective language that authors use to\nglamorize, promote, embellish, or exaggerate aspects of their research. We\npropose formalized guidelines for identifying hype language and apply them to\nannotate a portion of the National Institutes of Health (NIH) grant application\ncorpus. We then evaluate traditional text classifiers and language models on\nthis task, comparing their performance with a human baseline. Our experiments\nshow that formalizing annotation guidelines can help humans reliably annotate\ncandidate hype adjectives and that using our annotated dataset to train machine\nlearning models yields promising results. Our findings highlight the linguistic\ncomplexity of the task, and the potential need for domain knowledge and\ntemporal awareness of the facts. While some linguistic works address hype\ndetection, to the best of our knowledge, we are the first to approach it as a\nnatural language processing task.",
        "url": "http://arxiv.org/abs/2509.24638v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24638v1",
        "arxiv_id": "2509.24638v1",
        "authors": [
            "Bojan Batalo",
            "Erica K. Shimomoto",
            "Neil Millar"
        ],
        "submitted": "2025-09-29 11:47:15",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "UniDex: Rethinking Search Inverted Indexing with Unified Semantic Modeling",
        "abstract": "Inverted indexing has traditionally been a cornerstone of modern search\nsystems, leveraging exact term matches to determine relevance between queries\nand documents. However, this term-based approach often emphasizes surface-level\ntoken overlap, limiting the system's generalization capabilities and retrieval\neffectiveness. To address these challenges, we propose UniDex, a novel\nmodel-based method that employs unified semantic modeling to revolutionize\ninverted indexing. UniDex replaces complex manual designs with a streamlined\narchitecture, enhancing semantic generalization while reducing maintenance\noverhead. Our approach involves two key components: UniTouch, which maps\nqueries and documents into semantic IDs for improved retrieval, and UniRank,\nwhich employs semantic matching to rank results effectively. Through\nlarge-scale industrial datasets and real-world online traffic assessments, we\ndemonstrate that UniDex significantly improves retrieval capabilities, marking\na paradigm shift from term-based to model-based indexing. Our deployment within\nKuaishou's short-video search systems further validates UniDex's practical\neffectiveness, serving hundreds of millions of active users efficiently.",
        "url": "http://arxiv.org/abs/2509.24632v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24632v1",
        "arxiv_id": "2509.24632v1",
        "authors": [
            "Zan Li",
            "Jiahui Chen",
            "Yuan Chai",
            "Xiaoze Jiang",
            "Xiaohua Qi",
            "Zhiheng Qin",
            "Runbin Zhou",
            "Shun Zuo",
            "Guangchao Hao",
            "Kefeng Wang",
            "Jingshan Lv",
            "Yupeng Huang",
            "Xiao Liang",
            "Han Li"
        ],
        "submitted": "2025-09-29 11:41:12",
        "source": "arxiv",
        "comment": "11 pages, 6 figures and 5 tables"
    },
    {
        "title": "HiKE: Hierarchical Evaluation Framework for Korean-English Code-Switching Speech Recognition",
        "abstract": "Despite advances in multilingual automatic speech recognition (ASR),\ncode-switching (CS), the mixing of languages within an utterance common in\ndaily speech, remains a severely underexplored challenge. In this paper, we\nintroduce HiKE: the Hierarchical Korean-English code-switching benchmark, the\nfirst globally accessible evaluation framework for Korean-English CS, aiming to\nprovide a means for the precise evaluation of multilingual ASR models and to\nfoster research in the field. The proposed framework not only consists of\nhigh-quality, natural CS data across various topics, but also provides\nmeticulous loanword labels and a hierarchical CS-level labeling scheme (word,\nphrase, and sentence) that together enable a systematic evaluation of a model's\nability to handle each distinct level of code-switching. Through evaluations of\ndiverse multilingual ASR models and fine-tuning experiments, this paper\ndemonstrates that while most multilingual ASR models initially struggle with\nCS-ASR, this capability can be enabled through fine-tuning with CS data. HiKE\nwill be available at https://github.com/ThetaOne-AI/HiKE.",
        "url": "http://arxiv.org/abs/2509.24613v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24613v1",
        "arxiv_id": "2509.24613v1",
        "authors": [
            "Gio Paik",
            "Yongbeom Kim",
            "Soungmin Lee",
            "Sangmin Ahn",
            "Chanwoo Kim"
        ],
        "submitted": "2025-09-29 11:18:13",
        "source": "arxiv",
        "comment": "5 pages, 2 figures, Submitted to ICASSP2026"
    },
    {
        "title": "OrthAlign: Orthogonal Subspace Decomposition for Non-Interfering Multi-Objective Alignment",
        "abstract": "Large language model (LLM) alignment faces a critical dilemma when addressing\nmultiple human preferences: improvements in one dimension frequently come at\nthe expense of others, creating unavoidable trade-offs between competing\nobjectives like helpfulness and harmlessness. While prior work mainly focuses\non constraint-based optimization algorithms and data selection strategies to\nmitigate conflicts, these approaches overlook the fundamental issue of\nresolving conflicts directly at the parameter level. In this paper, we present\nOrthAlign, an innovative approach that pioneers a new paradigm by leveraging\northogonal subspace decomposition to fundamentally resolve gradient-level\nconflicts in multi-objective preference alignment. OrthAlign strategically\ndecomposes parameter update spaces into orthogonal subspaces, ensuring that\noptimization toward different preferences occurs in mathematically\nnon-interfering directions. Building upon this, we provide theoretical\nguarantees demonstrating that when parameter increments satisfy both orthogonal\nsubspace constraints and spectral norm bounds, the resulting updates exhibit\nlinear Lipschitz growth rather than exponential instability, ensuring stable\nconvergence across all preference dimensions. Extensive experiments show that:\nI. OrthAlign achieves maximum single-preference improvements ranging from\n34.61% to 50.89% after multiple-objective alignment across helpful, harmless,\nand truthful dimensions. II. With an average overall reward improvement of\n13.96%.",
        "url": "http://arxiv.org/abs/2509.24610v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24610v2",
        "arxiv_id": "2509.24610v2",
        "authors": [
            "Liang Lin",
            "Zhihao Xu",
            "Junhao Dong",
            "Jian Zhao",
            "Yuchen Yuan",
            "Guibin Zhang",
            "Miao Yu",
            "Yiming Zhang",
            "Zhengtao Yao",
            "Huahui Yi",
            "Dongrui Liu",
            "Xinfeng Li",
            "Kun Wang"
        ],
        "submitted": "2025-09-29 11:16:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Inducing Dyslexia in Vision Language Models",
        "abstract": "Dyslexia, a neurodevelopmental disorder characterized by persistent reading\ndifficulties, is often linked to reduced activity of the visual word form area\nin the ventral occipito-temporal cortex. Traditional approaches to studying\ndyslexia, such as behavioral and neuroimaging methods, have provided valuable\ninsights but remain limited in their ability to test causal hypotheses about\nthe underlying mechanisms of reading impairments. In this study, we use\nlarge-scale vision-language models (VLMs) to simulate dyslexia by functionally\nidentifying and perturbing artificial analogues of word processing. Using\nstimuli from cognitive neuroscience, we identify visual-word-form-selective\nunits within VLMs and demonstrate that targeted ablation of these units, unlike\nablation of random units, leads to selective impairments in reading tasks while\ngeneral visual and language comprehension abilities remain intact. In\nparticular, the resulting model matches dyslexic humans' phonological deficits\nwithout a significant change in orthographic processing. Taken together, our\nmodeling results replicate key characteristics of dyslexia and establish a\ncomputational framework for investigating reading disorders.",
        "url": "http://arxiv.org/abs/2509.24597v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24597v2",
        "arxiv_id": "2509.24597v2",
        "authors": [
            "Melika Honarmand",
            "Ayati Sharma",
            "Badr AlKhamissi",
            "Johannes Mehrer",
            "Martin Schrimpf"
        ],
        "submitted": "2025-09-29 11:03:16",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "NeMo: Needle in a Montage for Video-Language Understanding",
        "abstract": "Recent advances in video large language models (VideoLLMs) call for new\nevaluation protocols and benchmarks for complex temporal reasoning in\nvideo-language understanding. Inspired by the needle in a haystack test widely\nused by LLMs, we introduce a novel task of Needle in a Montage (NeMo), designed\nto assess VideoLLMs' critical reasoning capabilities, including long-context\nrecall and temporal grounding. To generate video question answering data for\nour task, we develop a scalable automated data generation pipeline that\nfacilitates high-quality data synthesis. Built upon the proposed pipeline, we\npresent NeMoBench, a video-language benchmark centered on our task.\nSpecifically, our full set of NeMoBench features 31,378 automatically generated\nquestion-answer (QA) pairs from 13,486 videos with various durations ranging\nfrom seconds to hours. Experiments demonstrate that our pipeline can reliably\nand automatically generate high-quality evaluation data, enabling NeMoBench to\nbe continuously updated with the latest videos. We evaluate 20 state-of-the-art\nmodels on our benchmark, providing extensive results and key insights into\ntheir capabilities and limitations. Our project page is available at:\nhttps://lavi-lab.github.io/NeMoBench.",
        "url": "http://arxiv.org/abs/2509.24563v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24563v1",
        "arxiv_id": "2509.24563v1",
        "authors": [
            "Zi-Yuan Hu",
            "Shuo Liang",
            "Duo Zheng",
            "Yanyang Li",
            "Yeyao Tao",
            "Shijia Huang",
            "Wei Feng",
            "Jia Qin",
            "Jianguang Yu",
            "Jing Huang",
            "Meng Fang",
            "Yin Li",
            "Liwei Wang"
        ],
        "submitted": "2025-09-29 10:16:05",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "AdaThink-Med: Medical Adaptive Thinking with Uncertainty-Guided Length Calibration",
        "abstract": "Recent advances in inference time scaling with extended long chain-of thought\nhave significantly improved the reasoning capabilities of both general and\nmedical large language models (LLMs). However, these models tend to engage in\nlengthy reasoning processes regardless of the difficulty of the input question,\nleading to increased inference costs in real-world applications. Therefore,\nenabling adaptive thinking where models think less for simpler questions and\nthink more for complex ones is critical for the effective use of medical LLMs\nin practice. Despite its importance, there is a lack of end-to-end approaches\ndesigned to enhance the adaptive thinking capabilities of medical LLMs while\nproviding a comprehensive examination of the trade-off between performance and\ncomputational cost. To bridge this gap, we propose AdaThink-Med, the first\nend-to-end framework designed to enhance adaptive thinking ability in medical\nreasoning models with uncertainty-guided length calibration. AdaThink-Med first\ngenerates multiple candidate outputs for each question, evaluates the\ncorrectness and uncertainty of each candidate, and then estimates problem\ndifficulty via an uncertainty-guided length calibration module. For outputs\nwith low difficulty and correct answers, the framework penalizes longer\nreasoning paths; whereas for those with high difficulty and incorrect answers,\nit encourages extending the chain of thought to explore alternative solutions.\nOn six public medical QA benchmarks, AdaThink-Med achieves up to 6.4x length\nreduction on average while retaining performance with only minimal degradation.\nIntriguingly, we observe that AdaThink-Med spontaneously develops two distinct\nreasoning modes, which we characterize as \"non-thinking\" and \"thinking\",\ndemonstrating the model's ability to suppress redundant reasoning processes\ndynamically.",
        "url": "http://arxiv.org/abs/2509.24560v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24560v1",
        "arxiv_id": "2509.24560v1",
        "authors": [
            "Shaohao Rui",
            "Kaitao Chen",
            "Weijie Ma",
            "Xiaosong Wang"
        ],
        "submitted": "2025-09-29 10:13:55",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LEAF: A Robust Expert-Based Framework for Few-Shot Continual Event Detection",
        "abstract": "Few-shot Continual Event Detection (FCED) poses the dual challenges of\nlearning from limited data and mitigating catastrophic forgetting across\nsequential tasks. Existing approaches often suffer from severe forgetting due\nto the full fine-tuning of a shared base model, which leads to knowledge\ninterference between tasks. Moreover, they frequently rely on data augmentation\nstrategies that can introduce unnatural or semantically distorted inputs. To\naddress these limitations, we propose LEAF, a novel and robust expert-based\nframework for FCED. LEAF integrates a specialized mixture of experts\narchitecture into the base model, where each expert is parameterized with\nlow-rank adaptation (LoRA) matrices. A semantic-aware expert selection\nmechanism dynamically routes instances to the most relevant experts, enabling\nexpert specialization and reducing knowledge interference. To improve\ngeneralization in limited-data settings, LEAF incorporates a contrastive\nlearning objective guided by label descriptions, which capture high-level\nsemantic information about event types. Furthermore, to prevent overfitting on\nthe memory buffer, our framework employs a knowledge distillation strategy that\ntransfers knowledge from previous models to the current one. Extensive\nexperiments on multiple FCED benchmarks demonstrate that LEAF consistently\nachieves state-of-the-art performance.",
        "url": "http://arxiv.org/abs/2509.24547v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24547v1",
        "arxiv_id": "2509.24547v1",
        "authors": [
            "Bao-Ngoc Dao",
            "Quang Nguyen",
            "Luyen Ngo Dinh",
            "Minh Le",
            "Linh Ngo Van"
        ],
        "submitted": "2025-09-29 10:00:25",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Experience-Guided Reflective Co-Evolution of Prompts and Heuristics for Automatic Algorithm Design",
        "abstract": "Combinatorial optimization problems are traditionally tackled with\nhandcrafted heuristic algorithms, which demand extensive domain expertise and\nsignificant implementation effort. Recent progress has highlighted the\npotential of automatic heuristics design powered by large language models\n(LLMs), enabling the automatic generation and refinement of heuristics. These\napproaches typically maintain a population of heuristics and employ LLMs as\nmutation operators to evolve them across generations. While effective, such\nmethods often risk stagnating in local optima. To address this issue, we\npropose the Experience-Guided Reflective Co-Evolution of Prompt and Heuristics\n(EvoPH) for automatic algorithm design, a novel framework that integrates the\nisland migration model with the elites selection algorithm to simulate diverse\nheuristics populations. In EvoPH, prompts are co-evolved with heuristic\nalgorithms, guided by performance feedback. We evaluate our framework on two\nproblems, i.e., Traveling Salesman Problem and Bin Packing Problem.\nExperimental results demonstrate that EvoPH achieves the lowest relative error\nagainst optimal solutions across both datasets, advancing the field of\nautomatic algorithm design with LLMs.",
        "url": "http://arxiv.org/abs/2509.24509v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24509v2",
        "arxiv_id": "2509.24509v2",
        "authors": [
            "Yihong Liu",
            "Junyi Li",
            "Wayne Xin Zhao",
            "Hongyu Lu",
            "Ji-Rong Wen"
        ],
        "submitted": "2025-09-29 09:24:09",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Building Benchmarks from the Ground Up: Community-Centered Evaluation of LLMs in Healthcare Chatbot Settings",
        "abstract": "Large Language Models (LLMs) are typically evaluated through general or\ndomain-specific benchmarks testing capabilities that often lack grounding in\nthe lived realities of end users. Critical domains such as healthcare require\nevaluations that extend beyond artificial or simulated tasks to reflect the\neveryday needs, cultural practices, and nuanced contexts of communities. We\npropose Samiksha, a community-driven evaluation pipeline co-created with\ncivil-society organizations (CSOs) and community members. Our approach enables\nscalable, automated benchmarking through a culturally aware, community-driven\npipeline in which community feedback informs what to evaluate, how the\nbenchmark is built, and how outputs are scored. We demonstrate this approach in\nthe health domain in India. Our analysis highlights how current multilingual\nLLMs address nuanced community health queries, while also offering a scalable\npathway for contextually grounded and inclusive LLM evaluation.",
        "url": "http://arxiv.org/abs/2509.24506v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24506v1",
        "arxiv_id": "2509.24506v1",
        "authors": [
            "Hamna",
            "Gayatri Bhat",
            "Sourabrata Mukherjee",
            "Faisal Lalani",
            "Evan Hadfield",
            "Divya Siddarth",
            "Kalika Bali",
            "Sunayana Sitaram"
        ],
        "submitted": "2025-09-29 09:20:15",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Knowledge Editing with Subspace-Aware Key-Value Mappings",
        "abstract": "Knowledge editing aims to efficiently correct factual errors in Language\nModels (LMs). The popular locate-then-edit approach modifies an MLP layer by\nfinding an optimal mapping between its input vector (key) and output vector\n(value) that leads to the expression of the edited knowledge. However, existing\nmethods without any constraints on the key and value vectors cause significant\nperturbations to the edited model. To address this, we propose Subspace\nKnowledge Edit (SUIT), a method that identifies and modifies only the subspace\nof critical features relevant to the edit. Our empirical results on LLaMA-3-8B,\nGPT-J-6B, and Qwen2.5-7B models show that SUIT dramatically improves knowledge\npreservation over strong baselines while maintaining high edit efficacy. This\neffectiveness confirms that SUIT successfully identifies the critical subspace\nfor the edit. Further analyses provide additional validation for our approach.\nThe source code and data will be released to the public upon publication of the\npaper.",
        "url": "http://arxiv.org/abs/2509.24502v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24502v1",
        "arxiv_id": "2509.24502v1",
        "authors": [
            "Haewon Park",
            "Sangwoo Kim",
            "Yohan Jo"
        ],
        "submitted": "2025-09-29 09:17:42",
        "source": "arxiv",
        "comment": "25 pages, 12 figures, 10 tables"
    },
    {
        "title": "GRPO-MA: Multi-Answer Generation in GRPO for Stable and Efficient Chain-of-Thought Training",
        "abstract": "Recent progress, such as DeepSeek-R1, has shown that the GRPO algorithm, a\nReinforcement Learning (RL) approach, can effectively train Chain-of-Thought\n(CoT) reasoning in Large Language Models (LLMs) and Vision-Language Models\n(VLMs). In this paper, we analyze three challenges of GRPO: gradient coupling\nbetween thoughts and answers, sparse reward signals caused by limited parallel\nsampling, and unstable advantage estimation. To mitigate these challenges, we\npropose GRPO-MA, a simple yet theoretically grounded method that leverages\nmulti-answer generation from each thought process, enabling more robust and\nefficient optimization. Theoretically, we show that the variance of thought\nadvantage decreases as the number of answers per thought increases.\nEmpirically, our gradient analysis confirms this effect, showing that GRPO-MA\nreduces gradient spikes compared to GRPO. Experiments on math, code, and\ndiverse multimodal tasks demonstrate that GRPO-MA substantially improves\nperformance and training efficiency. Our ablation studies further reveal that\nincreasing the number of answers per thought consistently enhances model\nperformance.",
        "url": "http://arxiv.org/abs/2509.24494v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24494v1",
        "arxiv_id": "2509.24494v1",
        "authors": [
            "Hongcheng Wang",
            "Yinuo Huang",
            "Sukai Wang",
            "Guanghui Ren",
            "Hao Dong"
        ],
        "submitted": "2025-09-29 09:07:45",
        "source": "arxiv",
        "comment": "Under review"
    },
    {
        "title": "Sanitize Your Responses: Mitigating Privacy Leakage in Large Language Models",
        "abstract": "As Large Language Models (LLMs) achieve remarkable success across a wide\nrange of applications, such as chatbots and code copilots, concerns surrounding\nthe generation of harmful content have come increasingly into focus. Despite\nsignificant advances in aligning LLMs with safety and ethical standards,\nadversarial prompts can still be crafted to elicit undesirable responses.\nExisting mitigation strategies are predominantly based on post-hoc filtering,\nwhich introduces substantial latency or computational overhead, and is\nincompatible with token-level streaming generation. In this work, we introduce\nSelf-Sanitize, a novel LLM-driven mitigation framework inspired by cognitive\npsychology, which emulates human self-monitor and self-repair behaviors during\nconversations. Self-Sanitize comprises a lightweight Self-Monitor module that\ncontinuously inspects high-level intentions within the LLM at the token level\nvia representation engineering, and a Self-Repair module that performs in-place\ncorrection of harmful content without initiating separate review dialogues.\nThis design allows for real-time streaming monitoring and seamless repair, with\nnegligible impact on latency and resource utilization. Given that\nprivacy-invasive content has often been insufficiently focused in previous\nstudies, we perform extensive experiments on four LLMs across three privacy\nleakage scenarios. The results demonstrate that Self-Sanitize achieves superior\nmitigation performance with minimal overhead and without degrading the utility\nof LLMs, offering a practical and robust solution for safer LLM deployments.\nOur code is available at the following link:\nhttps://github.com/wjfu99/LLM_Self_Sanitize",
        "url": "http://arxiv.org/abs/2509.24488v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24488v1",
        "arxiv_id": "2509.24488v1",
        "authors": [
            "Wenjie Fu",
            "Huandong Wang",
            "Junyao Gao",
            "Guoan Wan",
            "Tao Jiang"
        ],
        "submitted": "2025-09-29 08:59:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "A Text-To-Text Alignment Algorithm for Better Evaluation of Modern Speech Recognition Systems",
        "abstract": "Modern neural networks have greatly improved performance across speech\nrecognition benchmarks. However, gains are often driven by frequent words with\nlimited semantic weight, which can obscure meaningful differences in word error\nrate, the primary evaluation metric. Errors in rare terms, named entities, and\ndomain-specific vocabulary are more consequential, but remain hidden by\naggregate metrics. This highlights the need for finer-grained error analysis,\nwhich depends on accurate alignment between reference and model transcripts.\nHowever, conventional alignment methods are not designed for such precision. We\npropose a novel alignment algorithm that couples dynamic programming with beam\nsearch scoring. Compared to traditional text alignment methods, our approach\nprovides more accurate alignment of individual errors, enabling reliable error\nanalysis. The algorithm is made available via PyPI.",
        "url": "http://arxiv.org/abs/2509.24478v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24478v1",
        "arxiv_id": "2509.24478v1",
        "authors": [
            "Lasse Borgholt",
            "Jakob Havtorn",
            "Christian Igel",
            "Lars Maaløe",
            "Zheng-Hua Tan"
        ],
        "submitted": "2025-09-29 08:53:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Euclid's Gift: Enhancing Spatial Perception and Reasoning in Vision-Language Models via Geometric Surrogate Tasks",
        "abstract": "Spatial intelligence spans a rich suite of abilities, including visualising\nand transforming shapes, mentally rotating objects, judging relational\npositions and containment, and estimating numerosity. However, it still remains\na critical unresolved challenge for Multimodal Large Language Models (MLLMs).To\nfill this gap, we propose to treat Euclidean geometry problem-solving as a\nsurrogate task. Specifically, we meticulously constructed a curated multimodal\ndataset, called Euclid30K, comprising approximately 30K plane and solid\ngeometry problems. To enable the model to acquire and apply Euclidean\nprinciples from these geometry problems, we employed Group Relative Policy\nOptimization (GRPO) to finetune the Qwen2.5VL family and RoboBrain2.0 family,\ninspiring the models to identify shapes, count, and relate entities, and\nperform multi-step deductive reasoning using Euclidean principles. Our\nexperiments demonstrate that the resulting models achieve substantial zero-shot\ngains across four spatial reasoning benchmarks (Super-CLEVR, Omni3DBench,\nVSI-Bench, and MindCube) without any task-specific adaptations. Notably, after\ntraining on the Euclid30K, the mean VSI-Bench accuracy of all evaluated models\nrose from 34.5% to 40.5%, improving by 5.5 percentage points. Among them,\nRoboBrain2.0-Euclid-7B achieves 49.6\\% accuracy, surpassing the previous\nstate-of-the-art model, Spatial-MLLM.To our knowledge, this is the first\nsystematic study showing that geometry-centric fine-tuning can confer\nvision-language models with broadly transferable spatial skills. Code and\nEuclid30K dataset can be found in https://zgca-ai4edu.github.io/Euclids_Gift.",
        "url": "http://arxiv.org/abs/2509.24473v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24473v1",
        "arxiv_id": "2509.24473v1",
        "authors": [
            "Shijie Lian",
            "Changti Wu",
            "Laurence Tianruo Yang",
            "Hang Yuan",
            "Bin Yu",
            "Lei Zhang",
            "Kai Chen"
        ],
        "submitted": "2025-09-29 08:49:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Bias Mitigation or Cultural Commonsense? Evaluating LLMs with a Japanese Dataset",
        "abstract": "Large language models (LLMs) exhibit social biases, prompting the development\nof various debiasing methods. However, debiasing methods may degrade the\ncapabilities of LLMs. Previous research has evaluated the impact of bias\nmitigation primarily through tasks measuring general language understanding,\nwhich are often unrelated to social biases. In contrast, cultural commonsense\nis closely related to social biases, as both are rooted in social norms and\nvalues. The impact of bias mitigation on cultural commonsense in LLMs has not\nbeen well investigated. Considering this gap, we propose SOBACO (SOcial BiAs\nand Cultural cOmmonsense benchmark), a Japanese benchmark designed to evaluate\nsocial biases and cultural commonsense in LLMs in a unified format. We evaluate\nseveral LLMs on SOBACO to examine how debiasing methods affect cultural\ncommonsense in LLMs. Our results reveal that the debiasing methods degrade the\nperformance of the LLMs on the cultural commonsense task (up to 75% accuracy\ndeterioration). These results highlight the importance of developing debiasing\nmethods that consider the trade-off with cultural commonsense to improve\nfairness and utility of LLMs.",
        "url": "http://arxiv.org/abs/2509.24468v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24468v1",
        "arxiv_id": "2509.24468v1",
        "authors": [
            "Taisei Yamamoto",
            "Ryoma Kumon",
            "Danushka Bollegala",
            "Hitomi Yanaka"
        ],
        "submitted": "2025-09-29 08:45:50",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025 main"
    },
    {
        "title": "Beyond Isolated Facts: Synthesizing Narrative and Grounded Supervision for VideoQA",
        "abstract": "The performance of Video Question Answering (VideoQA) models is fundamentally\nconstrained by the nature of their supervision, which typically consists of\nisolated, factual question-answer pairs. This \"bag-of-facts\" approach fails to\ncapture the underlying narrative and causal structure of events, limiting\nmodels to a shallow understanding of video content. To move beyond this\nparadigm, we introduce a framework to synthesize richer supervisory signals. We\npropose two complementary strategies: Question-Based Paraphrasing (QBP), which\nsynthesizes the diverse inquiries (what, how, why) from a video's existing set\nof question-answer pairs into a holistic narrative paragraph that reconstructs\nthe video's event structure; and Question-Based Captioning (QBC), which\ngenerates fine-grained visual rationales, grounding the answer to each question\nin specific, relevant evidence. Leveraging powerful generative models, we use\nthis synthetic data to train VideoQA models under a unified next-token\nprediction objective. Extensive experiments on STAR and NExT-QA validate our\napproach, demonstrating significant accuracy gains and establishing new\nstate-of-the-art results, such as improving a 3B model to 72.5\\% on STAR\n(+4.9\\%) and a 7B model to 80.8\\% on NExT-QA. Beyond accuracy, our analysis\nreveals that both QBP and QBC substantially enhance cross-dataset\ngeneralization, with QBP additionally accelerating model convergence by over\n2.5x. These results demonstrate that shifting data synthesis from isolated\nfacts to narrative coherence and grounded rationales yields a more accurate,\nefficient, and generalizable training paradigm.",
        "url": "http://arxiv.org/abs/2509.24445v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24445v1",
        "arxiv_id": "2509.24445v1",
        "authors": [
            "Jianxin Liang",
            "Tan Yue",
            "Yuxuan Wang",
            "Yueqian Wang",
            "Zhihan Yin",
            "Huishuai Zhang",
            "Dongyan Zhao"
        ],
        "submitted": "2025-09-29 08:28:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Alternatives To Next Token Prediction In Text Generation -- A Survey",
        "abstract": "The paradigm of Next Token Prediction (NTP) has driven the unprecedented\nsuccess of Large Language Models (LLMs), but is also the source of their most\npersistent weaknesses such as poor long-term planning, error accumulation, and\ncomputational inefficiency. Acknowledging the growing interest in exploring\nalternatives to NTP, the survey describes the emerging ecosystem of\nalternatives to NTP. We categorise these approaches into five main families:\n(1) Multi-Token Prediction, which targets a block of future tokens instead of a\nsingle one; (2) Plan-then-Generate, where a global, high-level plan is created\nupfront to guide token-level decoding; (3) Latent Reasoning, which shifts the\nautoregressive process itself into a continuous latent space; (4) Continuous\nGeneration Approaches, which replace sequential generation with iterative,\nparallel refinement through diffusion, flow matching, or energy-based methods;\nand (5) Non-Transformer Architectures, which sidestep NTP through their\ninherent model structure. By synthesizing insights across these methods, this\nsurvey offers a taxonomy to guide research into models that address the known\nlimitations of token-level generation to develop new transformative models for\nnatural language processing.",
        "url": "http://arxiv.org/abs/2509.24435v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24435v1",
        "arxiv_id": "2509.24435v1",
        "authors": [
            "Charlie Wyatt",
            "Aditya Joshi",
            "Flora Salim"
        ],
        "submitted": "2025-09-29 08:18:16",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Multi-Item-Query Attention for Stable Sequential Recommendation",
        "abstract": "The inherent instability and noise in user interaction data challenge\nsequential recommendation systems. Prevailing masked attention models, relying\non a single query from the most recent item, are sensitive to this noise,\nreducing prediction reliability. We propose the Multi-Item-Query attention\nmechanism (MIQ-Attn) to enhance model stability and accuracy. MIQ-Attn\nconstructs multiple diverse query vectors from user interactions, effectively\nmitigating noise and improving consistency. It is designed for easy adoption as\na drop-in replacement for existing single-query attention. Experiments show\nMIQ-Attn significantly improves performance on benchmark datasets.",
        "url": "http://arxiv.org/abs/2509.24424v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24424v1",
        "arxiv_id": "2509.24424v1",
        "authors": [
            "Mingshi Xu",
            "Haoren Zhu",
            "Wilfred Siu Hung Ng"
        ],
        "submitted": "2025-09-29 08:11:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CDT: A Comprehensive Capability Framework for Large Language Models Across Cognition, Domain, and Task",
        "abstract": "Recent advances in Large Language Models (LLMs) have significantly enhanced\ntheir capabilities, highlighting the need for comprehensive evaluation\nframeworks that extend beyond task-specific benchmarks. However, existing\nbenchmarks often focus on isolated abilities, lacking a holistic framework for\nassessing LLM capabilities. To address this gap, we propose the\nCognition-Domain-Task (CDT) framework, which comprehensively measures a model's\ncapabilities across three dimensions. We expand the scope of model capability\ndefinitions at the cognitive level by incorporating the Cattell-Horn-Carroll\ncognitive theory, refining the categorization of model capabilities. We apply\nCDT in two directions: dataset capability evaluation and data selection.\nExperiments show that our capability metrics correlate well with downstream\nperformance and can support effective dataset analysis and construction. The\nexperiments on data selection also show significant improvements in both\ngeneral and specific benchmarks, achieving scores of 44.3 and 45.4, with an\nincrease of 1.6 and 2.2 points over the baselines, respectively. These results\nvalidate the effectiveness and practicality of CDT. Source code and models are\navailable at https://github.com/Alessa-mo/CDT.",
        "url": "http://arxiv.org/abs/2509.24422v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24422v1",
        "arxiv_id": "2509.24422v1",
        "authors": [
            "Haosi Mo",
            "Xinyu Ma",
            "Xuebo Liu",
            "Derek F. Wong",
            "Yu Li",
            "Jie Liu",
            "Min Zhang"
        ],
        "submitted": "2025-09-29 08:10:29",
        "source": "arxiv",
        "comment": "20 pages, 5 figures, EMNLP2025 Findings"
    },
    {
        "title": "Multilingual Text-to-SQL: Benchmarking the Limits of Language Models with Collaborative Language Agents",
        "abstract": "Text-to-SQL enables natural access to databases, yet most benchmarks are\nEnglish-only, limiting multilingual progress. We introduce MultiSpider 2.0,\nextending Spider 2.0 to eight languages (English, German, French, Spanish,\nPortuguese, Japanese, Chinese, Vietnamese). It preserves Spider 2.0's\nstructural difficulty while adding linguistic and dialectal variability,\ndemanding deeper reasoning for complex SQL. On this benchmark, state-of-the-art\nLLMs (such as DeepSeek-R1 and OpenAI o1) reach only 4\\% execution accuracy when\nrelying on intrinsic reasoning, versus 60\\% on MultiSpider 1.0. Therefore, we\nprovide a collaboration-driven language agents baseline that iteratively\nrefines queries, improving accuracy to 15\\%. These results reveal a substantial\nmultilingual gap and motivate methods that are robust across languages and\nready for real-world enterprise deployment. Our benchmark is available at\nhttps://github.com/phkhanhtrinh23/Multilingual_Text_to_SQL.",
        "url": "http://arxiv.org/abs/2509.24405v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24405v1",
        "arxiv_id": "2509.24405v1",
        "authors": [
            "Khanh Trinh Pham",
            "Thu Huong Nguyen",
            "Jun Jo",
            "Quoc Viet Hung Nguyen",
            "Thanh Tam Nguyen"
        ],
        "submitted": "2025-09-29 07:50:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Agentar-Scale-SQL: Advancing Text-to-SQL through Orchestrated Test-Time Scaling",
        "abstract": "State-of-the-art (SOTA) Text-to-SQL methods still lag significantly behind\nhuman experts on challenging benchmarks like BIRD. Current approaches that\nexplore test-time scaling lack an orchestrated strategy and neglect the model's\ninternal reasoning process. To bridge this gap, we introduce Agentar-Scale-SQL,\na novel framework leveraging scalable computation to improve performance.\nAgentar-Scale-SQL implements an Orchestrated Test-Time Scaling strategy that\nsynergistically combines three distinct perspectives: i) Internal Scaling via\nRL-enhanced Intrinsic Reasoning, ii) Sequential Scaling through Iterative\nRefinement, and iii) Parallel Scaling using Diverse Synthesis and Tournament\nSelection. Agentar-Scale-SQL is a general-purpose framework designed for easy\nadaptation to new databases and more powerful language models. Extensive\nexperiments show that Agentar-Scale-SQL achieves SOTA performance on the BIRD\nbenchmark, reaching 81.67\\% execution accuracy on the test set and ranking\nfirst on the official leaderboard, demonstrating an effective path toward\nhuman-level performance.",
        "url": "http://arxiv.org/abs/2509.24403v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24403v2",
        "arxiv_id": "2509.24403v2",
        "authors": [
            "Pengfei Wang",
            "Baolin Sun",
            "Xuemei Dong",
            "Yaxun Dai",
            "Hongwei Yuan",
            "Mengdie Chu",
            "Yingqi Gao",
            "Xiang Qi",
            "Peng Zhang",
            "Ying Yan"
        ],
        "submitted": "2025-09-29 07:50:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Towards Safe Reasoning in Large Reasoning Models via Corrective Intervention",
        "abstract": "Although Large Reasoning Models (LRMs) have progressed in solving complex\nproblems, their chain-of-thought (CoT) reasoning often contains harmful content\nthat can persist even when the final responses appear safe. We show that this\nissue still remains in existing methods which overlook the unique significance\nof safe reasoning, undermining their trustworthiness and posing potential risks\nin applications if unsafe reasoning is accessible for and exploited by\nmalicious users. We therefore shift our focus to aligning the safety of\nreasoning itself in this paper and explore process supervision as the solution.\nHowever, simply rewarding safe reasoning proves inadequate due to low rollout\ndiversity and limited training signals. To tackle this challenge, we first\ndelve into the characteristics of safe reasoning and uncover several critical\ninsights that 1) safe reasoning is often consolidated by a few critical steps\nof safety triggers; 2) compliance cues strongly correlate with unsafe\ncontinuations; and 3) corrective interventions reliably steer unsafe\ntrajectories towards safer traces. Motivated by these, we propose Intervened\nPreference Optimization (IPO), an alignment method that enforces safe reasoning\nby substituting compliance steps with safety triggers and constructing pairs\nfor preference learning with strong signals. Experiments on jailbreak and\nadversarial safety benchmarks demonstrate that IPO remarkably improves overall\nsafety regarding both reasoning and responses, outperforming SFT-based and\nRL-based baselines with a relative reduction of over 30% in harmfulness, while\npreserving excellent performance across diverse reasoning tasks. The results\nhighlight the importance of explicit alignment for reasoning and provide a\npractical path to safer LRMs.",
        "url": "http://arxiv.org/abs/2509.24393v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24393v1",
        "arxiv_id": "2509.24393v1",
        "authors": [
            "Yichi Zhang",
            "Yue Ding",
            "Jingwen Yang",
            "Tianwei Luo",
            "Dongbai Li",
            "Ranjie Duan",
            "Qiang Liu",
            "Hang Su",
            "Yinpeng Dong",
            "Jun Zhu"
        ],
        "submitted": "2025-09-29 07:41:09",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LLaDA-MoE: A Sparse MoE Diffusion Language Model",
        "abstract": "We introduce LLaDA-MoE, a large language diffusion model with the\nMixture-of-Experts (MoE) architecture, trained from scratch on approximately\n20T tokens. LLaDA-MoE achieves competitive performance with significantly\nreduced computational overhead by maintaining a 7B-parameter capacity while\nactivating only 1.4B parameters during inference. Our empirical evaluation\nreveals that LLaDA-MoE achieves state-of-the-art performance among diffusion\nlanguage models with larger parameters, surpassing previous diffusion language\nmodels LLaDA, LLaDA 1.5, and Dream across multiple benchmarks. The\ninstruct-tuned model LLaDA-MoE-7B-A1B-Instruct demonstrates capabilities\ncomparable to Qwen2.5-3B-Instruct in knowledge understanding, code generation,\nmathematical reasoning, agent and alignment tasks, despite using fewer active\nparameters. Our results show that integrating a sparse MoE architecture into\nthe training objective of masked diffusion language models still brings out\nMoE's strengths under efficient inference with few active parameters, and opens\nample room for further exploration of diffusion language models. LLaDA-MoE\nmodels are available at Huggingface.",
        "url": "http://arxiv.org/abs/2509.24389v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24389v1",
        "arxiv_id": "2509.24389v1",
        "authors": [
            "Fengqi Zhu",
            "Zebin You",
            "Yipeng Xing",
            "Zenan Huang",
            "Lin Liu",
            "Yihong Zhuang",
            "Guoshan Lu",
            "Kangyu Wang",
            "Xudong Wang",
            "Lanning Wei",
            "Hongrui Guo",
            "Jiaqi Hu",
            "Wentao Ye",
            "Tieyuan Chen",
            "Chenchen Li",
            "Chengfu Tang",
            "Haibo Feng",
            "Jun Hu",
            "Jun Zhou",
            "Xiaolu Zhang",
            "Zhenzhong Lan",
            "Junbo Zhao",
            "Da Zheng",
            "Chongxuan Li",
            "Jianguo Li",
            "Ji-Rong Wen"
        ],
        "submitted": "2025-09-29 07:38:59",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "HarmMetric Eval: Benchmarking Metrics and Judges for LLM Harmfulness Assessment",
        "abstract": "The alignment of large language models (LLMs) with human values is critical\nfor their safe deployment, yet jailbreak attacks can subvert this alignment to\nelicit harmful outputs from LLMs. In recent years, a proliferation of jailbreak\nattacks has emerged, accompanied by diverse metrics and judges to assess the\nharmfulness of the LLM outputs. However, the absence of a systematic benchmark\nto assess the quality and effectiveness of these metrics and judges undermines\nthe credibility of the reported jailbreak effectiveness and other risks. To\naddress this gap, we introduce HarmMetric Eval, a comprehensive benchmark\ndesigned to support both overall and fine-grained evaluation of harmfulness\nmetrics and judges. Our benchmark includes a high-quality dataset of\nrepresentative harmful prompts paired with diverse harmful and non-harmful\nmodel responses, alongside a flexible scoring mechanism compatible with various\nmetrics and judges. With HarmMetric Eval, our extensive experiments uncover a\nsurprising result: two conventional metrics--METEOR and ROUGE-1--outperform\nLLM-based judges in evaluating the harmfulness of model responses, challenging\nprevailing beliefs about LLMs' superiority in this domain. Our dataset is\npublicly available at https://huggingface.co/datasets/qusgo/HarmMetric_Eval,\nand the code is available at\nhttps://anonymous.4open.science/r/HarmMetric-Eval-4CBE.",
        "url": "http://arxiv.org/abs/2509.24384v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24384v1",
        "arxiv_id": "2509.24384v1",
        "authors": [
            "Langqi Yang",
            "Tianhang Zheng",
            "Kedong Xiu",
            "Yixuan Chen",
            "Di Wang",
            "Puning Zhao",
            "Zhan Qin",
            "Kui Ren"
        ],
        "submitted": "2025-09-29 07:34:01",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Reinforcement Mid-Training",
        "abstract": "The development of state-of-the-art large language models is commonly\nunderstood as a two-stage process involving pre-training and post-training. We\npoint out the need for an additional intermediate stage called reinforcement\nmid-training with potential for strong performance gains. In this paper, we\nformally define the problem and identify three key challenges: (1) inefficient\ntraining due to excessive reasoning steps, (2) disregard of the imbalanced\ntoken entropy distribution, and (3) underutilization of token information. To\naddress these challenges, we propose RMT, a framework for efficient, adaptive,\nand unified reinforcement mid-training with various innovative components. In\nparticular, we first introduce a dynamic token budget mechanism that constrains\nunnecessary reasoning steps and mitigates model overthinking. Next, we design a\ncurriculum-based adaptive sampling method that fosters a progressive learning\ntrajectory from easy to hard tokens. Finally, we present a dual training\nstrategy that combines reinforcement learning with next-token prediction,\nensuring targeted learning on key tokens and full exploitation of all token\ninformation. Extensive experiments demonstrate the superiority of RMT over\nstate-of-the-art methods, achieving up to +64.91% performance improvement with\nonly 21% of the reasoning length in language modeling. We also show that\ncheckpoints obtained after reinforcement mid-training can benefit the\nsubsequent post-training, yielding up to +18.76% improvement in the\nmathematical domain.",
        "url": "http://arxiv.org/abs/2509.24375v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24375v1",
        "arxiv_id": "2509.24375v1",
        "authors": [
            "Yijun Tian",
            "Shaoyu Chen",
            "Zhichao Xu",
            "Yawei Wang",
            "Jinhe Bi",
            "Peng Han",
            "Wei Wang"
        ],
        "submitted": "2025-09-29 07:21:24",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Beyond Repetition: Text Simplification and Curriculum Learning for Data-Constrained Pretraining",
        "abstract": "Most studies on language model pretraining focus on large datasets, leaving\nopen questions about optimization in data-constrained settings. In such\nsettings, the effects of training data order and of including alternative\nversions of the same text remain underexplored. We address this by studying\ncurriculum learning in pretraining, focusing on text-complexity ordering and\ndata augmentation via simplification. We ask: (1) Does simplifying texts\nenhance representation quality more than reusing the original data? and (2)\nDoes ordering data by text complexity yield better representations? To answer,\nwe build on a pair of parallel corpora where human-written paragraphs are\naligned with LLM-simplified variants, and test four data schedules: repeated\nexposure, low-to-high complexity, high-to-low, and interleaved. We analyze\nmodels' representation quality from a sample efficiency perspective via\nfine-tuning, as well as its zero-shot performance on linguistic knowledge,\nentity tracking, world knowledge, and commonsense reasoning. Our findings show\nthat adding simplified data improves fine-tuning and zero-shot performance over\na repeated-exposure baseline: smaller models benefit from low-to-high\ncomplexity, while larger models perform better with interleaved ordering.",
        "url": "http://arxiv.org/abs/2509.24356v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24356v1",
        "arxiv_id": "2509.24356v1",
        "authors": [
            "Matthew Theodore Roque",
            "Dan John Velasco"
        ],
        "submitted": "2025-09-29 06:54:59",
        "source": "arxiv",
        "comment": "To be published in BabyLM Workshop at EMNLP 2025"
    },
    {
        "title": "AlignX: Advancing Multilingual Large Language Models with Multilingual Representation Alignment",
        "abstract": "Multilingual large language models (LLMs) possess impressive multilingual\nunderstanding and generation capabilities. However, their performance and\ncross-lingual alignment often lag for non-dominant languages. A common solution\nis to fine-tune LLMs on large-scale and more balanced multilingual corpus, but\nsuch approaches often lead to imprecise alignment and suboptimal knowledge\ntransfer, struggling with limited improvements across languages. In this paper,\nwe propose AlignX to bridge the multilingual performance gap, which is a\ntwo-stage representation-level framework for enhancing multilingual performance\nof pre-trained LLMs. In the first stage, we align multilingual representations\nwith multilingual semantic alignment and language feature integration. In the\nsecond stage, we stimulate the multilingual capability of LLMs via multilingual\ninstruction fine-tuning. Experimental results on several pre-trained LLMs\ndemonstrate that our approach enhances LLMs' multilingual general and\ncross-lingual generation capability. Further analysis indicates that AlignX\nbrings the multilingual representations closer and improves the cross-lingual\nalignment.",
        "url": "http://arxiv.org/abs/2509.24338v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24338v1",
        "arxiv_id": "2509.24338v1",
        "authors": [
            "Mengyu Bu",
            "Shaolei Zhang",
            "Zhongjun He",
            "Hua Wu",
            "Yang Feng"
        ],
        "submitted": "2025-09-29 06:37:46",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025 Main Conference. The code will be available at\n  https://github.com/ictnlp/AlignX"
    },
    {
        "title": "Speculative Verification: Exploiting Information Gain to Refine Speculative Decoding",
        "abstract": "LLMs have low GPU efficiency and high latency due to autoregressive decoding.\nSpeculative decoding (SD) mitigates this using a small draft model to\nspeculatively generate multiple tokens, which are then verified in parallel by\na target model. However, when speculation accuracy is low, the overhead from\nrejected tokens can offset the benefits, limiting SD's effectiveness,\nespecially at large batch sizes. To address this, we propose Speculative\nVerification (SV), an efficient augmentation to SD that dynamically predicts\nspeculation accuracy and adapts the verification length to maximize throughput.\nSV introduces a companion model - a small auxiliary model similar in size to\nthe draft model - to estimate the alignment between draft and target model\ndistributions. By maximizing the information gain from quantifying this\nalignment, SV refines verification decisions, reducing wasted computation on\nrejected tokens and improving decoding efficiency. Moreover, SV requires no\nmodifications to the draft or target models and is compatible with existing SD\nvariants. We extensively evaluated SV on publicly available LLMs across three\nNLP tasks using nine combinations of draft, companion, and target models,\nincluding 13B-72B target models and three types of variations: base (no\nfinetuning), instruction-tuned, and task fine-tuned. Across all experiments and\nbatch sizes (4-80), SV consistently outperforms both SD and standard decoding\nwith the target model. It improves SD performance by up to 2$\\times$, with an\naverage speedup of 1.4 $\\times$ in large-batch settings (batch sizes 32-80).\nThese results demonstrate SV's robustness, scalability, and practical utility\nfor efficient LLM inference.",
        "url": "http://arxiv.org/abs/2509.24328v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24328v1",
        "arxiv_id": "2509.24328v1",
        "authors": [
            "Sungkyun Kim",
            "Jaemin Kim",
            "Dogyung Yoon",
            "Jiho Shin",
            "Junyeol Lee",
            "Jiwon Seo"
        ],
        "submitted": "2025-09-29 06:25:54",
        "source": "arxiv",
        "comment": "14 pages, 6 figures"
    },
    {
        "title": "MAS$^2$: Self-Generative, Self-Configuring, Self-Rectifying Multi-Agent Systems",
        "abstract": "The past two years have witnessed the meteoric rise of Large Language Model\n(LLM)-powered multi-agent systems (MAS), which harness collective intelligence\nand exhibit a remarkable trajectory toward self-evolution. This paradigm has\nrapidly progressed from manually engineered systems that require bespoke\nconfiguration of prompts, tools, roles, and communication protocols toward\nframeworks capable of automated orchestration. Yet, dominant automatic\nmulti-agent systems, whether generated by external modules or a single LLM\nagent, largely adhere to a rigid ``\\textit{generate-once-and-deploy}''\nparadigm, rendering the resulting systems brittle and ill-prepared for the\ndynamism and uncertainty of real-world environments. To transcend this\nlimitation, we introduce MAS$^2$, a paradigm predicated on the principle of\nrecursive self-generation: a multi-agent system that autonomously architects\nbespoke multi-agent systems for diverse problems. Technically, we devise a\n``\\textit{generator-implementer-rectifier}'' tri-agent team capable of\ndynamically composing and adaptively rectifying a target agent system in\nresponse to real-time task demands. Collaborative Tree Optimization is proposed\nto train and specialize these meta-agents. Extensive evaluation across seven\nbenchmarks reveals that MAS$^2$ achieves performance gains of up to $19.6\\%$\nover state-of-the-art MAS in complex scenarios such as deep research and code\ngeneration. Moreover, MAS$^2$ exhibits superior cross-backbone generalization,\neffectively leveraging previously unseen LLMs to yield improvements of up to\n$15.1\\%$. Crucially, these gains are attained without incurring excessive token\ncosts, as MAS$^2$ consistently resides on the Pareto frontier of\ncost-performance trade-offs. The source codes are available at\nhttps://github.com/yeyeyeah2/MAS2.",
        "url": "http://arxiv.org/abs/2509.24323v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24323v1",
        "arxiv_id": "2509.24323v1",
        "authors": [
            "Kun Wang",
            "Guibin Zhang",
            "ManKit Ye",
            "Xinyu Deng",
            "Dongxia Wang",
            "Xiaobin Hu",
            "Jinyang Guo",
            "Yang Liu",
            "Yufei Guo"
        ],
        "submitted": "2025-09-29 06:20:10",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Multimodal Large Language Models Meet Multimodal Emotion Recognition and Reasoning: A Survey",
        "abstract": "In recent years, large language models (LLMs) have driven major advances in\nlanguage understanding, marking a significant step toward artificial general\nintelligence (AGI). With increasing demands for higher-level semantics and\ncross-modal fusion, multimodal large language models (MLLMs) have emerged,\nintegrating diverse information sources (e.g., text, vision, and audio) to\nenhance modeling and reasoning in complex scenarios. In AI for Science,\nmultimodal emotion recognition and reasoning has become a rapidly growing\nfrontier. While LLMs and MLLMs have achieved notable progress in this area, the\nfield still lacks a systematic review that consolidates recent developments. To\naddress this gap, this paper provides a comprehensive survey of LLMs and MLLMs\nfor emotion recognition and reasoning, covering model architectures, datasets,\nand performance benchmarks. We further highlight key challenges and outline\nfuture research directions, aiming to offer researchers both an authoritative\nreference and practical insights for advancing this domain. To the best of our\nknowledge, this paper is the first attempt to comprehensively survey the\nintersection of MLLMs with multimodal emotion recognition and reasoning. The\nsummary of existing methods mentioned is in our Github:\n\\href{https://github.com/yuntaoshou/Awesome-Emotion-Reasoning}{https://github.com/yuntaoshou/Awesome-Emotion-Reasoning}.",
        "url": "http://arxiv.org/abs/2509.24322v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24322v1",
        "arxiv_id": "2509.24322v1",
        "authors": [
            "Yuntao Shou",
            "Tao Meng",
            "Wei Ai",
            "Keqin Li"
        ],
        "submitted": "2025-09-29 06:13:14",
        "source": "arxiv",
        "comment": "35 pages, 10 figures, 8 tables"
    },
    {
        "title": "Dual Mechanisms of Value Expression: Intrinsic vs. Prompted Values in LLMs",
        "abstract": "Large language models (LLMs) can express different values in two distinct\nways: (1) intrinsic expression, reflecting the model's inherent values learned\nduring training, and (2) prompted expression, elicited by explicit prompts.\nGiven their widespread use in value alignment and persona steering, it is\nparamount to clearly understand their underlying mechanisms, particularly\nwhether they mostly overlap (as one might expect) or rely on substantially\ndifferent mechanisms, but this remains largely understudied. We analyze this at\nthe mechanistic level using two approaches: (1) value vectors, feature\ndirections representing value mechanisms extracted from the residual stream,\nand (2) value neurons, MLP neurons that contribute to value expressions. We\ndemonstrate that intrinsic and prompted value mechanisms partly share common\ncomponents that are crucial for inducing value expression, but also possess\nunique elements that manifest in different ways. As a result, these mechanisms\nlead to different degrees of value steerability (prompted > intrinsic) and\nresponse diversity (intrinsic > prompted). In particular, components unique to\nthe intrinsic mechanism seem to promote lexical diversity in responses, whereas\nthose specific to the prompted mechanism primarily strengthen instruction\nfollowing, taking effect even in distant tasks like jailbreaking.",
        "url": "http://arxiv.org/abs/2509.24319v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24319v1",
        "arxiv_id": "2509.24319v1",
        "authors": [
            "Jongwook Han",
            "Jongwon Lim",
            "Injin Kong",
            "Yohan Jo"
        ],
        "submitted": "2025-09-29 05:57:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Bridging the behavior-neural gap: A multimodal AI reveals the brain's geometry of emotion more accurately than human self-reports",
        "abstract": "The ability to represent emotion plays a significant role in human cognition\nand social interaction, yet the high-dimensional geometry of this affective\nspace and its neural underpinnings remain debated. A key challenge, the\n`behavior-neural gap,' is the limited ability of human self-reports to predict\nbrain activity. Here we test the hypothesis that this gap arises from the\nconstraints of traditional rating scales and that large-scale similarity\njudgments can more faithfully capture the brain's affective geometry. Using AI\nmodels as `cognitive agents,' we collected millions of triplet odd-one-out\njudgments from a multimodal large language model (MLLM) and a language-only\nmodel (LLM) in response to 2,180 emotionally evocative videos. We found that\nthe emergent 30-dimensional embeddings from these models are highly\ninterpretable and organize emotion primarily along categorical lines, yet in a\nblended fashion that incorporates dimensional properties. Most remarkably, the\nMLLM's representation predicted neural activity in human emotion-processing\nnetworks with the highest accuracy, outperforming not only the LLM but also,\ncounterintuitively, representations derived directly from human behavioral\nratings. This result supports our primary hypothesis and suggests that sensory\ngrounding--learning from rich visual data--is critical for developing a truly\nneurally-aligned conceptual framework for emotion. Our findings provide\ncompelling evidence that MLLMs can autonomously develop rich, neurally-aligned\naffective representations, offering a powerful paradigm to bridge the gap\nbetween subjective experience and its neural substrates. Project page:\nhttps://reedonepeck.github.io/ai-emotion.github.io/.",
        "url": "http://arxiv.org/abs/2509.24298v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24298v1",
        "arxiv_id": "2509.24298v1",
        "authors": [
            "Changde Du",
            "Yizhuo Lu",
            "Zhongyu Huang",
            "Yi Sun",
            "Zisen Zhou",
            "Shaozheng Qin",
            "Huiguang He"
        ],
        "submitted": "2025-09-29 05:22:33",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Q-Mirror: Unlocking the Multi-Modal Potential of Scientific Text-Only QA Pairs",
        "abstract": "High-quality, multi-modal benchmarks are crucial for advancing scientific\nreasoning in large models yet their manual creation is costly and unscalable.\nTo address this bottleneck, we explore the potential for transforming Text-Only\nQA Pairs (TQAs) into high-quality Multi-Modal QA Pairs (MMQAs), which include\nthree parts: 1) Task Definition \\& Evaluation Rubric: We develop a TQA-to-MMQA\nframework and establish a comprehensive, multi-dimensional MMQA quality rubric\nthat provides principles for the transformation. 2) Benchmark Construction:\nThen we construct two extensive benchmarks to rigorously evaluate\nstate-of-the-art generation \\& understanding models on the distinct tasks of\nMMQA generation \\& MMQA quality evaluation. 3) Preliminary Solution: We develop\nan agentic system (Q-Mirror), which operationalizes our framework by\nintegrating MMQA generation and evaluation into a closed loop for iterative\nrefinement. Our experiments show that while state-of-the-art models can\ngenerate MMQAs, their outputs still leave substantial gaps, underscoring the\nneed for reliable evaluation. We further demonstrate that top-tier\nunderstanding models align closely with human judgment in MMQA quality\nassessment. Leveraging both insights, the Q-Mirror agent raises average scores\nfrom 78.90 to 85.22 and pass rates from 72\\% to 95\\%, offering a practical path\nto large-scale scientific benchmarks.",
        "url": "http://arxiv.org/abs/2509.24297v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24297v2",
        "arxiv_id": "2509.24297v2",
        "authors": [
            "Junying Wang",
            "Zicheng Zhang",
            "Ye Shen",
            "Yalun Wu",
            "Yingji Liang",
            "Yijin Guo",
            "Farong Wen",
            "Wenzhe Li",
            "Xuezhi Zhao",
            "Qi Jia",
            "Guangtao Zhai"
        ],
        "submitted": "2025-09-29 05:22:10",
        "source": "arxiv",
        "comment": "25 pages"
    },
    {
        "title": "DiffuGuard: How Intrinsic Safety is Lost and Found in Diffusion Large Language Models",
        "abstract": "The rapid advancement of Diffusion Large Language Models (dLLMs) introduces\nunprecedented vulnerabilities that are fundamentally distinct from\nAutoregressive LLMs, stemming from their iterative and parallel generation\nmechanisms. In this paper, we conduct an in-depth analysis of dLLM\nvulnerabilities to jailbreak attacks across two distinct dimensions: intra-step\nand inter-step dynamics. Experimental results reveal a harmful bias inherent in\nthe standard greedy remasking strategy and identify a critical phenomenon we\nterm Denoising-path Dependence, where the safety of early-stage tokens\ndecisively influences the final output. These findings also indicate that while\ncurrent decoding strategies constitute a significant vulnerability, dLLMs\npossess a substantial intrinsic safety potential. To unlock this potential, we\npropose DiffuGuard, a training-free defense framework that addresses\nvulnerabilities through a dual-stage approach: Stochastic Annealing Remasking\ndynamically introduces controlled randomness to mitigate greedy selection bias,\nwhile Block-level Audit and Repair exploits internal model representations for\nautonomous risk detection and guided correction. Comprehensive experiments on\nfour dLLMs demonstrate DiffuGuard's exceptional effectiveness, reducing Attack\nSuccess Rate against six diverse jailbreak methods from 47.9% to 14.7% while\npreserving model utility and efficiency. Our code is available at:\nhttps://github.com/niez233/DiffuGuard.",
        "url": "http://arxiv.org/abs/2509.24296v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24296v1",
        "arxiv_id": "2509.24296v1",
        "authors": [
            "Zherui Li",
            "Zheng Nie",
            "Zhenhong Zhou",
            "Yufei Guo",
            "Yue Liu",
            "Yitong Zhang",
            "Yu Cheng",
            "Qingsong Wen",
            "Kun Wang",
            "Jiaheng Zhang"
        ],
        "submitted": "2025-09-29 05:17:10",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LOGOS: LLM-driven End-to-End Grounded Theory Development and Schema Induction for Qualitative Research",
        "abstract": "Grounded theory offers deep insights from qualitative data, but its reliance\non expert-intensive manual coding presents a major scalability bottleneck.\nCurrent computational tools stop short of true automation, keeping researchers\nfirmly in the loop. We introduce LOGOS, a novel, end-to-end framework that\nfully automates the grounded theory workflow, transforming raw text into a\nstructured, hierarchical theory. LOGOS integrates LLM-driven coding, semantic\nclustering, graph reasoning, and a novel iterative refinement process to build\nhighly reusable codebooks. To ensure fair comparison, we also introduce a\nprincipled 5-dimensional metric and a train-test split protocol for\nstandardized, unbiased evaluation. Across five diverse corpora, LOGOS\nconsistently outperforms strong baselines and achieves a remarkable $88.2\\%$\nalignment with an expert-developed schema on a complex dataset. LOGOS\ndemonstrates a powerful new path to democratize and scale qualitative research\nwithout sacrificing theoretical nuance.",
        "url": "http://arxiv.org/abs/2509.24294v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24294v1",
        "arxiv_id": "2509.24294v1",
        "authors": [
            "Xinyu Pi",
            "Qisen Yang",
            "Chuong Nguyen"
        ],
        "submitted": "2025-09-29 05:16:09",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Let LLMs Speak Embedding Languages: Generative Text Embeddings via Iterative Contrastive Refinement",
        "abstract": "Existing large language model (LLM)-based embeddings typically adopt an\nencoder-only paradigm, treating LLMs as static feature extractors and\noverlooking their core generative strengths. We introduce GIRCSE (Generative\nIterative Refinement for Contrastive Sentence Embeddings), a novel framework\nthat leverages autoregressive generation to iteratively refine semantic\nrepresentations. By producing sequences of soft tokens optimized under\ncontrastive objective, GIRCSE captures latent concepts and implicit semantics\nthat encoder-only methods often miss. To guide this process, we propose an\nIterative Contrastive Refinement (ICR) objective that encourages each\nrefinement step to yield better representations. Extensive experiments show\nthat GIRCSE outperforms strong LLM-based embedding baselines on the MTEB\nbenchmark and instruction-following tasks. Moreover, GIRCSE exhibits an\nemergent test-time scaling property: generating more tokens at inference\nsteadily improves embedding quality. Our results establish generative iterative\nrefinement as a new paradigm for representation learning.",
        "url": "http://arxiv.org/abs/2509.24291v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24291v1",
        "arxiv_id": "2509.24291v1",
        "authors": [
            "Yu-Che Tsai",
            "Kuan-Yu Chen",
            "Yuan-Chi Li",
            "Yuan-Hao Chen",
            "Ching-Yu Tsai",
            "Shou-De Lin"
        ],
        "submitted": "2025-09-29 05:09:08",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SCI-Verifier: Scientific Verifier with Thinking",
        "abstract": "As large language models (LLMs) are increasingly applied to scientific\nreasoning, the complexity of answer formats and the diversity of equivalent\nexpressions make answer verification a critical yet challenging task. Existing\nverification studies in scientific domains suffer from two major limitations:\n(a) the absence of systematic evaluation standards and insufficient\ndisciplinary coverage, which hinders their comprehensive assessment; and (b)\nheavy reliance on cumbersome rule design or prompt engineering, which reduces\ntheir effectiveness in complex reasoning scenarios or limits their\ncross-disciplinary generalization. To address these challenges, we propose\nsolutions at both the data and model levels. On the data side, we construct\nSCI-VerifyBench, a cross-disciplinary benchmark covering mathematics, physics,\nbiology, chemistry, and general scientific QA. The benchmark is built from real\nLLM responses and enhanced with domain-specific equivalence transformations\nthat generate challenging and realistic data. Model-based and expert\nannotations ensure both quality and diversity, enabling rigorous evaluation of\nverification ability. On the model side, we emphasize the importance of\nreasoning for verification and introduce SCI-Verifier, a unified\nreasoning-augmented verifier for scientific domains. Through post-training,\nSCI-Verifier demonstrates strong logical reasoning and equivalence judgment\ncapabilities while maintaining concise and stable outputs. Together,\nSCI-VerifyBench and SCI-Verifier provide a principled framework for scientific\nverification, offering both systematic evaluation and practical pathways to\nenhance the reliability and applicability of LLMs in scientific domains.",
        "url": "http://arxiv.org/abs/2509.24285v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24285v1",
        "arxiv_id": "2509.24285v1",
        "authors": [
            "Shenghe Zheng",
            "Chenyu Huang",
            "Fangchen Yu",
            "Junchi Yao",
            "Jingqi Ye",
            "Tao Chen",
            "Yun Luo",
            "Ning Ding",
            "LEI BAI",
            "Ganqu Cui",
            "Peng Ye"
        ],
        "submitted": "2025-09-29 04:58:43",
        "source": "arxiv",
        "comment": "This paper focuses on LLM-as-a-Judge, and the project is currently in\n  progress"
    },
    {
        "title": "Overview of SCIDOCA 2025 Shared Task on Citation Prediction, Discovery, and Placement",
        "abstract": "We present an overview of the SCIDOCA 2025 Shared Task, which focuses on\ncitation discovery and prediction in scientific documents. The task is divided\ninto three subtasks: (1) Citation Discovery, where systems must identify\nrelevant references for a given paragraph; (2) Masked Citation Prediction,\nwhich requires selecting the correct citation for masked citation slots; and\n(3) Citation Sentence Prediction, where systems must determine the correct\nreference for each cited sentence. We release a large-scale dataset constructed\nfrom the Semantic Scholar Open Research Corpus (S2ORC), containing over 60,000\nannotated paragraphs and a curated reference set. The test set consists of\n1,000 paragraphs from distinct papers, each annotated with ground-truth\ncitations and distractor candidates. A total of seven teams registered, with\nthree submitting results. We report performance metrics across all subtasks and\nanalyze the effectiveness of submitted systems. This shared task provides a new\nbenchmark for evaluating citation modeling and encourages future research in\nscientific document understanding. The dataset and task materials are publicly\navailable at https://github.com/daotuanan/scidoca2025-shared-task.",
        "url": "http://arxiv.org/abs/2509.24283v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24283v1",
        "arxiv_id": "2509.24283v1",
        "authors": [
            "An Dao",
            "Vu Tran",
            "Le-Minh Nguyen",
            "Yuji Matsumoto"
        ],
        "submitted": "2025-09-29 04:55:18",
        "source": "arxiv",
        "comment": "16 pages, SCIDOCA 2025"
    },
    {
        "title": "SimuHome: A Temporal- and Environment-Aware Benchmark for Smart Home LLM Agents",
        "abstract": "Large Language Model (LLM) agents excel at multi-step, tool-augmented tasks.\nHowever, smart homes introduce distinct challenges, requiring agents to handle\nlatent user intents, temporal dependencies, device constraints, scheduling, and\nmore. The main bottlenecks for developing smart home agents with such\ncapabilities include the lack of a realistic simulation environment where\nagents can interact with devices and observe the results, as well as a\nchallenging benchmark to evaluate them. To address this, we introduce\n$\\textbf{SimuHome}$, a time-accelerated home environment that simulates smart\ndevices, supports API calls, and reflects changes in environmental variables.\nBy building the simulator on the Matter protocol (the global industry standard\nfor smart home communication), SimuHome provides a high-fidelity environment,\nand agents validated in SimuHome can be deployed on real Matter-compliant\ndevices with minimal adaptation. We provide a challenging benchmark of 600\nepisodes across twelve user query types that require the aforementioned\ncapabilities. Our evaluation of 11 agents under a unified ReAct framework\nreveals that while models perform well on simple tasks, they struggle with\nlatent intent inference, state verification, and especially temporal\nscheduling. Even the top-performing model, GPT-4.1, reaches only 54% success\nrate. These findings highlight a critical need for methods that can reliably\nverify the current state via tools before acting and coordinate time-dependent\nactions.",
        "url": "http://arxiv.org/abs/2509.24282v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24282v1",
        "arxiv_id": "2509.24282v1",
        "authors": [
            "Gyuhyeon Seo",
            "Jungwoo Yang",
            "Junseong Pyo",
            "Nalim Kim",
            "Jonggeun Lee",
            "Yohan Jo"
        ],
        "submitted": "2025-09-29 04:54:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "AdvChain: Adversarial Chain-of-Thought Tuning for Robust Safety Alignment of Large Reasoning Models",
        "abstract": "Large Reasoning Models (LRMs) have demonstrated remarkable capabilities in\ncomplex problem-solving through Chain-of-Thought (CoT) reasoning. However, the\nmulti-step nature of CoT introduces new safety challenges that extend beyond\nconventional language model alignment. We identify a failure mode in current\nsafety CoT tuning methods: the \\textit{snowball effect}, where minor reasoning\ndeviations progressively amplify throughout the thought process, leading to\neither harmful compliance or excessive refusal. This effect stems from models\nbeing trained to imitate perfect reasoning scripts without learning to\nself-correct. To address this limitation, we propose AdvChain, an alignment\nparadigm that teaches models dynamic self-correction through adversarial CoT\ntuning. Our method involves constructing a dataset containing\nTemptation-Correction and Hesitation-Correction samples, where models learn to\nrecover from harmful reasoning drifts and unnecessary cautions. Extensive\nexperiments show that AdvChain significantly enhances robustness against\njailbreak attacks and CoT hijacking while substantially reducing over-refusal\non benign prompts, achieving a superior safety-utility balance without\ncompromising reasoning capabilities. Our work establishes a new direction for\nbuilding more robust and reliable reasoning models.",
        "url": "http://arxiv.org/abs/2509.24269v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24269v1",
        "arxiv_id": "2509.24269v1",
        "authors": [
            "Zihao Zhu",
            "Xinyu Wu",
            "Gehan Hu",
            "Siwei Lyu",
            "Ke Xu",
            "Baoyuan Wu"
        ],
        "submitted": "2025-09-29 04:27:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "PAME-AI: Patient Messaging Creation and Optimization using Agentic AI",
        "abstract": "Messaging patients is a critical part of healthcare communication, helping to\nimprove things like medication adherence and healthy behaviors. However,\ntraditional mobile message design has significant limitations due to its\ninability to explore the high-dimensional design space. We develop PAME-AI, a\nnovel approach for Patient Messaging Creation and Optimization using Agentic\nAI. Built on the Data-Information-Knowledge-Wisdom (DIKW) hierarchy, PAME-AI\noffers a structured framework to move from raw data to actionable insights for\nhigh-performance messaging design. PAME-AI is composed of a system of\nspecialized computational agents that progressively transform raw experimental\ndata into actionable message design strategies. We demonstrate our approach's\neffectiveness through a two-stage experiment, comprising of 444,691 patient\nencounters in Stage 1 and 74,908 in Stage 2. The best-performing generated\nmessage achieved 68.76% engagement compared to the 61.27% baseline,\nrepresenting a 12.2% relative improvement in click-through rates. This agentic\narchitecture enables parallel processing, hypothesis validation, and continuous\nlearning, making it particularly suitable for large-scale healthcare\ncommunication optimization.",
        "url": "http://arxiv.org/abs/2509.24263v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24263v2",
        "arxiv_id": "2509.24263v2",
        "authors": [
            "Junjie Luo",
            "Yihong Guo",
            "Anqi Liu",
            "Ritu Agarwal",
            "Gordon Gao"
        ],
        "submitted": "2025-09-29 04:14:46",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Extracting the Structure of Press Releases for Predicting Earnings Announcement Returns",
        "abstract": "We examine how textual features in earnings press releases predict stock\nreturns on earnings announcement days. Using over 138,000 press releases from\n2005 to 2023, we compare traditional bag-of-words and BERT-based embeddings. We\nfind that press release content (soft information) is as informative as\nearnings surprise (hard information), with FinBERT yielding the highest\npredictive power. Combining models enhances explanatory strength and\ninterpretability of the content of press releases. Stock prices fully reflect\nthe content of press releases at market open. If press releases are leaked, it\noffers predictive advantage. Topic analysis reveals self-serving bias in\nmanagerial narratives. Our framework supports real-time return prediction\nthrough the integration of online learning, provides interpretability and\nreveals the nuanced role of language in price formation.",
        "url": "http://arxiv.org/abs/2509.24254v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24254v1",
        "arxiv_id": "2509.24254v1",
        "authors": [
            "Yuntao Wu",
            "Ege Mert Akin",
            "Charles Martineau",
            "Vincent Grégoire",
            "Andreas Veneris"
        ],
        "submitted": "2025-09-29 03:57:05",
        "source": "arxiv",
        "comment": "9 pages, 4 figures, 6 tables, Accepted by The 6th ACM International\n  Conference on AI in Finance"
    },
    {
        "title": "MRAG-Suite: A Diagnostic Evaluation Platform for Visual Retrieval-Augmented Generation",
        "abstract": "Multimodal Retrieval-Augmented Generation (Visual RAG) significantly advances\nquestion answering by integrating visual and textual evidence. Yet, current\nevaluations fail to systematically account for query difficulty and ambiguity.\nWe propose MRAG-Suite, a diagnostic evaluation platform integrating diverse\nmultimodal benchmarks (WebQA, Chart-RAG, Visual-RAG, MRAG-Bench). We introduce\ndifficulty-based and ambiguity-aware filtering strategies, alongside\nMM-RAGChecker, a claim-level diagnostic tool. Our results demonstrate\nsubstantial accuracy reductions under difficult and ambiguous queries,\nhighlighting prevalent hallucinations. MM-RAGChecker effectively diagnoses\nthese issues, guiding future improvements in Visual RAG systems.",
        "url": "http://arxiv.org/abs/2509.24253v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24253v1",
        "arxiv_id": "2509.24253v1",
        "authors": [
            "Yuelyu Ji"
        ],
        "submitted": "2025-09-29 03:55:28",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Latent Visual Reasoning",
        "abstract": "Multimodal Large Language Models (MLLMs) have achieved notable gains in\nvarious tasks by incorporating Chain-of-Thought (CoT) reasoning in language\nspaces. Recent work extends this direction by leveraging external tools for\nvisual editing, thereby enhancing the visual signal along the reasoning\ntrajectories. Nevertheless, these approaches remain fundamentally constrained:\nreasoning is still confined to the language space, with visual information\ntreated as static preconditions. We introduce Latent Visual Reasoning (LVR), a\nnew paradigm that enables autoregressive reasoning directly in the visual\nembedding space. A visual encoder first projects images into visual tokens\nwithin a joint semantic space shared with the language model. The language\nmodel is then trained to generate latent states that reconstruct key visual\ntokens critical for answering the query, constituting the process of latent\nvisual reasoning. By interleaving LVR with standard text generation, our model\nachieves substantial gains on perception-intensive visual question answering\ntasks. In addition, we adapt the GRPO algorithm to conduct reinforcement\nlearning on latent reasoning, further balancing LVR and textual generation. We\nshow that LVR substantially improves fine-grained visual understanding and\nperception, achieving 71.67% on MMVP compared to 66.67% with Qwen2.5-VL. Code\nbase and model weights will be released later.",
        "url": "http://arxiv.org/abs/2509.24251v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24251v1",
        "arxiv_id": "2509.24251v1",
        "authors": [
            "Bangzheng Li",
            "Ximeng Sun",
            "Jiang Liu",
            "Ze Wang",
            "Jialian Wu",
            "Xiaodong Yu",
            "Hao Chen",
            "Emad Barsoum",
            "Muhao Chen",
            "Zicheng Liu"
        ],
        "submitted": "2025-09-29 03:52:01",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SpecExit: Accelerating Large Reasoning Model via Speculative Exit",
        "abstract": "Despite their strong performance on reasoning tasks, large reasoning models\n(LRMs) often suffer from overthinking, producing unnecessarily long outputs and\nincurring high end-to-end latency, a significant limitation to their real-world\ndeployment. To address overthinking, early-exit mechanisms have been proposed\nto terminate reasoning before typical completion, showing that this approach\ncan effectively shorten generation length with minimal impact on accuracy.\nHowever, their reliance on probing mechanisms introduces a detection overhead\nthat limits their end-to-end latency gains and compromises their\ngeneralizability across diverse problems. Inspired by the use of hidden states\nin speculative decoding, we propose SpecExit, a novel framework that predicts\nboth future tokens and an early-exit signal directly from a lightweight draft\nmodel without probing overhead. Our method offers significant improvements,\nreducing average generation length by 66\\% and achieving a 2.5x speedup in\nend-to-end latency compared to the speculative decoding baseline, without\ncompromising accuracy. Our method leverages the inherent signals from hidden\nstates to provide effective early-exit signals, suggesting broader use of\nhidden states for efficient reasoning. Our code is available at\nhttps://github.com/Tencent/AngelSlim.",
        "url": "http://arxiv.org/abs/2509.24248v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24248v1",
        "arxiv_id": "2509.24248v1",
        "authors": [
            "Rubing Yang",
            "Huajun Bai",
            "Song Liu",
            "Guanghua Yu",
            "Runzhi Fan",
            "Yanbin Dang",
            "Jiejing Zhang",
            "Kai Liu",
            "Jianchen Zhu",
            "Peng Chen"
        ],
        "submitted": "2025-09-29 03:39:32",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Prompt and Parameter Co-Optimization for Large Language Models",
        "abstract": "Prompt optimization and fine-tuning are two major approaches to improve the\nperformance of Large Language Models (LLMs). They enhance the capabilities of\nLLMs from complementary perspectives: the former through explicit natural\nlanguage, and the latter through implicit parameter updates. However, prior\nwork has typically studied them in isolation, leaving their synergistic\npotential largely underexplored. To bridge this gap, in this paper, we\nintroduce MetaTuner, a novel framework that jointly integrates prompt\noptimization and fine-tuning for LLM training. Specifically, we introduce two\nneural networks to generate prompts and parameters, respectively, while\nallowing them to share a common bottom encoding layer to enable knowledge\nsharing. By the guidance of the final supervised signals, our framework is\noptimized to discover the optimal combinations between the prompts and\nparameters. Given that prompt learning involves discrete optimization while\nfine-tuning operates in a continuous parameter space, we design a supervised\nregularization loss to train our framework effectively. Extensive experiments\nacross diverse benchmarks show that our method consistently outperforms the\nbaselines.",
        "url": "http://arxiv.org/abs/2509.24245v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24245v1",
        "arxiv_id": "2509.24245v1",
        "authors": [
            "Xiaohe Bo",
            "Rui Li",
            "Zexu Sun",
            "Quanyu Dai",
            "Zeyu Zhang",
            "Zihang Tian",
            "Xu Chen",
            "Zhenhua Dong"
        ],
        "submitted": "2025-09-29 03:38:25",
        "source": "arxiv",
        "comment": "19 pages, 10 figures"
    },
    {
        "title": "Learning to Ponder: Adaptive Reasoning in Latent Space",
        "abstract": "Test-time compute has emerged as a key paradigm for enhancing LLM reasoning,\nyet prevailing approaches like Best-of-N and majority voting apply uniform\ndepth across inputs, wasting computation on simple queries while potentially\nunder-thinking complex ones. We present FR-Ponder, a single-graph,\nbackbone-training-free framework that allocates instance-adaptive reasoning\ncompute via latent steering. A less than 1M-param controller observes hidden\nstates and decides to halt or apply a small ponder step by adding a\npre-computed steering vector to frozen representations. Our method extracts the\nlatent steering vector associated with deeper reasoning outputs and direct IO\nfrom LLM and re-applies it through a tunable scaling factor, allowing the model\nto adapt its reasoning depth to the complexity of each input. To balance\nperformance and computational cost, we employ Group Relative Policy\nOptimization (GRPO) as a reward signal to adaptively regulate reasoning depth,\nachieving task accuracy while mitigating overreasoning. Through curriculum\nlearning and careful reward engineering, FR-Ponder learns calibrated compute\nallocation correlated with problem difficulty. On GSM8K and MATH500, FR-Ponder\nimproves the compute-accuracy frontier, delivering lower FLOPs with better\nmatched accuracy and comparing favorably to early-exit baselines, without\nmodifying backbone weights. Analyses visualize interpretable steering\ndirections and show learned compute allocation correlates with problem\ndifficulty.",
        "url": "http://arxiv.org/abs/2509.24238v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24238v1",
        "arxiv_id": "2509.24238v1",
        "authors": [
            "Yixin He",
            "Lumingyuan Tang"
        ],
        "submitted": "2025-09-29 03:21:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Model Fusion with Multi-LoRA Inference for Tool-Enhanced Game Dialogue Agents",
        "abstract": "This paper presents the opdainlp team's solution for the GPU track of the\nCPDC 2025 challenge. The challenge consists of three tasks, aiming to build an\nin-game conversational AI that adheres to character personas, aligns with the\ngame's worldview, and supports function calling. Considering both effectiveness\nand resource/time constraints during inference, we synthesized data for some of\nthe tasks based on the datasets provided by the competition organizers. We\nemployed Qwen3-14B with LoRA fine-tuning and model fusion, and utilized a base\nmodel integrated with multiple LoRA adapters during inference. Specifically, in\nthe competition, we used three distinct LoRA adapters to handle tool calling,\nresponse generation with tool call results, and response generation without\ntool call results, respectively. MultiLoRA inference was implemented using\nvLLM. Our solution achieved the first place in Task 1 and Task 3, and the\nsecond place in Task 2 of the GPU track.",
        "url": "http://arxiv.org/abs/2509.24229v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24229v1",
        "arxiv_id": "2509.24229v1",
        "authors": [
            "Kangxu Wang",
            "Ze Chen",
            "Chengcheng Wei",
            "Jiewen Zheng",
            "Jiarong He",
            "Max Gao"
        ],
        "submitted": "2025-09-29 03:15:19",
        "source": "arxiv",
        "comment": "8 pages"
    },
    {
        "title": "MoVa: Towards Generalizable Classification of Human Morals and Values",
        "abstract": "Identifying human morals and values embedded in language is essential to\nempirical studies of communication. However, researchers often face substantial\ndifficulty navigating the diversity of theoretical frameworks and data\navailable for their analysis. Here, we contribute MoVa, a well-documented suite\nof resources for generalizable classification of human morals and values,\nconsisting of (1) 16 labeled datasets and benchmarking results from four\ntheoretically-grounded frameworks; (2) a lightweight LLM prompting strategy\nthat outperforms fine-tuned models across multiple domains and frameworks; and\n(3) a new application that helps evaluate psychological surveys. In practice,\nwe specifically recommend a classification strategy, all@once, that scores all\nrelated concepts simultaneously, resembling the well-known multi-label\nclassifier chain. The data and methods in MoVa can facilitate many fine-grained\ninterpretations of human and machine communication, with potential implications\nfor the alignment of machine behavior.",
        "url": "http://arxiv.org/abs/2509.24216v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24216v1",
        "arxiv_id": "2509.24216v1",
        "authors": [
            "Ziyu Chen",
            "Junfei Sun",
            "Chenxi Li",
            "Tuan Dung Nguyen",
            "Jing Yao",
            "Xiaoyuan Yi",
            "Xing Xie",
            "Chenhao Tan",
            "Lexing Xie"
        ],
        "submitted": "2025-09-29 02:56:27",
        "source": "arxiv",
        "comment": "9 pages, 10 figures and tables, EMNLP 2025 main conference"
    },
    {
        "title": "Metamorphic Testing for Audio Content Moderation Software",
        "abstract": "The rapid growth of audio-centric platforms and applications such as WhatsApp\nand Twitter has transformed the way people communicate and share audio content\nin modern society. However, these platforms are increasingly misused to\ndisseminate harmful audio content, such as hate speech, deceptive\nadvertisements, and explicit material, which can have significant negative\nconsequences (e.g., detrimental effects on mental health). In response,\nresearchers and practitioners have been actively developing and deploying audio\ncontent moderation tools to tackle this issue. Despite these efforts, malicious\nactors can bypass moderation systems by making subtle alterations to audio\ncontent, such as modifying pitch or inserting noise. Moreover, the\neffectiveness of modern audio moderation tools against such adversarial inputs\nremains insufficiently studied. To address these challenges, we propose MTAM, a\nMetamorphic Testing framework for Audio content Moderation software.\nSpecifically, we conduct a pilot study on 2000 audio clips and define 14\nmetamorphic relations across two perturbation categories: Audio Features-Based\nand Heuristic perturbations. MTAM applies these metamorphic relations to toxic\naudio content to generate test cases that remain harmful while being more\nlikely to evade detection. In our evaluation, we employ MTAM to test five\ncommercial textual content moderation software and an academic model against\nthree kinds of toxic content. The results show that MTAM achieves up to 38.6%,\n18.3%, 35.1%, 16.7%, and 51.1% error finding rates (EFR) when testing\ncommercial moderation software provided by Gladia, Assembly AI, Baidu,\nNextdata, and Tencent, respectively, and it obtains up to 45.7% EFR when\ntesting the state-of-the-art algorithms from the academy.",
        "url": "http://arxiv.org/abs/2509.24215v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24215v1",
        "arxiv_id": "2509.24215v1",
        "authors": [
            "Wenxuan Wang",
            "Yongjiang Wu",
            "Junyuan Zhang",
            "Shuqing Li",
            "Yun Peng",
            "Wenting Chen",
            "Shuai Wang",
            "Michael R. Lyu"
        ],
        "submitted": "2025-09-29 02:55:07",
        "source": "arxiv",
        "comment": "Accepted by ASE 2025"
    },
    {
        "title": "ScenarioBench: Trace-Grounded Compliance Evaluation for Text-to-SQL and RAG",
        "abstract": "ScenarioBench is a policy-grounded, trace-aware benchmark for evaluating\nText-to-SQL and retrieval-augmented generation in compliance contexts. Each\nYAML scenario includes a no-peek gold-standard package with the expected\ndecision, a minimal witness trace, the governing clause set, and the canonical\nSQL, enabling end-to-end scoring of both what a system decides and why. Systems\nmust justify outputs using clause IDs from the same policy canon, making\nexplanations falsifiable and audit-ready. The evaluator reports decision\naccuracy, trace quality (completeness, correctness, order), retrieval\neffectiveness, SQL correctness via result-set equivalence, policy coverage,\nlatency, and an explanation-hallucination rate. A normalized Scenario\nDifficulty Index (SDI) and a budgeted variant (SDI-R) aggregate results while\naccounting for retrieval difficulty and time. Compared with prior Text-to-SQL\nor KILT/RAG benchmarks, ScenarioBench ties each decision to clause-level\nevidence under strict grounding and no-peek rules, shifting gains toward\njustification quality under explicit time budgets.",
        "url": "http://arxiv.org/abs/2509.24212v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24212v1",
        "arxiv_id": "2509.24212v1",
        "authors": [
            "Zahra Atf",
            "Peter R Lewis"
        ],
        "submitted": "2025-09-29 02:51:08",
        "source": "arxiv",
        "comment": "Accepted for presentation at the LLMs Meet Databases (LMD) Workshop,\n  35th IEEE International Conference on Collaborative Advances in Software and\n  Computing, 2025. Workshop website: https://sites.google.com/view/lmd2025/home"
    },
    {
        "title": "BeyondBench: Benchmark-Free Evaluation of Reasoning in Language Models",
        "abstract": "Evaluating language models fairly is becoming harder as static benchmarks\navailable on the internet risk contamination by training data. This makes it\nunclear whether models are truly reasoning or just recalling answers. In this\npaper, we introduce BeyondBench, an evaluation framework that avoids this\nproblem by using algorithmic problem generation. Unlike traditional benchmarks\nthat risk contamination from internet-scale training data, BeyondBench creates\nmathematically grounded problems on the fly, ensuring each test remains fresh\nand uncontaminated. Our framework covers 44 algorithmic tasks with a total of\n117 variations, grouped into three difficulty levels: the Easy Suite (29 tasks)\nfor basic arithmetic and statistics, the Medium Suite (5 tasks, 49 variations)\nfor sequence patterns and reasoning, and the Hard Suite (10 tasks, 68\nvariations) tackling NP-complete and constraint satisfaction problems. Each\ntask generates problems from a combinatorial space larger than 10^15 unique\ninstances, with solutions verified deterministically by mathematical proofs. We\nevaluated 101 language models, including 85 open-source and 16 closed-source\nmodels, spanning sizes from 0.5B to 141B parameters and multiple quantization\nschemes. Our results show consistent reasoning deficiencies across model\nfamilies, with performance degrading sharply as problem complexity increases\nfrom polynomial to exponential. In our Hard Suite evaluations, models such as\nGemini-2.5-pro, Llama-3.3-70B, and Qwen2.5-72B achieved average accuracies of\n56.38%, 26.91%, and 33.60%, respectively. Moreover, we observe that performance\ndrops drastically without tool usage, with GPT-5, GPT-5-mini, and GPT-5-nano\nshowing a decline of 16.81%, 28.05%, and 47.59% accuracy on the hard suite. Our\nleaderboard is publicly available at https://ctrl-gaurav.github.io/BeyondBench/",
        "url": "http://arxiv.org/abs/2509.24210v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24210v1",
        "arxiv_id": "2509.24210v1",
        "authors": [
            "Gaurav Srivastava",
            "Aafiya Hussain",
            "Zhenyu Bi",
            "Swastik Roy",
            "Priya Pitre",
            "Meng Lu",
            "Morteza Ziyadi",
            "Xuan Wang"
        ],
        "submitted": "2025-09-29 02:49:01",
        "source": "arxiv",
        "comment": "113 pages, 5 figures, 30 tables"
    },
    {
        "title": "Group-Relative REINFORCE Is Secretly an Off-Policy Algorithm: Demystifying Some Myths About GRPO and Its Friends",
        "abstract": "Off-policy reinforcement learning (RL) for large language models (LLMs) is\nattracting growing interest, driven by practical constraints in real-world\napplications, the complexity of LLM-RL infrastructure, and the need for further\ninnovations of RL methodologies. While classic REINFORCE and its modern\nvariants like Group Relative Policy Optimization (GRPO) are typically regarded\nas on-policy algorithms with limited tolerance of off-policyness, we present in\nthis work a first-principles derivation for group-relative REINFORCE without\nassuming a specific training data distribution, showing that it admits a native\noff-policy interpretation. This perspective yields two general principles for\nadapting REINFORCE to off-policy settings: regularizing policy updates, and\nactively shaping the data distribution. Our analysis demystifies some myths\nabout the roles of importance sampling and clipping in GRPO, unifies and\nreinterprets two recent algorithms -- Online Policy Mirror Descent (OPMD) and\nAsymmetric REINFORCE (AsymRE) -- as regularized forms of the REINFORCE loss,\nand offers theoretical justification for seemingly heuristic data-weighting\nstrategies. Our findings lead to actionable insights that are validated with\nextensive empirical studies, and open up new opportunities for principled\nalgorithm design in off-policy RL for LLMs. Source code for this work is\navailable at\nhttps://github.com/modelscope/Trinity-RFT/tree/main/examples/rec_gsm8k.",
        "url": "http://arxiv.org/abs/2509.24203v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24203v1",
        "arxiv_id": "2509.24203v1",
        "authors": [
            "Chaorui Yao",
            "Yanxi Chen",
            "Yuchang Sun",
            "Yushuo Chen",
            "Wenhao Zhang",
            "Xuchen Pan",
            "Yaliang Li",
            "Bolin Ding"
        ],
        "submitted": "2025-09-29 02:34:54",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Can Large Language Models Express Uncertainty Like Human?",
        "abstract": "Large language models (LLMs) are increasingly used in high-stakes settings,\nwhere overconfident responses can mislead users. Reliable confidence estimation\nhas been shown to enhance trust and task accuracy. Yet existing methods face\npractical barriers: logits are often hidden, multi-sampling is computationally\nexpensive, and verbalized numerical uncertainty (e.g., giving a 0-100 score)\ndeviates from natural communication. We revisit linguistic confidence (LC),\nwhere models express uncertainty through hedging language (e.g., probably,\nmight), offering a lightweight and human-centered alternative. To advance this\ndirection, we (1) release the first diverse, large-scale dataset of hedging\nexpressions with human-annotated confidence scores, and (2) propose a\nlightweight mapper that converts hedges into confidence scores at near-zero\ncost. Building on these resources, we (3) conduct the first systematic study of\nLC across modern LLMs and QA benchmarks, revealing that while most LLMs\nunderperform in expressing reliable LC, carefully designed prompting achieves\ncompetitive calibration and discriminability. Finally, we (4) introduce a\nfine-tuning framework that further improves LC reliability. Taken together, our\nwork positions linguistic confidence as a scalable, efficient, and\nhuman-aligned approach to LLM uncertainty estimation, and calls for deeper\nexploration of this promising yet underexplored direction.",
        "url": "http://arxiv.org/abs/2509.24202v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24202v1",
        "arxiv_id": "2509.24202v1",
        "authors": [
            "Linwei Tao",
            "Yi-Fan Yeh",
            "Bo Kai",
            "Minjing Dong",
            "Tao Huang",
            "Tom A. Lamb",
            "Jialin Yu",
            "Philip H. S. Torr",
            "Chang Xu"
        ],
        "submitted": "2025-09-29 02:34:30",
        "source": "arxiv",
        "comment": "10 pages"
    },
    {
        "title": "AceSearcher: Bootstrapping Reasoning and Search for LLMs via Reinforced Self-Play",
        "abstract": "Search-augmented LLMs often struggle with complex reasoning tasks due to\nineffective multi-hop retrieval and limited reasoning ability. We propose\nAceSearcher, a cooperative self-play framework that trains a single large\nlanguage model (LLM) to alternate between two roles: a decomposer that breaks\ndown complex queries and a solver that integrates retrieved contexts for answer\ngeneration. AceSearcher couples supervised fine-tuning on a diverse mixture of\nsearch, reasoning, and decomposition tasks with reinforcement fine-tuning\noptimized for final answer accuracy, eliminating the need for intermediate\nannotations. Extensive experiments on three reasoning-intensive tasks across 10\ndatasets show that AceSearcher outperforms state-of-the-art baselines,\nachieving an average exact match improvement of 7.6%. Remarkably, on\ndocument-level finance reasoning tasks, AceSearcher-32B matches the performance\nof the DeepSeek-V3 model using less than 5% of its parameters. Even at smaller\nscales (1.5B and 8B), AceSearcher often surpasses existing search-augmented\nLLMs with up to 9x more parameters, highlighting its exceptional efficiency and\neffectiveness in tackling complex reasoning tasks. Our code will be published\nat https://github.com/ritaranx/AceSearcher and\nhttps://huggingface.co/AceSearcher.",
        "url": "http://arxiv.org/abs/2509.24193v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24193v1",
        "arxiv_id": "2509.24193v1",
        "authors": [
            "Ran Xu",
            "Yuchen Zhuang",
            "Zihan Dong",
            "Jonathan Wang",
            "Yue Yu",
            "Joyce C. Ho",
            "Linjun Zhang",
            "Haoyu Wang",
            "Wenqi Shi",
            "Carl Yang"
        ],
        "submitted": "2025-09-29 02:14:30",
        "source": "arxiv",
        "comment": "Accepted to NeurIPS 2025 (Spotlight)"
    },
    {
        "title": "PET: Preference Evolution Tracking with LLM-Generated Explainable Distribution",
        "abstract": "Understanding how user preference evolves over time is a fundamental\nchallenge central to modern digital ecosystems, for which Large Language Models\n(LLMs) are an increasingly prominent and popular approach due to their ability\nto comprehend the rich semantic context within behavioral data. A common\npractice is to use LLMs to predict a user's next action by directly generating\na ranked list of preferred items. Although effective for short-term prediction,\nthe end-to-end generation paradigm inherently limits personalization. Its\nopaque decision-making process obscures holistic user profiling and exacerbates\npopularity bias. To address these limitations, we propose Preference Evolution\nTracking (PET), a framework that reframes the task as inferring a dynamic\nprobability distribution over a stable and interpretable lattice of preference\nclusters. By applying logit-probing and generative classification techniques,\nPET infers a user's preference as a probability distribution, enabling\ntransparent preference learning. On public benchmarks (Yelp, MovieLens), PET\nimproves ranking quality by up to 40% in NDCG over direct generation baselines.\nOn a large-scale, real-world dataset from a short-video platform, it excels at\nranking long-tail contents, significantly outperforming a SOTA production model\nby 7 times in the NDCG score. Ultimately, PET transforms the user profile model\nfrom direct preference list generation to a transparent distributional\npreference mapping, paving the way for more explainable, fair, and diverse\npersonalization systems.",
        "url": "http://arxiv.org/abs/2509.24189v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24189v1",
        "arxiv_id": "2509.24189v1",
        "authors": [
            "Luyang Zhang",
            "Siyuan Peng",
            "Jialu Wang",
            "Shichao Zhu",
            "Beibei Li",
            "Zhongcun Wang",
            "Guangmou Pan",
            "Yan Li",
            "Song Yang"
        ],
        "submitted": "2025-09-29 02:09:15",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Beyond Overall Accuracy: A Psychometric Deep Dive into the Topic-Specific Medical Capabilities of 80 Large Language Models",
        "abstract": "As Large Language Models (LLMs) are increasingly proposed for high-stakes\nmedical applications, there has emerged a critical need for reliable and\naccurate evaluation methodologies. Traditional accuracy metrics fail\ninadequately as they neither capture question characteristics nor offer\ntopic-specific insights. To address this gap, we introduce \\textsc{MedIRT}, a\nrigorous evaluation framework grounded in Item Response Theory (IRT), the gold\nstandard in high-stakes educational testing. Unlike previous research relying\non archival data, we prospectively gathered fresh responses from 80 diverse\nLLMs on a balanced, 1,100-question USMLE-aligned benchmark. Using one\nunidimensional two-parameter logistic IRT model per topic, we estimate LLM's\nlatent model ability jointly with question difficulty and discrimination,\nyielding more stable and nuanced performance rankings than accuracy alone.\nNotably, we identify distinctive ``spiky'' ability profiles, where overall\nrankings can be misleading due to highly specialized model abilities. While\n\\texttt{GPT-5} was the top performer in a majority of domains (8 of 11), it was\noutperformed in Social Science and Communication by \\texttt{Claude-3-opus},\ndemonstrating that even an overall 23rd-ranked model can hold the top spot for\nspecific competencies. Furthermore, we demonstrate IRT's utility in auditing\nbenchmarks by identifying flawed questions. We synthesize these findings into a\npractical decision-support framework that integrates our multi-factor\ncompetency profiles with operational metrics. This work establishes a robust,\npsychometrically grounded methodology essential for the safe, effective, and\ntrustworthy deployment of LLMs in healthcare.",
        "url": "http://arxiv.org/abs/2509.24186v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24186v1",
        "arxiv_id": "2509.24186v1",
        "authors": [
            "Zhimeng Luo",
            "Lixin Wu",
            "Adam Frisch",
            "Daqing He"
        ],
        "submitted": "2025-09-29 02:06:13",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Retrieval-augmented GUI Agents with Generative Guidelines",
        "abstract": "GUI agents powered by vision-language models (VLMs) show promise in\nautomating complex digital tasks. However, their effectiveness in real-world\napplications is often limited by scarce training data and the inherent\ncomplexity of these tasks, which frequently require long-tailed knowledge\ncovering rare, unseen scenarios. We propose RAG-GUI , a lightweight VLM that\nleverages web tutorials at inference time. RAG-GUI is first warm-started via\nsupervised finetuning (SFT) and further refined through self-guided rejection\nsampling finetuning (RSF). Designed to be model-agnostic, RAG-GUI functions as\na generic plug-in that enhances any VLM-based agent. Evaluated across three\ndistinct tasks, it consistently outperforms baseline agents and surpasses other\ninference baselines by 2.6% to 13.3% across two model sizes, demonstrating\nstrong generalization and practical plug-and-play capabilities in real-world\nscenarios.",
        "url": "http://arxiv.org/abs/2509.24183v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24183v1",
        "arxiv_id": "2509.24183v1",
        "authors": [
            "Ran Xu",
            "Kaixin Ma",
            "Wenhao Yu",
            "Hongming Zhang",
            "Joyce C. Ho",
            "Carl Yang",
            "Dong Yu"
        ],
        "submitted": "2025-09-29 02:04:20",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025 (Main Conference)"
    },
    {
        "title": "Task Vectors, Learned Not Extracted: Performance Gains and Mechanistic Insight",
        "abstract": "Large Language Models (LLMs) can perform new tasks from in-context\ndemonstrations, a phenomenon known as in-context learning (ICL). Recent work\nsuggests that these demonstrations are compressed into task vectors (TVs),\ncompact task representations that LLMs exploit for predictions. However, prior\nstudies typically extract TVs from model outputs or hidden states using\ncumbersome and opaque methods, and they rarely elucidate the mechanisms by\nwhich TVs influence computation. In this work, we address both limitations.\nFirst, we propose directly training Learned Task Vectors (LTVs), which surpass\nextracted TVs in accuracy and exhibit superior flexibility-acting effectively\nat arbitrary layers, positions, and even with ICL prompts. Second, through\nsystematic analysis, we investigate the mechanistic role of TVs, showing that\nat the low level they steer predictions primarily through attention-head OV\ncircuits, with a small subset of \"key heads\" most decisive. At a higher level,\nwe find that despite Transformer nonlinearities, TV propagation is largely\nlinear: early TVs are rotated toward task-relevant subspaces to improve logits\nof relevant labels, while later TVs are predominantly scaled in magnitude.\nTaken together, LTVs not only provide a practical approach for obtaining\neffective TVs but also offer a principled lens into the mechanistic foundations\nof ICL.",
        "url": "http://arxiv.org/abs/2509.24169v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24169v1",
        "arxiv_id": "2509.24169v1",
        "authors": [
            "Haolin Yang",
            "Hakaze Cho",
            "Kaize Ding",
            "Naoya Inoue"
        ],
        "submitted": "2025-09-29 01:33:20",
        "source": "arxiv",
        "comment": "48 pages, 95 figures, 17 tables"
    },
    {
        "title": "Localizing Task Recognition and Task Learning in In-Context Learning via Attention Head Analysis",
        "abstract": "We investigate the mechanistic underpinnings of in-context learning (ICL) in\nlarge language models by reconciling two dominant perspectives: the\ncomponent-level analysis of attention heads and the holistic decomposition of\nICL into Task Recognition (TR) and Task Learning (TL). We propose a novel\nframework based on Task Subspace Logit Attribution (TSLA) to identify attention\nheads specialized in TR and TL, and demonstrate their distinct yet\ncomplementary roles. Through correlation analysis, ablation studies, and input\nperturbations, we show that the identified TR and TL heads independently and\neffectively capture the TR and TL components of ICL. Using steering experiments\nwith geometric analysis of hidden states, we reveal that TR heads promote task\nrecognition by aligning hidden states with the task subspace, while TL heads\nrotate hidden states within the subspace toward the correct label to facilitate\nprediction. We further show how previous findings on ICL mechanisms, including\ninduction heads and task vectors, can be reconciled with our\nattention-head-level analysis of the TR-TL decomposition. Our framework thus\nprovides a unified and interpretable account of how large language models\nexecute ICL across diverse tasks and settings.",
        "url": "http://arxiv.org/abs/2509.24164v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24164v1",
        "arxiv_id": "2509.24164v1",
        "authors": [
            "Haolin Yang",
            "Hakaze Cho",
            "Naoya Inoue"
        ],
        "submitted": "2025-09-29 01:28:37",
        "source": "arxiv",
        "comment": "45 pages, 88 figures, 10 tables"
    },
    {
        "title": "Reasoning or Retrieval? A Study of Answer Attribution on Large Reasoning Models",
        "abstract": "Large reasoning models (LRMs) exhibit unprecedented capabilities in solving\ncomplex problems through Chain-of-Thought (CoT) reasoning. However, recent\nstudies reveal that their final answers often contradict their own reasoning\ntraces. We hypothesize that this inconsistency stems from two competing\nmechanisms for generating answers: CoT reasoning and memory retrieval. To test\nthis hypothesis, we conduct controlled experiments that challenge LRMs with\nmisleading cues during reasoning and/or corrupted answers during retrieval. Our\nresults across models and datasets confirm that both mechanisms operate\nsimultaneously, with their relative dominance influenced by multiple factors:\nproblem domains, model scales, and fine-tuning approaches (e.g., reinforcement\nlearning vs. distillation). The findings reveal a critical limitation in\ncurrent reasoning fine-tuning paradigms: models can exploit the retrieval\nmechanism as a shortcut, effectively \"hacking\" the reward signal and\nundermining genuine reasoning development. To address this challenge, we\nintroduce FARL, a novel fine-tuning framework that integrates memory unlearning\nwith reinforcement learning. By carefully suppressing retrieval shortcuts\nduring the fine-tuning process, FARL promotes reasoning-dominant behavior and\nenhances generalizable reasoning capabilities.",
        "url": "http://arxiv.org/abs/2509.24156v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24156v1",
        "arxiv_id": "2509.24156v1",
        "authors": [
            "Yuhui Wang",
            "Changjiang Li",
            "Guangke Chen",
            "Jiacheng Liang",
            "Ting Wang"
        ],
        "submitted": "2025-09-29 01:13:33",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Your thoughts tell who you are: Characterize the reasoning patterns of LRMs",
        "abstract": "Current comparisons of large reasoning models (LRMs) focus on macro-level\nstatistics such as task accuracy or reasoning length. Whether different LRMs\nreason differently remains an open question. To address this gap, we introduce\nthe LLM-proposed Open Taxonomy (LOT), a classification method that uses a\ngenerative language model to compare reasoning traces from two LRMs and\narticulate their distinctive features in words. LOT then models how these\nfeatures predict the source LRM of a reasoning trace based on their empirical\ndistributions across LRM outputs. Iterating this process over a dataset of\nreasoning traces yields a human-readable taxonomy that characterizes how models\nthink. We apply LOT to compare the reasoning of 12 open-source LRMs on tasks in\nmath, science, and coding. LOT identifies systematic differences in their\nthoughts, achieving 80-100% accuracy in distinguishing reasoning traces from\nLRMs that differ in scale, base model family, or objective domain. Beyond\nclassification, LOT's natural-language taxonomy provides qualitative\nexplanations of how LRMs think differently. Finally, in a case study, we link\nthe reasoning differences to performance: aligning the reasoning style of\nsmaller Qwen3 models with that of the largest Qwen3 during test time improves\ntheir accuracy on GPQA by 3.3-5.7%.",
        "url": "http://arxiv.org/abs/2509.24147v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24147v1",
        "arxiv_id": "2509.24147v1",
        "authors": [
            "Yida Chen",
            "Yuning Mao",
            "Xianjun Yang",
            "Suyu Ge",
            "Shengjie Bi",
            "Lijuan Liu",
            "Saghar Hosseini",
            "Liang Tan",
            "Yixin Nie",
            "Shaoliang Nie"
        ],
        "submitted": "2025-09-29 00:52:07",
        "source": "arxiv",
        "comment": "32 pages, 28 figures"
    },
    {
        "title": "Generalist Scanner Meets Specialist Locator: A Synergistic Coarse-to-Fine Framework for Robust GUI Grounding",
        "abstract": "Grounding natural language queries in graphical user interfaces (GUIs)\npresents a challenging task that requires models to comprehend diverse UI\nelements across various applications and systems, while also accurately\npredicting the spatial coordinates for the intended operation. To tackle this\nproblem, we propose GMS: Generalist Scanner Meets Specialist Locator, a\nsynergistic coarse-to-fine framework that effectively improves GUI grounding\nperformance. GMS leverages the complementary strengths of general\nvision-language models (VLMs) and small, task-specific GUI grounding models by\nassigning them distinct roles within the framework. Specifically, the general\nVLM acts as a 'Scanner' to identify potential regions of interest, while the\nfine-tuned grounding model serves as a 'Locator' that outputs precise\ncoordinates within these regions. This design is inspired by how humans perform\nGUI grounding, where the eyes scan the interface and the brain focuses on\ninterpretation and localization. Our whole framework consists of five stages\nand incorporates hierarchical search with cross-modal communication to achieve\npromising prediction results. Experimental results on the ScreenSpot-Pro\ndataset show that while the 'Scanner' and 'Locator' models achieve only $2.0\\%$\nand $3.7\\%$ accuracy respectively when used independently, their integration\nwithin GMS framework yields an overall accuracy of $35.7\\%$, representing a $10\n\\times$ improvement. Additionally, GMS significantly outperforms other strong\nbaselines under various settings, demonstrating its robustness and potential\nfor general-purpose GUI grounding.",
        "url": "http://arxiv.org/abs/2509.24133v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24133v1",
        "arxiv_id": "2509.24133v1",
        "authors": [
            "Zhecheng Li",
            "Guoxian Song",
            "Yiwei Wang",
            "Zhen Xiong",
            "Junsong Yuan",
            "Yujun Cai"
        ],
        "submitted": "2025-09-29 00:06:31",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Beyond Magic Words: Sharpness-Aware Prompt Evolving for Robust Large Language Models with TARE",
        "abstract": "The performance of Large Language Models (LLMs) hinges on carefully\nengineered prompts. However, prevailing prompt optimization methods, ranging\nfrom heuristic edits and reinforcement learning to evolutionary search,\nprimarily target point-wise accuracy. They seldom enforce paraphrase invariance\nor searching stability, and therefore cannot remedy this brittleness in\npractice. Automated prompt search remains brittle: small, semantically\npreserving paraphrases often cause large performance swings. We identify this\nbrittleness as the textual sharpness of the prompt landscape. In this work, we\nprovide the first formal treatment of textual sharpness in the discrete,\nsemantic space of prompts, together with an operational robustness criterion\nover a semantic neighborhood; the design is black-box or API-only, requiring no\ngradients to update the model's parameters. Then we introduce TARE (Textual\nSharpness-Aware Evolving), a derivative-free framework that alternates between\nan inner, sampling-based adversarial search that stresses a prompt with hard\nparaphrases and an outer, robust selection that prefers candidates whose\nneighborhoods remain strong. We further propose ATARE, which learns anisotropic\nweights to shape the semantic neighborhood and adapts its radius over time to\nbalance exploration and fidelity. Diverse tasks evaluate our methods, whose\ndesign for minimizing textual sharpness gap leads to prompts that preserve\naccuracy under paraphrasing, outperforming accuracy-only prompt search while\nremaining computationally practical.",
        "url": "http://arxiv.org/abs/2509.24130v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24130v1",
        "arxiv_id": "2509.24130v1",
        "authors": [
            "Guancheng Wan",
            "Lucheng Fu",
            "Haoxin Liu",
            "Yiqiao Jin",
            "Hui Yi Leong",
            "Eric Hanchen Jiang",
            "Hejia Geng",
            "Jinhe Bi",
            "Yunpu Ma",
            "Xiangru Tang",
            "B. Aditya Prakash",
            "Yizhou Sun",
            "Wei Wang"
        ],
        "submitted": "2025-09-28 23:57:05",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "EduVidQA: Generating and Evaluating Long-form Answers to Student Questions based on Lecture Videos",
        "abstract": "As digital platforms redefine educational paradigms, ensuring interactivity\nremains vital for effective learning. This paper explores using Multimodal\nLarge Language Models (MLLMs) to automatically respond to student questions\nfrom online lectures - a novel question answering task of real world\nsignificance. We introduce the EduVidQA Dataset with 5252 question-answer pairs\n(both synthetic and real-world) from 296 computer science videos covering\ndiverse topics and difficulty levels. To understand the needs of the dataset\nand task evaluation, we empirically study the qualitative preferences of\nstudents, which we provide as an important contribution to this line of work.\nOur benchmarking experiments consist of 6 state-of-the-art MLLMs, through which\nwe study the effectiveness of our synthetic data for finetuning, as well as\nshowing the challenging nature of the task. We evaluate the models using both\ntext-based and qualitative metrics, thus showing a nuanced perspective of the\nmodels' performance, which is paramount to future work. This work not only sets\na benchmark for this important problem, but also opens exciting avenues for\nfuture research in the field of Natural Language Processing for Education.",
        "url": "http://arxiv.org/abs/2509.24120v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24120v1",
        "arxiv_id": "2509.24120v1",
        "authors": [
            "Sourjyadip Ray",
            "Shubham Sharma",
            "Somak Aditya",
            "Pawan Goyal"
        ],
        "submitted": "2025-09-28 23:33:58",
        "source": "arxiv",
        "comment": "EMNLP 2025 (Main)"
    },
    {
        "title": "Dual-Scale World Models for LLM Agents Towards Hard-Exploration Problems",
        "abstract": "LLM-based agents have seen promising advances, yet they are still limited in\n\"hard-exploration\" tasks requiring learning new knowledge through exploration.\nWe present GLoW, a novel approach leveraging dual-scale world models,\nmaintaining a trajectory frontier of high-value discoveries at the global\nscale, while learning from local trial-and-error in exploration through a\nMulti-path Advantage Reflection mechanism which infers advantage-based progress\nsignals to guide exploration. To evaluate our framework for hard-exploration,\nwe tackle the Jericho benchmark suite of text-based games, where GLoW achieves\na new state-of-theart performance for LLM-based approaches. Compared to\nstate-of-the-art RLbased methods, our approach achieves comparable performance\nwhile requiring 100-800x fewer environment interactions.",
        "url": "http://arxiv.org/abs/2509.24116v2",
        "pdf_url": "http://arxiv.org/pdf/2509.24116v2",
        "arxiv_id": "2509.24116v2",
        "authors": [
            "Minsoo Kim",
            "Seung-won Hwang"
        ],
        "submitted": "2025-09-28 23:19:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Pragmatic Inference for Moral Reasoning Acquisition: Generalization via Distributional Semantics",
        "abstract": "Moral reasoning has emerged as a promising research direction for Large\nLanguage Models (LLMs), yet achieving generalization remains a central\nchallenge. From a linguistic standpoint, this difficulty arises because LLMs\nare adept at capturing distributional semantics, which fundamentally differs\nfrom the morals which operate at the pragmatic level. This paper investigates\nhow LLMs can achieve generalized moral reasoning despite their reliance on\ndistributional semantics. We propose pragmatic inference methods grounded in\nmoral foundations theory, which leverage contextual information at each step to\nbridge the pragmatic gap and guide LLMs in connecting moral foundations with\nmoral reasoning objectives. Experimental results demonstrate that our approach\nsignificantly enhances LLMs' generalization in moral reasoning, providing a\nfoundation for future research grounded in moral foundations theory.",
        "url": "http://arxiv.org/abs/2509.24102v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24102v1",
        "arxiv_id": "2509.24102v1",
        "authors": [
            "Guangliang Liu",
            "Xi Chen",
            "Bocheng Chen",
            "Xitong Zhang",
            "Kristen Johnson"
        ],
        "submitted": "2025-09-28 22:40:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "BTC-SAM: Leveraging LLMs for Generation of Bias Test Cases for Sentiment Analysis Models",
        "abstract": "Sentiment Analysis (SA) models harbor inherent social biases that can be\nharmful in real-world applications. These biases are identified by examining\nthe output of SA models for sentences that only vary in the identity groups of\nthe subjects. Constructing natural, linguistically rich, relevant, and diverse\nsets of sentences that provide sufficient coverage over the domain is\nexpensive, especially when addressing a wide range of biases: it requires\ndomain experts and/or crowd-sourcing. In this paper, we present a novel bias\ntesting framework, BTC-SAM, which generates high-quality test cases for bias\ntesting in SA models with minimal specification using Large Language Models\n(LLMs) for the controllable generation of test sentences. Our experiments show\nthat relying on LLMs can provide high linguistic variation and diversity in the\ntest sentences, thereby offering better test coverage compared to base\nprompting methods even for previously unseen biases.",
        "url": "http://arxiv.org/abs/2509.24101v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24101v1",
        "arxiv_id": "2509.24101v1",
        "authors": [
            "Zsolt T. Kardkovács",
            "Lynda Djennane",
            "Anna Field",
            "Boualem Benatallah",
            "Yacine Gaci",
            "Fabio Casati",
            "Walid Gaaloul"
        ],
        "submitted": "2025-09-28 22:39:40",
        "source": "arxiv",
        "comment": "Accepted at EMNLP 2025 main conference"
    },
    {
        "title": "GEAR: A General Evaluation Framework for Abductive Reasoning",
        "abstract": "Since the advent of large language models (LLMs), research has focused on\ninstruction following and deductive reasoning. A central question remains: can\nthese models discover new knowledge, and how can we evaluate this ability? We\naddress this by studying abductive reasoning-the generation of plausible\nhypotheses to explain observations-and introduce GEAR (General Evaluation for\nAbductive Reasoning), a general-purpose, fully automated, transparent, and\nlabel-free evaluation paradigm. GEAR scores hypothesis sets by three metrics:\nconsistency (each hypothesis explains the observations), generalizability\n(consistent hypotheses make meaningful predictions on unseen inputs), and\ndiversity (the set covers distinct predictions and patterns). Built this way,\nGEAR is scalable (no human gold answers), reliable (deterministic scoring\naligned with classical abduction), and open-ended (scores improve only when\nmodels produce new plausible hypotheses, unlike static benchmarks that saturate\nonce accuracy is high). Using GEAR, we conduct a fine-grained study of nine\nLLMs on four abduction benchmarks with 1,500 problems, generating over 50,000\ncandidate hypotheses and revealing model differences obscured by gold-answer or\npurely human evaluations. We further propose a momentum-based curriculum that\nadjusts GEAR-derived training data by learning velocity: it starts with what\nthe model learns quickly and shifts toward harder objectives such as generating\ndiverse hypotheses once the model is confident on foundational objectives.\nWithout gold-label supervision, this strategy improves all GEAR objectives and\nthese gains transfer to established abductive reasoning benchmarks. Taken\ntogether, GEAR provides a principled framework that evaluates abduction and\nsupplies label-free, scalable training signals that help LLMs produce more\ndiverse and reliable hypotheses.",
        "url": "http://arxiv.org/abs/2509.24096v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24096v1",
        "arxiv_id": "2509.24096v1",
        "authors": [
            "Kaiyu He",
            "Peilin Wu",
            "Mian Zhang",
            "Kun Wan",
            "Wentian Zhao",
            "Xinya Du",
            "Zhiyu Chen"
        ],
        "submitted": "2025-09-28 22:22:28",
        "source": "arxiv",
        "comment": "Coda and Data:\n  https://github.com/KaiyuHe998/GEAR-Abduction_evaluation"
    },
    {
        "title": "Large-Scale Constraint Generation -- Can LLMs Parse Hundreds of Constraints?",
        "abstract": "Recent research has explored the constrained generation capabilities of Large\nLanguage Models (LLMs) when explicitly prompted by few task-specific\nrequirements. In contrast, we introduce Large-Scale Constraint Generation\n(LSCG), a new problem that evaluates whether LLMs can parse a large,\nfine-grained, generic list of constraints. To examine the LLMs' ability to\nhandle an increasing number constraints, we create a practical instance of\nLSCG, called Words Checker. In Words Checker, we evaluate the impact of model\ncharacteristics (e.g., size, family) and steering techniques (e.g., Simple\nPrompt, Chain of Thought, Best of N) on performance. We also propose FoCusNet,\na small and dedicated model that parses the original list of constraints into a\nsmaller subset, helping the LLM focus on relevant constraints. Experiments\nreveal that existing solutions suffer a significant performance drop as the\nnumber of constraints increases, with FoCusNet showing an 8-13% accuracy boost.",
        "url": "http://arxiv.org/abs/2509.24090v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24090v1",
        "arxiv_id": "2509.24090v1",
        "authors": [
            "Matteo Boffa",
            "Jiaxuan You"
        ],
        "submitted": "2025-09-28 21:55:53",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Do Repetitions Matter? Strengthening Reliability in LLM Evaluations",
        "abstract": "LLM leaderboards often rely on single stochastic runs, but how many\nrepetitions are required for reliable conclusions remains unclear. We\nre-evaluate eight state-of-the-art models on the AI4Math Benchmark with three\nindependent runs per setting. Using mixed-effects logistic regression,\ndomain-level marginal means, rank-instability analysis, and run-to-run\nreliability, we assessed the value of additional repetitions. Our findings\nshows that Single-run leaderboards are brittle: 10/12 slices (83\\%) invert at\nleast one pairwise rank relative to the three-run majority, despite a zero\nsign-flip rate for pairwise significance and moderate overall interclass\ncorrelation. Averaging runs yields modest SE shrinkage ($\\sim$5\\% from one to\nthree) but large ranking gains; two runs remove $\\sim$83\\% of single-run\ninversions. We provide cost-aware guidance for practitioners: treat evaluation\nas an experiment, report uncertainty, and use $\\geq 2$ repetitions under\nstochastic decoding. These practices improve robustness while remaining\nfeasible for small teams and help align model comparisons with real-world\nreliability.",
        "url": "http://arxiv.org/abs/2509.24086v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24086v1",
        "arxiv_id": "2509.24086v1",
        "authors": [
            "Miguel Angel Alvarado Gonzalez",
            "Michelle Bruno Hernandez",
            "Miguel Angel Peñaloza Perez",
            "Bruno Lopez Orozco",
            "Jesus Tadeo Cruz Soto",
            "Sandra Malagon"
        ],
        "submitted": "2025-09-28 21:45:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Ensembling Multilingual Transformers for Robust Sentiment Analysis of Tweets",
        "abstract": "Sentiment analysis is a very important natural language processing activity\nin which one identifies the polarity of a text, whether it conveys positive,\nnegative, or neutral sentiment. Along with the growth of social media and the\nInternet, the significance of sentiment analysis has grown across numerous\nindustries such as marketing, politics, and customer service. Sentiment\nanalysis is flawed, however, when applied to foreign languages, particularly\nwhen there is no labelled data to train models upon. In this study, we present\na transformer ensemble model and a large language model (LLM) that employs\nsentiment analysis of other languages. We used multi languages dataset.\nSentiment was then assessed for sentences using an ensemble of pre-trained\nsentiment analysis models: bert-base-multilingual-uncased-sentiment, and XLM-R.\nOur experimental results indicated that sentiment analysis performance was more\nthan 86% using the proposed method.",
        "url": "http://arxiv.org/abs/2509.24080v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24080v1",
        "arxiv_id": "2509.24080v1",
        "authors": [
            "Meysam Shirdel Bilehsavar",
            "Negin Mahmoudi",
            "Mohammad Jalili Torkamani",
            "Kiana Kiashemshaki"
        ],
        "submitted": "2025-09-28 21:34:48",
        "source": "arxiv",
        "comment": "19 pages, 4 figures, 2 tables"
    },
    {
        "title": "ResFormer: All-Time Reservoir Memory for Long Sequence Classification",
        "abstract": "Sequence classification is essential in NLP for understanding and\ncategorizing language patterns in tasks like sentiment analysis, intent\ndetection, and topic classification. Transformer-based models, despite\nachieving state-of-the-art performance, have inherent limitations due to\nquadratic time and memory complexity, restricting their input length. Although\nextensive efforts have aimed at reducing computational demands, processing\nextensive contexts remains challenging.\n  To overcome these limitations, we propose ResFormer, a novel neural network\narchitecture designed to model varying context lengths efficiently through a\ncascaded methodology. ResFormer integrates an reservoir computing network\nfeaturing a nonlinear readout to effectively capture long-term contextual\ndependencies in linear time. Concurrently, short-term dependencies within\nsentences are modeled using a conventional Transformer architecture with\nfixed-length inputs.\n  Experiments demonstrate that ResFormer significantly outperforms baseline\nmodels of DeepSeek-Qwen and ModernBERT, delivering an accuracy improvement of\nup to +22.3% on the EmoryNLP dataset and consistent gains on MultiWOZ, MELD,\nand IEMOCAP. In addition, ResFormer exhibits reduced memory consumption,\nunderscoring its effectiveness and efficiency in modeling extensive contextual\ninformation.",
        "url": "http://arxiv.org/abs/2509.24074v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24074v1",
        "arxiv_id": "2509.24074v1",
        "authors": [
            "Hongbo Liu",
            "Jia Xu"
        ],
        "submitted": "2025-09-28 21:20:49",
        "source": "arxiv",
        "comment": "Accepted at EMNLP 2025. To appear in the proceedings"
    },
    {
        "title": "The Role of Logic and Automata in Understanding Transformers",
        "abstract": "The advent of transformers has in recent years led to powerful and\nrevolutionary Large Language Models (LLMs). Despite this, our understanding on\nthe capability of transformers is still meager. In this invited contribution,\nwe recount the rapid progress in the last few years to the question of what\ntransformers can do. In particular, we will see the integral role of logic and\nautomata (also with some help from circuit complexity) in answering this\nquestion. We also mention several open problems at the intersection of logic,\nautomata, verification and transformers.",
        "url": "http://arxiv.org/abs/2509.24024v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24024v1",
        "arxiv_id": "2509.24024v1",
        "authors": [
            "Anthony W. Lin",
            "Pablo Barcelo"
        ],
        "submitted": "2025-09-28 18:34:30",
        "source": "arxiv",
        "comment": "Preprint of invited paper for RP'25"
    },
    {
        "title": "SparseD: Sparse Attention for Diffusion Language Models",
        "abstract": "While diffusion language models (DLMs) offer a promising alternative to\nautoregressive models (ARs), existing open-source DLMs suffer from high\ninference latency. This bottleneck is mainly due to the attention's quadratic\ncomplexity with respect to context length in computing all query-key pairs.\nIntuitively, to reduce this complexity, a natural strategy is to restrict\nattention to sparse patterns that retain only the most relevant connections.\nSuch approaches are well-established in ARs, where attention follows fixed and\nclearly defined sparse patterns. However, in DLMs, we observe distinct sparsity\nbehaviors: (1) attention patterns vary across heads, (2) attention patterns in\neach head remain highly similar across denoising steps, and (3) early denoising\nsteps are critical for generation. These findings render sparse attention\nmethods designed for ARs largely incompatible with DLMs, as they fail to\ncapture head-specific structures and risk degrading generation when applied in\nearly denoising steps. To address these challenges, we propose SparseD, a novel\nsparse attention method for DLMs. Leveraging the observations, SparseD only\nrequires pre-computing head-specific sparse patterns one time, and reuses them\nacross all steps. This prevents recomputing sparse patterns at each denoising\nstep. Meanwhile, SparseD uses full attention in the early steps, then switches\nto sparse attention later to maintain generation quality. Together, these\nestablish SparseD as a practical and efficient solution for deploying DLMs in\nlong-context applications. Experimental results demonstrate that SparseD\nachieves lossless acceleration, delivering up to $1.50\\times$ speedup over\nFlashAttention at a 64k context length with 1,024 denoising steps.",
        "url": "http://arxiv.org/abs/2509.24014v1",
        "pdf_url": "http://arxiv.org/pdf/2509.24014v1",
        "arxiv_id": "2509.24014v1",
        "authors": [
            "Zeqing Wang",
            "Gongfan Fang",
            "Xinyin Ma",
            "Xingyi Yang",
            "Xinchao Wang"
        ],
        "submitted": "2025-09-28 18:10:10",
        "source": "arxiv",
        "comment": "The code is available at https://github.com/INV-WZQ/SparseD"
    }
]