[
    {
        "title": "Multi-Agent-as-Judge: Aligning LLM-Agent-Based Automated Evaluation with Multi-Dimensional Human Evaluation",
        "abstract": "Nearly all human work is collaborative; thus, the evaluation of real-world\nNLP applications often requires multiple dimensions that align with diverse\nhuman perspectives. As real human evaluator resources are often scarce and\ncostly, the emerging \"LLM-as-a-judge\" paradigm sheds light on a promising\napproach to leverage LLM agents to believably simulate human evaluators. Yet,\nto date, existing LLM-as-a-judge approaches face two limitations: persona\ndescriptions of agents are often arbitrarily designed, and the frameworks are\nnot generalizable to other tasks. To address these challenges, we propose\nMAJ-EVAL, a Multi-Agent-as-Judge evaluation framework that can automatically\nconstruct multiple evaluator personas with distinct dimensions from relevant\ntext documents (e.g., research papers), instantiate LLM agents with the\npersonas, and engage in-group debates with multi-agents to Generate\nmulti-dimensional feedback. Our evaluation experiments in both the educational\nand medical domains demonstrate that MAJ-EVAL can generate evaluation results\nthat better align with human experts' ratings compared with conventional\nautomated evaluation metrics and existing LLM-as-a-judge methods.",
        "url": "http://arxiv.org/abs/2507.21028v1",
        "pdf_url": "http://arxiv.org/pdf/2507.21028v1",
        "arxiv_id": "2507.21028v1",
        "authors": [
            "Jiaju Chen",
            "Yuxuan Lu",
            "Xiaojie Wang",
            "Huimin Zeng",
            "Jing Huang",
            "Jiri Gesi",
            "Ying Xu",
            "Bingsheng Yao",
            "Dakuo Wang"
        ],
        "submitted": "2025-07-28 17:48:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Memorization in Fine-Tuned Large Language Models",
        "abstract": "This study investigates the mechanisms and factors influencing memorization\nin fine-tuned large language models (LLMs), with a focus on the medical domain\ndue to its privacy-sensitive nature. We examine how different aspects of the\nfine-tuning process affect a model's propensity to memorize training data,\nusing the PHEE dataset of pharmacovigilance events.\n  Our research employs two main approaches: a membership inference attack to\ndetect memorized data, and a generation task with prompted prefixes to assess\nverbatim reproduction. We analyze the impact of adapting different weight\nmatrices in the transformer architecture, the relationship between perplexity\nand memorization, and the effect of increasing the rank in low-rank adaptation\n(LoRA) fine-tuning.\n  Key findings include: (1) Value and Output matrices contribute more\nsignificantly to memorization compared to Query and Key matrices; (2) Lower\nperplexity in the fine-tuned model correlates with increased memorization; (3)\nHigher LoRA ranks lead to increased memorization, but with diminishing returns\nat higher ranks.\n  These results provide insights into the trade-offs between model performance\nand privacy risks in fine-tuned LLMs. Our findings have implications for\ndeveloping more effective and responsible strategies for adapting large\nlanguage models while managing data privacy concerns.",
        "url": "http://arxiv.org/abs/2507.21009v1",
        "pdf_url": "http://arxiv.org/pdf/2507.21009v1",
        "arxiv_id": "2507.21009v1",
        "authors": [
            "Danil Savine",
            "Muni Sreenivas Pydi",
            "Jamal Atif",
            "Olivier Cappé"
        ],
        "submitted": "2025-07-28 17:22:10",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LoRA-PAR: A Flexible Dual-System LoRA Partitioning Approach to Efficient LLM Fine-Tuning",
        "abstract": "Large-scale generative models like DeepSeek-R1 and OpenAI-O1 benefit\nsubstantially from chain-of-thought (CoT) reasoning, yet pushing their\nperformance typically requires vast data, large model sizes, and full-parameter\nfine-tuning. While parameter-efficient fine-tuning (PEFT) helps reduce cost,\nmost existing approaches primarily address domain adaptation or layer-wise\nallocation rather than explicitly tailoring data and parameters to different\nresponse demands. Inspired by \"Thinking, Fast and Slow,\" which characterizes\ntwo distinct modes of thought-System 1 (fast, intuitive, often automatic) and\nSystem 2 (slower, more deliberative and analytic)-we draw an analogy that\ndifferent \"subregions\" of an LLM's parameters might similarly specialize for\ntasks that demand quick, intuitive responses versus those requiring multi-step\nlogical reasoning. Therefore, we propose LoRA-PAR, a dual-system LoRA framework\nthat partitions both data and parameters by System 1 or System 2 demands, using\nfewer yet more focused parameters for each task. Specifically, we classify task\ndata via multi-model role-playing and voting, and partition parameters based on\nimportance scoring, then adopt a two-stage fine-tuning strategy of training\nSystem 1 tasks with supervised fine-tuning (SFT) to enhance knowledge and\nintuition and refine System 2 tasks with reinforcement learning (RL) to\nreinforce deeper logical deliberation next. Extensive experiments show that the\ntwo-stage fine-tuning strategy, SFT and RL, lowers active parameter usage while\nmatching or surpassing SOTA PEFT baselines.",
        "url": "http://arxiv.org/abs/2507.20999v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20999v1",
        "arxiv_id": "2507.20999v1",
        "authors": [
            "Yining Huang",
            "Bin Li",
            "Keke Tang",
            "Meilian Chen"
        ],
        "submitted": "2025-07-28 17:11:26",
        "source": "arxiv",
        "comment": "10 pages"
    },
    {
        "title": "Your AI, Not Your View: The Bias of LLMs in Investment Analysis",
        "abstract": "In finance, Large Language Models (LLMs) face frequent knowledge conflicts\ndue to discrepancies between pre-trained parametric knowledge and real-time\nmarket data. These conflicts become particularly problematic when LLMs are\ndeployed in real-world investment services, where misalignment between a\nmodel's embedded preferences and those of the financial institution can lead to\nunreliable recommendations. Yet little research has examined what investment\nviews LLMs actually hold. We propose an experimental framework to investigate\nsuch conflicts, offering the first quantitative analysis of confirmation bias\nin LLM-based investment analysis. Using hypothetical scenarios with balanced\nand imbalanced arguments, we extract models' latent preferences and measure\ntheir persistence. Focusing on sector, size, and momentum, our analysis reveals\ndistinct, model-specific tendencies. In particular, we observe a consistent\npreference for large-cap stocks and contrarian strategies across most models.\nThese preferences often harden into confirmation bias, with models clinging to\ninitial judgments despite counter-evidence.",
        "url": "http://arxiv.org/abs/2507.20957v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20957v1",
        "arxiv_id": "2507.20957v1",
        "authors": [
            "Hoyoung Lee",
            "Junhyuk Seo",
            "Suhwan Park",
            "Junhyeong Lee",
            "Wonbin Ahn",
            "Chanyeol Choi",
            "Alejandro Lopez-Lira",
            "Yongjae Lee"
        ],
        "submitted": "2025-07-28 16:09:38",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Mind the Gap: Conformative Decoding to Improve Output Diversity of Instruction-Tuned Large Language Models",
        "abstract": "Instruction-tuning large language models (LLMs) reduces the diversity of\ntheir outputs, which has implications for many tasks, particularly for creative\ntasks. This paper investigates the ``diversity gap'' for a writing prompt\nnarrative generation task. This gap emerges as measured by current diversity\nmetrics for various open-weight and open-source LLMs. The results show\nsignificant decreases in diversity due to instruction-tuning. We explore the\ndiversity loss at each fine-tuning stage for the OLMo and OLMo 2 models to\nfurther understand how output diversity is affected. The results indicate that\nDPO has the most substantial impact on diversity. Motivated by these findings,\nwe present a new decoding strategy, conformative decoding, which guides an\ninstruct model using its more diverse base model to reintroduce output\ndiversity. We show that conformative decoding typically increases diversity and\neven maintains or improves quality.",
        "url": "http://arxiv.org/abs/2507.20956v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20956v1",
        "arxiv_id": "2507.20956v1",
        "authors": [
            "Max Peeperkorn",
            "Tom Kouwenhoven",
            "Dan Brown",
            "Anna Jordanous"
        ],
        "submitted": "2025-07-28 16:04:25",
        "source": "arxiv",
        "comment": "9 pages, 3 figures"
    },
    {
        "title": "Dissecting Persona-Driven Reasoning in Language Models via Activation Patching",
        "abstract": "Large language models (LLMs) exhibit remarkable versatility in adopting\ndiverse personas. In this study, we examine how assigning a persona influences\na model's reasoning on an objective task. Using activation patching, we take a\nfirst step toward understanding how key components of the model encode\npersona-specific information. Our findings reveal that the early Multi-Layer\nPerceptron (MLP) layers attend not only to the syntactic structure of the input\nbut also process its semantic content. These layers transform persona tokens\ninto richer representations, which are then used by the middle Multi-Head\nAttention (MHA) layers to shape the model's output. Additionally, we identify\nspecific attention heads that disproportionately attend to racial and\ncolor-based identities.",
        "url": "http://arxiv.org/abs/2507.20936v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20936v1",
        "arxiv_id": "2507.20936v1",
        "authors": [
            "Ansh Poonia",
            "Maeghal Jain"
        ],
        "submitted": "2025-07-28 15:45:31",
        "source": "arxiv",
        "comment": "11 pages"
    },
    {
        "title": "FRED: Financial Retrieval-Enhanced Detection and Editing of Hallucinations in Language Models",
        "abstract": "Hallucinations in large language models pose a critical challenge for\napplications requiring factual reliability, particularly in high-stakes domains\nsuch as finance. This work presents an effective approach for detecting and\nediting factually incorrect content in model-generated responses based on the\nprovided context. Given a user-defined domain-specific error taxonomy, we\nconstruct a synthetic dataset by inserting tagged errors into financial\nquestion-answering corpora and then fine-tune four language models, Phi-4,\nPhi-4-mini, Qwen3-4B, and Qwen3-14B, to detect and edit these factual\ninaccuracies. Our best-performing model, fine-tuned Phi-4, achieves an 8%\nimprovement in binary F1 score and a 30% gain in overall detection performance\ncompared to OpenAI-o3. Notably, our fine-tuned Phi-4-mini model, despite having\nonly 4 billion parameters, maintains competitive performance with just a 2%\ndrop in binary detection and a 0.1% decline in overall detection compared to\nOpenAI-o3. Our work provides a practical solution for detecting and editing\nfactual inconsistencies in financial text generation while introducing a\ngeneralizable framework that can enhance the trustworthiness and alignment of\nlarge language models across diverse applications beyond finance. Our code and\ndata are available at https://github.com/pegasi-ai/fine-grained-editting.",
        "url": "http://arxiv.org/abs/2507.20930v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20930v1",
        "arxiv_id": "2507.20930v1",
        "authors": [
            "Likun Tan",
            "Kuan-Wei Huang",
            "Kevin Wu"
        ],
        "submitted": "2025-07-28 15:41:53",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "FHSTP@EXIST 2025 Benchmark: Sexism Detection with Transparent Speech Concept Bottleneck Models",
        "abstract": "Sexism has become widespread on social media and in online conversation. To\nhelp address this issue, the fifth Sexism Identification in Social Networks\n(EXIST) challenge is initiated at CLEF 2025. Among this year's international\nbenchmarks, we concentrate on solving the first task aiming to identify and\nclassify sexism in social media textual posts. In this paper, we describe our\nsolutions and report results for three subtasks: Subtask 1.1 - Sexism\nIdentification in Tweets, Subtask 1.2 - Source Intention in Tweets, and Subtask\n1.3 - Sexism Categorization in Tweets. We implement three models to address\neach subtask which constitute three individual runs: Speech Concept Bottleneck\nModel (SCBM), Speech Concept Bottleneck Model with Transformer (SCBMT), and a\nfine-tuned XLM-RoBERTa transformer model. SCBM uses descriptive adjectives as\nhuman-interpretable bottleneck concepts. SCBM leverages large language models\n(LLMs) to encode input texts into a human-interpretable representation of\nadjectives, then used to train a lightweight classifier for downstream tasks.\nSCBMT extends SCBM by fusing adjective-based representation with contextual\nembeddings from transformers to balance interpretability and classification\nperformance. Beyond competitive results, these two models offer fine-grained\nexplanations at both instance (local) and class (global) levels. We also\ninvestigate how additional metadata, e.g., annotators' demographic profiles,\ncan be leveraged. For Subtask 1.1, XLM-RoBERTa, fine-tuned on provided data\naugmented with prior datasets, ranks 6th for English and Spanish and 4th for\nEnglish in the Soft-Soft evaluation. Our SCBMT achieves 7th for English and\nSpanish and 6th for Spanish.",
        "url": "http://arxiv.org/abs/2507.20924v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20924v1",
        "arxiv_id": "2507.20924v1",
        "authors": [
            "Roberto Labadie-Tamayo",
            "Adrian Jaques Böck",
            "Djordje Slijepčević",
            "Xihui Chen",
            "Andreas Babic",
            "Matthias Zeppelzauer"
        ],
        "submitted": "2025-07-28 15:30:17",
        "source": "arxiv",
        "comment": "12 pages"
    },
    {
        "title": "Modeling User Behavior from Adaptive Surveys with Supplemental Context",
        "abstract": "Modeling user behavior is critical across many industries where understanding\npreferences, intent, or decisions informs personalization, targeting, and\nstrategic outcomes. Surveys have long served as a classical mechanism for\ncollecting such behavioral data due to their interpretability, structure, and\nease of deployment. However, surveys alone are inherently limited by user\nfatigue, incomplete responses, and practical constraints on their length making\nthem insufficient for capturing user behavior. In this work, we present LANTERN\n(Late-Attentive Network for Enriched Response Modeling), a modular architecture\nfor modeling user behavior by fusing adaptive survey responses with\nsupplemental contextual signals. We demonstrate the architectural value of\nmaintaining survey primacy through selective gating, residual connections and\nlate fusion via cross-attention, treating survey data as the primary signal\nwhile incorporating external modalities only when relevant. LANTERN outperforms\nstrong survey-only baselines in multi-label prediction of survey responses. We\nfurther investigate threshold sensitivity and the benefits of selective\nmodality reliance through ablation and rare/frequent attribute analysis.\nLANTERN's modularity supports scalable integration of new encoders and evolving\ndatasets. This work provides a practical and extensible blueprint for behavior\nmodeling in survey-centric applications.",
        "url": "http://arxiv.org/abs/2507.20919v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20919v1",
        "arxiv_id": "2507.20919v1",
        "authors": [
            "Aman Shukla",
            "Daniel Patrick Scantlebury",
            "Rishabh Kumar"
        ],
        "submitted": "2025-07-28 15:19:54",
        "source": "arxiv",
        "comment": "Best Paper, NewInML @ ICML 2025"
    },
    {
        "title": "MediQAl: A French Medical Question Answering Dataset for Knowledge and Reasoning Evaluation",
        "abstract": "This work introduces MediQAl, a French medical question answering dataset\ndesigned to evaluate the capabilities of language models in factual medical\nrecall and reasoning over real-world clinical scenarios. MediQAl contains\n32,603 questions sourced from French medical examinations across 41 medical\nsubjects. The dataset includes three tasks: (i) Multiple-Choice Question with\nUnique answer, (ii) Multiple-Choice Question with Multiple answer, and (iii)\nOpen-Ended Question with Short-Answer. Each question is labeled as\nUnderstanding or Reasoning, enabling a detailed analysis of models' cognitive\ncapabilities. We validate the MediQAl dataset through extensive evaluation with\n14 large language models, including recent reasoning-augmented models, and\nobserve a significant performance gap between factual recall and reasoning\ntasks. Our evaluation provides a comprehensive benchmark for assessing language\nmodels' performance on French medical question answering, addressing a crucial\ngap in multilingual resources for the medical domain.",
        "url": "http://arxiv.org/abs/2507.20917v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20917v1",
        "arxiv_id": "2507.20917v1",
        "authors": [
            "Adrien Bazoge"
        ],
        "submitted": "2025-07-28 15:17:48",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Soft Injection of Task Embeddings Outperforms Prompt-Based In-Context Learning",
        "abstract": "In-Context Learning (ICL) enables Large Language Models (LLMs) to perform\ntasks by conditioning on input-output examples in the prompt, without requiring\nany update in model parameters. While widely adopted, it remains unclear\nwhether prompting with multiple examples is the most effective and efficient\nway to convey task information. In this work, we propose Soft Injection of task\nembeddings. The task embeddings are constructed only once using few-shot ICL\nprompts and repeatedly used during inference. Soft injection is performed by\nsoftly mixing task embeddings with attention head activations using\npre-optimized mixing parameters, referred to as soft head-selection parameters.\nThis method not only allows a desired task to be performed without in-prompt\ndemonstrations but also significantly outperforms existing ICL approaches while\nreducing memory usage and compute cost at inference time. An extensive\nevaluation is performed across 57 tasks and 12 LLMs, spanning four model\nfamilies of sizes from 4B to 70B. Averaged across 57 tasks, our method\noutperforms 10-shot ICL by 10.2%-14.3% across 12 LLMs. Additional analyses show\nthat our method also serves as an insightful tool for analyzing task-relevant\nroles of attention heads, revealing that task-relevant head positions selected\nby our method transfer across similar tasks but not across dissimilar ones --\nunderscoring the task-specific nature of head functionality. Our soft injection\nmethod opens a new paradigm for reducing prompt length and improving task\nperformance by shifting task conditioning from the prompt space to the\nactivation space.",
        "url": "http://arxiv.org/abs/2507.20906v2",
        "pdf_url": "http://arxiv.org/pdf/2507.20906v2",
        "arxiv_id": "2507.20906v2",
        "authors": [
            "Jungwon Park",
            "Wonjong Rhee"
        ],
        "submitted": "2025-07-28 14:59:17",
        "source": "arxiv",
        "comment": "Preprint"
    },
    {
        "title": "$A^2R^2$: Advancing Img2LaTeX Conversion via Visual Reasoning with Attention-Guided Refinement",
        "abstract": "Img2LaTeX is a practically significant task that involves converting\nmathematical expressions or tabular data from images into LaTeX code. In recent\nyears, vision-language models (VLMs) have demonstrated strong performance\nacross a variety of visual understanding tasks, owing to their generalization\ncapabilities. While some studies have explored the use of VLMs for the\nImg2LaTeX task, their performance often falls short of expectations.\nEmpirically, VLMs sometimes struggle with fine-grained visual elements, leading\nto inaccurate LaTeX predictions. To address this challenge, we propose\n$A^2R^2$: Advancing Img2LaTeX Conversion via Visual Reasoning with\nAttention-Guided Refinement, a framework that effectively integrates attention\nlocalization and iterative refinement within a visual reasoning framework,\nenabling VLMs to perform self-correction and progressively improve prediction\nquality. For effective evaluation, we introduce a new dataset,\nImg2LaTex-Hard-1K, consisting of 1,100 carefully curated and challenging\nexamples designed to rigorously evaluate the capabilities of VLMs within this\ntask domain. Extensive experimental results demonstrate that: (1) $A^2R^2$\nsignificantly improves model performance across six evaluation metrics spanning\nboth textual and visual levels, consistently outperforming other baseline\nmethods; (2) Increasing the number of inference rounds yields notable\nperformance gains, underscoring the potential of $A^2R^2$ in test-time scaling\nscenarios; (3) Ablation studies and human evaluations validate the practical\neffectiveness of our approach, as well as the strong synergy among its core\ncomponents during inference.",
        "url": "http://arxiv.org/abs/2507.20890v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20890v1",
        "arxiv_id": "2507.20890v1",
        "authors": [
            "Zhecheng Li",
            "Guoxian Song",
            "Yiwei Wang",
            "Zhen Xiong",
            "Junsong Yuan",
            "Yujun Cai"
        ],
        "submitted": "2025-07-28 14:41:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Enhancing Project-Specific Code Completion by Inferring Internal API Information",
        "abstract": "Project-specific code completion is a critical task that leverages context\nfrom a project to generate accurate code. State-of-the-art methods use\nretrieval-augmented generation (RAG) with large language models (LLMs) and\nproject information for code completion. However, they often struggle to\nincorporate internal API information, which is crucial for accuracy, especially\nwhen APIs are not explicitly imported in the file.\n  To address this, we propose a method to infer internal API information\nwithout relying on imports. Our method extends the representation of APIs by\nconstructing usage examples and semantic descriptions, building a knowledge\nbase for LLMs to generate relevant completions. We also introduce ProjBench, a\nbenchmark that avoids leaked imports and consists of large-scale real-world\nprojects.\n  Experiments on ProjBench and CrossCodeEval show that our approach\nsignificantly outperforms existing methods, improving code exact match by\n22.72% and identifier exact match by 18.31%. Additionally, integrating our\nmethod with existing baselines boosts code match by 47.80% and identifier match\nby 35.55%.",
        "url": "http://arxiv.org/abs/2507.20888v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20888v1",
        "arxiv_id": "2507.20888v1",
        "authors": [
            "Le Deng",
            "Xiaoxue Ren",
            "Chao Ni",
            "Ming Liang",
            "David Lo",
            "Zhongxin Liu"
        ],
        "submitted": "2025-07-28 14:39:46",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The Importance of Facial Features in Vision-based Sign Language Recognition: Eyes, Mouth or Full Face?",
        "abstract": "Non-manual facial features play a crucial role in sign language\ncommunication, yet their importance in automatic sign language recognition\n(ASLR) remains underexplored. While prior studies have shown that incorporating\nfacial features can improve recognition, related work often relies on\nhand-crafted feature extraction and fails to go beyond the comparison of manual\nfeatures versus the combination of manual and facial features. In this work, we\nsystematically investigate the contribution of distinct facial regionseyes,\nmouth, and full faceusing two different deep learning models (a CNN-based model\nand a transformer-based model) trained on an SLR dataset of isolated signs with\nrandomly selected classes. Through quantitative performance and qualitative\nsaliency map evaluation, we reveal that the mouth is the most important\nnon-manual facial feature, significantly improving accuracy. Our findings\nhighlight the necessity of incorporating facial features in ASLR.",
        "url": "http://arxiv.org/abs/2507.20884v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20884v1",
        "arxiv_id": "2507.20884v1",
        "authors": [
            "Dinh Nam Pham",
            "Eleftherios Avramidis"
        ],
        "submitted": "2025-07-28 14:36:46",
        "source": "arxiv",
        "comment": "Accepted at 9th International Workshop on Sign Language Translation\n  and Avatar Technologies @ ACM IVA'25"
    },
    {
        "title": "Leveraging Open-Source Large Language Models for Clinical Information Extraction in Resource-Constrained Settings",
        "abstract": "Medical reports contain rich clinical information but are often unstructured\nand written in domain-specific language, posing challenges for information\nextraction. While proprietary large language models (LLMs) have shown promise\nin clinical natural language processing, their lack of transparency and data\nprivacy concerns limit their utility in healthcare. This study therefore\nevaluates nine open-source generative LLMs on the DRAGON benchmark, which\nincludes 28 clinical information extraction tasks in Dutch. We developed\n\\texttt{llm\\_extractinator}, a publicly available framework for information\nextraction using open-source generative LLMs, and used it to assess model\nperformance in a zero-shot setting. Several 14 billion parameter models,\nPhi-4-14B, Qwen-2.5-14B, and DeepSeek-R1-14B, achieved competitive results,\nwhile the bigger Llama-3.3-70B model achieved slightly higher performance at\ngreater computational cost. Translation to English prior to inference\nconsistently degraded performance, highlighting the need of native-language\nprocessing. These findings demonstrate that open-source LLMs, when used with\nour framework, offer effective, scalable, and privacy-conscious solutions for\nclinical information extraction in low-resource settings.",
        "url": "http://arxiv.org/abs/2507.20859v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20859v1",
        "arxiv_id": "2507.20859v1",
        "authors": [
            "Luc Builtjes",
            "Joeran Bosma",
            "Mathias Prokop",
            "Bram van Ginneken",
            "Alessa Hering"
        ],
        "submitted": "2025-07-28 14:12:37",
        "source": "arxiv",
        "comment": "34 pages, 5 figures"
    },
    {
        "title": "A survey of diversity quantification in natural language processing: The why, what, where and how",
        "abstract": "The concept of diversity has received increased consideration in Natural\nLanguage Processing (NLP) in recent years. This is due to various motivations\nlike promoting and inclusion, approximating human linguistic behavior, and\nincreasing systems' performance. Diversity has however often been addressed in\nan ad hoc manner in NLP, and with few explicit links to other domains where\nthis notion is better theorized. We survey articles in the ACL Anthology from\nthe past 6 years, with \"diversity\" or \"diverse\" in their title. We find a wide\nrange of settings in which diversity is quantified, often highly specialized\nand using inconsistent terminology. We put forward a unified taxonomy of why,\nwhat on, where, and how diversity is measured in NLP. Diversity measures are\ncast upon a unified framework from ecology and economy (Stirling, 2007) with 3\ndimensions of diversity: variety, balance and disparity. We discuss the trends\nwhich emerge due to this systematized approach. We believe that this study\npaves the way towards a better formalization of diversity in NLP, which should\nbring a better understanding of this notion and a better comparability between\nvarious approaches.",
        "url": "http://arxiv.org/abs/2507.20858v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20858v1",
        "arxiv_id": "2507.20858v1",
        "authors": [
            "Louis Estève",
            "Marie-Catherine de Marneffe",
            "Nurit Melnik",
            "Agata Savary",
            "Olha Kanishcheva"
        ],
        "submitted": "2025-07-28 14:12:34",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Latent Inter-User Difference Modeling for LLM Personalization",
        "abstract": "Large language models (LLMs) are increasingly integrated into users' daily\nlives, leading to a growing demand for personalized outputs. Previous work\nfocuses on leveraging a user's own history, overlooking inter-user differences\nthat are crucial for effective personalization. While recent work has attempted\nto model such differences, the reliance on language-based prompts often hampers\nthe effective extraction of meaningful distinctions. To address these issues,\nwe propose Difference-aware Embedding-based Personalization (DEP), a framework\nthat models inter-user differences in the latent space instead of relying on\nlanguage prompts. DEP constructs soft prompts by contrasting a user's embedding\nwith those of peers who engaged with similar content, highlighting relative\nbehavioral signals. A sparse autoencoder then filters and compresses both\nuser-specific and difference-aware embeddings, preserving only task-relevant\nfeatures before injecting them into a frozen LLM. Experiments on personalized\nreview generation show that DEP consistently outperforms baseline methods\nacross multiple metrics. Our code is available at\nhttps://github.com/SnowCharmQ/DEP.",
        "url": "http://arxiv.org/abs/2507.20849v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20849v1",
        "arxiv_id": "2507.20849v1",
        "authors": [
            "Yilun Qiu",
            "Tianhao Shi",
            "Xiaoyan Zhao",
            "Fengbin Zhu",
            "Yang Zhang",
            "Fuli Feng"
        ],
        "submitted": "2025-07-28 14:00:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Automating Thematic Review of Prevention of Future Deaths Reports: Replicating the ONS Child Suicide Study using Large Language Models",
        "abstract": "Prevention of Future Deaths (PFD) reports, issued by coroners in England and\nWales, flag systemic hazards that may lead to further loss of life. Analysis of\nthese reports has previously been constrained by the manual effort required to\nidentify and code relevant cases. In 2025, the Office for National Statistics\n(ONS) published a national thematic review of child-suicide PFD reports ($\\leq$\n18 years), identifying 37 cases from January 2015 to November 2023 - a process\nbased entirely on manual curation and coding. We evaluated whether a fully\nautomated, open source \"text-to-table\" language-model pipeline (PFD Toolkit)\ncould reproduce the ONS's identification and thematic analysis of child-suicide\nPFD reports, and assessed gains in efficiency and reliability. All 4,249 PFD\nreports published from July 2013 to November 2023 were processed via PFD\nToolkit's large language model pipelines. Automated screening identified cases\nwhere the coroner attributed death to suicide in individuals aged 18 or\nyounger, and eligible reports were coded for recipient category and 23 concern\nsub-themes, replicating the ONS coding frame. PFD Toolkit identified 72\nchild-suicide PFD reports - almost twice the ONS count. Three blinded\nclinicians adjudicated a stratified sample of 144 reports to validate the\nchild-suicide screening. Against the post-consensus clinical annotations, the\nLLM-based workflow showed substantial to almost-perfect agreement (Cohen's\n$\\kappa$ = 0.82, 95% CI: 0.66-0.98, raw agreement = 91%). The end-to-end script\nruntime was 8m 16s, transforming a process that previously took months into one\nthat can be completed in minutes. This demonstrates that automated LLM analysis\ncan reliably and efficiently replicate manual thematic reviews of coronial\ndata, enabling scalable, reproducible, and timely insights for public health\nand safety. The PFD Toolkit is openly available for future research.",
        "url": "http://arxiv.org/abs/2507.20786v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20786v1",
        "arxiv_id": "2507.20786v1",
        "authors": [
            "Sam Osian",
            "Arpan Dutta",
            "Sahil Bhandari",
            "Iain E. Buchan",
            "Dan W. Joyce"
        ],
        "submitted": "2025-07-28 12:56:31",
        "source": "arxiv",
        "comment": "8 pages, 1 figure"
    },
    {
        "title": "On The Role of Pretrained Language Models in General-Purpose Text Embeddings: A Survey",
        "abstract": "Text embeddings have attracted growing interest due to their effectiveness\nacross a wide range of natural language processing (NLP) tasks, such as\nretrieval, classification, clustering, bitext mining, and summarization. With\nthe emergence of pretrained language models (PLMs), general-purpose text\nembeddings (GPTE) have gained significant traction for their ability to produce\nrich, transferable representations. The general architecture of GPTE typically\nleverages PLMs to derive dense text representations, which are then optimized\nthrough contrastive learning on large-scale pairwise datasets. In this survey,\nwe provide a comprehensive overview of GPTE in the era of PLMs, focusing on the\nroles PLMs play in driving its development. We first examine the fundamental\narchitecture and describe the basic roles of PLMs in GPTE, i.e., embedding\nextraction, expressivity enhancement, training strategies, learning objectives,\nand data construction. Then, we describe advanced roles enabled by PLMs, such\nas multilingual support, multimodal integration, code understanding, and\nscenario-specific adaptation. Finally, we highlight potential future research\ndirections that move beyond traditional improvement goals, including ranking\nintegration, safety considerations, bias mitigation, structural information\nincorporation, and the cognitive extension of embeddings. This survey aims to\nserve as a valuable reference for both newcomers and established researchers\nseeking to understand the current state and future potential of GPTE.",
        "url": "http://arxiv.org/abs/2507.20783v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20783v1",
        "arxiv_id": "2507.20783v1",
        "authors": [
            "Meishan Zhang",
            "Xin Zhang",
            "Xinping Zhao",
            "Shouzheng Huang",
            "Baotian Hu",
            "Min Zhang"
        ],
        "submitted": "2025-07-28 12:52:24",
        "source": "arxiv",
        "comment": "45 pages, 2 figures, 9 tables"
    },
    {
        "title": "Watermarking Large Language Model-based Time Series Forecasting",
        "abstract": "Large Language Model-based Time Series Forecasting (LLMTS) has shown\nremarkable promise in handling complex and diverse temporal data, representing\na significant step toward foundation models for time series analysis. However,\nthis emerging paradigm introduces two critical challenges. First, the\nsubstantial commercial potential and resource-intensive development raise\nurgent concerns about intellectual property (IP) protection. Second, their\npowerful time series forecasting capabilities may be misused to produce\nmisleading or fabricated deepfake time series data. To address these concerns,\nwe explore watermarking the outputs of LLMTS models, that is, embedding\nimperceptible signals into the generated time series data that remain\ndetectable by specialized algorithms. We propose a novel post-hoc watermarking\nframework, Waltz, which is broadly compatible with existing LLMTS models. Waltz\nis inspired by the empirical observation that time series patch embeddings are\nrarely aligned with a specific set of LLM tokens, which we term ``cold\ntokens''. Leveraging this insight, Waltz embeds watermarks by rewiring the\nsimilarity statistics between patch embeddings and cold token embeddings, and\ndetects watermarks using similarity z-scores. To minimize potential side\neffects, we introduce a similarity-based embedding position identification\nstrategy and employ projected gradient descent to constrain the watermark noise\nwithin a defined boundary. Extensive experiments using two popular LLMTS models\nacross seven benchmark datasets demonstrate that Waltz achieves high watermark\ndetection accuracy with minimal impact on the quality of the generated time\nseries.",
        "url": "http://arxiv.org/abs/2507.20762v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20762v1",
        "arxiv_id": "2507.20762v1",
        "authors": [
            "Wei Yuan",
            "Chaoqun Yang",
            "Yu Xing",
            "Tong Chen",
            "Nguyen Quoc Viet Hung",
            "Hongzhi Yin"
        ],
        "submitted": "2025-07-28 12:16:52",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Industry Insights from Comparing Deep Learning and GBDT Models for E-Commerce Learning-to-Rank",
        "abstract": "In e-commerce recommender and search systems, tree-based models, such as\nLambdaMART, have set a strong baseline for Learning-to-Rank (LTR) tasks.\nDespite their effectiveness and widespread adoption in industry, the debate\ncontinues whether deep neural networks (DNNs) can outperform traditional\ntree-based models in this domain. To contribute to this discussion, we\nsystematically benchmark DNNs against our production-grade LambdaMART model. We\nevaluate multiple DNN architectures and loss functions on a proprietary dataset\nfrom OTTO and validate our findings through an 8-week online A/B test. The\nresults show that a simple DNN architecture outperforms a strong tree-based\nbaseline in terms of total clicks and revenue, while achieving parity in total\nunits sold.",
        "url": "http://arxiv.org/abs/2507.20753v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20753v1",
        "arxiv_id": "2507.20753v1",
        "authors": [
            "Yunus Lutz",
            "Timo Wilm",
            "Philipp Duwe"
        ],
        "submitted": "2025-07-28 12:02:02",
        "source": "arxiv",
        "comment": "This work was accepted for publication in the 19th ACM Conference on\n  Recommender Systems (RecSys 2025). The final published version will be\n  available at the ACM Digital Library"
    },
    {
        "title": "Multilingual Self-Taught Faithfulness Evaluators",
        "abstract": "The growing use of large language models (LLMs) has increased the need for\nautomatic evaluation systems, particularly to address the challenge of\ninformation hallucination. Although existing faithfulness evaluation approaches\nhave shown promise, they are predominantly English-focused and often require\nexpensive human-labeled training data for fine-tuning specialized models. As\nLLMs see increased adoption in multilingual contexts, there is a need for\naccurate faithfulness evaluators that can operate across languages without\nextensive labeled data. This paper presents Self-Taught Evaluators for\nMultilingual Faithfulness, a framework that learns exclusively from synthetic\nmultilingual summarization data while leveraging cross-lingual transfer\nlearning. Through experiments comparing language-specific and mixed-language\nfine-tuning approaches, we demonstrate a consistent relationship between an\nLLM's general language capabilities and its performance in language-specific\nevaluation tasks. Our framework shows improvements over existing baselines,\nincluding state-of-the-art English evaluators and machine translation-based\napproaches.",
        "url": "http://arxiv.org/abs/2507.20752v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20752v1",
        "arxiv_id": "2507.20752v1",
        "authors": [
            "Carlo Alfano",
            "Aymen Al Marjani",
            "Zeno Jonke",
            "Amin Mantrach",
            "Saab Mansour",
            "Marcello Federico"
        ],
        "submitted": "2025-07-28 12:01:59",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Investigating Structural Pruning and Recovery Techniques for Compressing Multimodal Large Language Models: An Empirical Study",
        "abstract": "While Multimodal Large Language Models (MLLMs) demonstrate impressive\ncapabilities, their substantial computational and memory requirements pose\nsignificant barriers to practical deployment. Current parameter reduction\ntechniques primarily involve training MLLMs from Small Language Models (SLMs),\nbut these methods offer limited flexibility and remain computationally\nintensive. To address this gap, we propose to directly compress existing MLLMs\nthrough structural pruning combined with efficient recovery training.\nSpecifically, we investigate two structural pruning paradigms--layerwise and\nwidthwise pruning--applied to the language model backbone of MLLMs, alongside\nsupervised finetuning and knowledge distillation. Additionally, we assess the\nfeasibility of conducting recovery training with only a small fraction of the\navailable data. Our results show that widthwise pruning generally maintains\nbetter performance in low-resource scenarios with limited computational\nresources or insufficient finetuning data. As for the recovery training,\nfinetuning only the multimodal projector is sufficient at small compression\nlevels (< 20%). Furthermore, a combination of supervised finetuning and\nhidden-state distillation yields optimal recovery across various pruning\nlevels. Notably, effective recovery can be achieved with as little as 5% of the\noriginal training data, while retaining over 95% of the original performance.\nThrough empirical study on two representative MLLMs, i.e., LLaVA-v1.5-7B and\nBunny-v1.0-3B, this study offers actionable insights for practitioners aiming\nto compress MLLMs effectively without extensive computation resources or\nsufficient data.",
        "url": "http://arxiv.org/abs/2507.20749v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20749v1",
        "arxiv_id": "2507.20749v1",
        "authors": [
            "Yiran Huang",
            "Lukas Thede",
            "Massimiliano Mancini",
            "Wenjia Xu",
            "Zeynep Akata"
        ],
        "submitted": "2025-07-28 11:57:52",
        "source": "arxiv",
        "comment": "Accepted at GCPR 2025"
    },
    {
        "title": "Text2VLM: Adapting Text-Only Datasets to Evaluate Alignment Training in Visual Language Models",
        "abstract": "The increasing integration of Visual Language Models (VLMs) into AI systems\nnecessitates robust model alignment, especially when handling multimodal\ncontent that combines text and images. Existing evaluation datasets heavily\nlean towards text-only prompts, leaving visual vulnerabilities under evaluated.\nTo address this gap, we propose \\textbf{Text2VLM}, a novel multi-stage pipeline\nthat adapts text-only datasets into multimodal formats, specifically designed\nto evaluate the resilience of VLMs against typographic prompt injection\nattacks. The Text2VLM pipeline identifies harmful content in the original text\nand converts it into a typographic image, creating a multimodal prompt for\nVLMs. Also, our evaluation of open-source VLMs highlights their increased\nsusceptibility to prompt injection when visual inputs are introduced, revealing\ncritical weaknesses in the current models' alignment. This is in addition to a\nsignificant performance gap compared to closed-source frontier models. We\nvalidate Text2VLM through human evaluations, ensuring the alignment of\nextracted salient concepts; text summarization and output classification align\nwith human expectations. Text2VLM provides a scalable tool for comprehensive\nsafety assessment, contributing to the development of more robust safety\nmechanisms for VLMs. By enhancing the evaluation of multimodal vulnerabilities,\nText2VLM plays a role in advancing the safe deployment of VLMs in diverse,\nreal-world applications.",
        "url": "http://arxiv.org/abs/2507.20704v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20704v1",
        "arxiv_id": "2507.20704v1",
        "authors": [
            "Gabriel Downer",
            "Sean Craven",
            "Damian Ruck",
            "Jake Thomas"
        ],
        "submitted": "2025-07-28 10:57:44",
        "source": "arxiv",
        "comment": "9 pages, 9 figures. Jake Thomas served as Editor for this manuscript"
    },
    {
        "title": "When Scale Meets Diversity: Evaluating Language Models on Fine-Grained Multilingual Claim Verification",
        "abstract": "The rapid spread of multilingual misinformation requires robust automated\nfact verification systems capable of handling fine-grained veracity assessments\nacross diverse languages. While large language models have shown remarkable\ncapabilities across many NLP tasks, their effectiveness for multilingual claim\nverification with nuanced classification schemes remains understudied. We\nconduct a comprehensive evaluation of five state-of-the-art language models on\nthe X-Fact dataset, which spans 25 languages with seven distinct veracity\ncategories. Our experiments compare small language models (encoder-based XLM-R\nand mT5) with recent decoder-only LLMs (Llama 3.1, Qwen 2.5, Mistral Nemo)\nusing both prompting and fine-tuning approaches. Surprisingly, we find that\nXLM-R (270M parameters) substantially outperforms all tested LLMs (7-12B\nparameters), achieving 57.7% macro-F1 compared to the best LLM performance of\n16.9%. This represents a 15.8% improvement over the previous state-of-the-art\n(41.9%), establishing new performance benchmarks for multilingual fact\nverification. Our analysis reveals problematic patterns in LLM behavior,\nincluding systematic difficulties in leveraging evidence and pronounced biases\ntoward frequent categories in imbalanced data settings. These findings suggest\nthat for fine-grained multilingual fact verification, smaller specialized\nmodels may be more effective than general-purpose large models, with important\nimplications for practical deployment of fact-checking systems.",
        "url": "http://arxiv.org/abs/2507.20700v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20700v1",
        "arxiv_id": "2507.20700v1",
        "authors": [
            "Hanna Shcharbakova",
            "Tatiana Anikina",
            "Natalia Skachkova",
            "Josef van Genabith"
        ],
        "submitted": "2025-07-28 10:49:04",
        "source": "arxiv",
        "comment": "Published at the FEVER Workshop, ACL 2025"
    },
    {
        "title": "Geometric-Mean Policy Optimization",
        "abstract": "Recent advancements, such as Group Relative Policy Optimization (GRPO), have\nenhanced the reasoning capabilities of large language models by optimizing the\narithmetic mean of token-level rewards. However, GRPO suffers from unstable\npolicy updates when processing tokens with outlier importance-weighted rewards,\nwhich manifests as extreme importance sampling ratios during training, i.e.,\nthe ratio between the sampling probabilities assigned to a token by the current\nand old policies. In this work, we propose Geometric-Mean Policy Optimization\n(GMPO), a stabilized variant of GRPO. Instead of optimizing the arithmetic\nmean, GMPO maximizes the geometric mean of token-level rewards, which is\ninherently less sensitive to outliers and maintains a more stable range of\nimportance sampling ratio. In addition, we provide comprehensive theoretical\nand experimental analysis to justify the design and stability benefits of GMPO.\nBeyond improved stability, GMPO-7B outperforms GRPO by an average of 4.1% on\nmultiple mathematical benchmarks and 1.4% on multimodal reasoning benchmark,\nincluding AIME24, AMC, MATH500, OlympiadBench, Minerva, and Geometry3K. Code is\navailable at https://github.com/callsys/GMPO.",
        "url": "http://arxiv.org/abs/2507.20673v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20673v1",
        "arxiv_id": "2507.20673v1",
        "authors": [
            "Yuzhong Zhao",
            "Yue Liu",
            "Junpeng Liu",
            "Jingye Chen",
            "Xun Wu",
            "Yaru Hao",
            "Tengchao Lv",
            "Shaohan Huang",
            "Lei Cui",
            "Qixiang Ye",
            "Fang Wan",
            "Furu Wei"
        ],
        "submitted": "2025-07-28 09:54:05",
        "source": "arxiv",
        "comment": "Code is available at https://github.com/callsys/GMPO"
    },
    {
        "title": "Ontology-Enhanced Knowledge Graph Completion using Large Language Models",
        "abstract": "Large Language Models (LLMs) have been extensively adopted in Knowledge Graph\nCompletion (KGC), showcasing significant research advancements. However, as\nblack-box models driven by deep neural architectures, current LLM-based KGC\nmethods rely on implicit knowledge representation with parallel propagation of\nerroneous knowledge, thereby hindering their ability to produce conclusive and\ndecisive reasoning outcomes. We aim to integrate neural-perceptual structural\ninformation with ontological knowledge, leveraging the powerful capabilities of\nLLMs to achieve a deeper understanding of the intrinsic logic of the knowledge.\nWe propose an ontology enhanced KGC method using LLMs -- OL-KGC. It first\nleverages neural perceptual mechanisms to effectively embed structural\ninformation into the textual space, and then uses an automated extraction\nalgorithm to retrieve ontological knowledge from the knowledge graphs (KGs)\nthat needs to be completed, which is further transformed into a textual format\ncomprehensible to LLMs for providing logic guidance. We conducted extensive\nexperiments on three widely-used benchmarks -- FB15K-237, UMLS and WN18RR. The\nexperimental results demonstrate that OL-KGC significantly outperforms existing\nmainstream KGC methods across multiple evaluation metrics, achieving\nstate-of-the-art performance.",
        "url": "http://arxiv.org/abs/2507.20643v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20643v1",
        "arxiv_id": "2507.20643v1",
        "authors": [
            "Wenbin Guo",
            "Xin Wang",
            "Jiaoyan Chen",
            "Zhao Li",
            "Zirui Chen"
        ],
        "submitted": "2025-07-28 09:00:48",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Before the Outrage: Challenges and Advances in Predicting Online Antisocial Behavior",
        "abstract": "Antisocial behavior (ASB) on social media-including hate speech, harassment,\nand trolling-poses growing challenges for platform safety and societal\nwellbeing. While prior work has primarily focused on detecting harmful content\nafter it appears, predictive approaches aim to forecast future harmful\nbehaviors-such as hate speech propagation, conversation derailment, or user\nrecidivism-before they fully unfold. Despite increasing interest, the field\nremains fragmented, lacking a unified taxonomy or clear synthesis of existing\nmethods. This paper presents a systematic review of over 49 studies on ASB\nprediction, offering a structured taxonomy of five core task types: early harm\ndetection, harm emergence prediction, harm propagation prediction, behavioral\nrisk prediction, and proactive moderation support. We analyze how these tasks\ndiffer by temporal framing, prediction granularity, and operational goals. In\naddition, we examine trends in modeling techniques-from classical machine\nlearning to pre-trained language models-and assess the influence of dataset\ncharacteristics on task feasibility and generalization. Our review highlights\nmethodological challenges, such as dataset scarcity, temporal drift, and\nlimited benchmarks, while outlining emerging research directions including\nmultilingual modeling, cross-platform generalization, and human-in-the-loop\nsystems. By organizing the field around a coherent framework, this survey aims\nto guide future work toward more robust and socially responsible ASB\nprediction.",
        "url": "http://arxiv.org/abs/2507.20614v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20614v1",
        "arxiv_id": "2507.20614v1",
        "authors": [
            "Anaïs Ollagnier"
        ],
        "submitted": "2025-07-28 08:27:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Beyond Interactions: Node-Level Graph Generation for Knowledge-Free Augmentation in Recommender Systems",
        "abstract": "Recent advances in recommender systems rely on external resources such as\nknowledge graphs or large language models to enhance recommendations, which\nlimit applicability in real-world settings due to data dependency and\ncomputational overhead. Although knowledge-free models are able to bolster\nrecommendations by direct edge operations as well, the absence of augmentation\nprimitives drives them to fall short in bridging semantic and structural gaps\nas high-quality paradigm substitutes. Unlike existing diffusion-based works\nthat remodel user-item interactions, this work proposes NodeDiffRec, a\npioneering knowledge-free augmentation framework that enables fine-grained\nnode-level graph generation for recommendations and expands the scope of\nrestricted augmentation primitives via diffusion. By synthesizing pseudo-items\nand corresponding interactions that align with the underlying distribution for\ninjection, and further refining user preferences through a denoising preference\nmodeling process, NodeDiffRec dramatically enhances both semantic diversity and\nstructural connectivity without external knowledge. Extensive experiments\nacross diverse datasets and recommendation algorithms demonstrate the\nsuperiority of NodeDiffRec, achieving State-of-the-Art (SOTA) performance, with\nmaximum average performance improvement 98.6% in Recall@5 and 84.0% in NDCG@5\nover selected baselines.",
        "url": "http://arxiv.org/abs/2507.20578v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20578v1",
        "arxiv_id": "2507.20578v1",
        "authors": [
            "Zhaoyan Wang",
            "Hyunjun Ahn",
            "In-Young Ko"
        ],
        "submitted": "2025-07-28 07:22:06",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ZSE-Cap: A Zero-Shot Ensemble for Image Retrieval and Prompt-Guided Captioning",
        "abstract": "We present ZSE-Cap (Zero-Shot Ensemble for Captioning), our 4th place system\nin Event-Enriched Image Analysis (EVENTA) shared task on article-grounded image\nretrieval and captioning. Our zero-shot approach requires no finetuning on the\ncompetition's data. For retrieval, we ensemble similarity scores from CLIP,\nSigLIP, and DINOv2. For captioning, we leverage a carefully engineered prompt\nto guide the Gemma 3 model, enabling it to link high-level events from the\narticle to the visual content in the image. Our system achieved a final score\nof 0.42002, securing a top-4 position on the private test set, demonstrating\nthe effectiveness of combining foundation models through ensembling and\nprompting. Our code is available at https://github.com/ductai05/ZSE-Cap.",
        "url": "http://arxiv.org/abs/2507.20564v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20564v1",
        "arxiv_id": "2507.20564v1",
        "authors": [
            "Duc-Tai Dinh",
            "Duc Anh Khoa Dinh"
        ],
        "submitted": "2025-07-28 06:58:35",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Enhancing Hallucination Detection via Future Context",
        "abstract": "Large Language Models (LLMs) are widely used to generate plausible text on\nonline platforms, without revealing the generation process. As users\nincreasingly encounter such black-box outputs, detecting hallucinations has\nbecome a critical challenge. To address this challenge, we focus on developing\na hallucination detection framework for black-box generators. Motivated by the\nobservation that hallucinations, once introduced, tend to persist, we sample\nfuture contexts. The sampled future contexts provide valuable clues for\nhallucination detection and can be effectively integrated with various\nsampling-based methods. We extensively demonstrate performance improvements\nacross multiple methods using our proposed sampling approach.",
        "url": "http://arxiv.org/abs/2507.20546v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20546v1",
        "arxiv_id": "2507.20546v1",
        "authors": [
            "Joosung Lee",
            "Cheonbok Park",
            "Hwiyeol Jo",
            "Jeonghoon Kim",
            "Joonsuk Park",
            "Kang Min Yoo"
        ],
        "submitted": "2025-07-28 06:13:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Kimi K2: Open Agentic Intelligence",
        "abstract": "We introduce Kimi K2, a Mixture-of-Experts (MoE) large language model with 32\nbillion activated parameters and 1 trillion total parameters. We propose the\nMuonClip optimizer, which improves upon Muon with a novel QK-clip technique to\naddress training instability while enjoying the advanced token efficiency of\nMuon. Based on MuonClip, K2 was pre-trained on 15.5 trillion tokens with zero\nloss spike. During post-training, K2 undergoes a multi-stage post-training\nprocess, highlighted by a large-scale agentic data synthesis pipeline and a\njoint reinforcement learning (RL) stage, where the model improves its\ncapabilities through interactions with real and synthetic environments.\n  Kimi K2 achieves state-of-the-art performance among open-source non-thinking\nmodels, with strengths in agentic capabilities. Notably, K2 obtains 66.1 on\nTau2-Bench, 76.5 on ACEBench (En), 65.8 on SWE-Bench Verified, and 47.3 on\nSWE-Bench Multilingual -- surpassing most open and closed-sourced baselines in\nnon-thinking settings. It also exhibits strong capabilities in coding,\nmathematics, and reasoning tasks, with a score of 53.7 on LiveCodeBench v6,\n49.5 on AIME 2025, 75.1 on GPQA-Diamond, and 27.1 on OJBench, all without\nextended thinking. These results position Kimi K2 as one of the most capable\nopen-source large language models to date, particularly in software engineering\nand agentic tasks. We release our base and post-trained model checkpoints to\nfacilitate future research and applications of agentic intelligence.",
        "url": "http://arxiv.org/abs/2507.20534v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20534v1",
        "arxiv_id": "2507.20534v1",
        "authors": [
            "Kimi Team",
            "Yifan Bai",
            "Yiping Bao",
            "Guanduo Chen",
            "Jiahao Chen",
            "Ningxin Chen",
            "Ruijue Chen",
            "Yanru Chen",
            "Yuankun Chen",
            "Yutian Chen",
            "Zhuofu Chen",
            "Jialei Cui",
            "Hao Ding",
            "Mengnan Dong",
            "Angang Du",
            "Chenzhuang Du",
            "Dikang Du",
            "Yulun Du",
            "Yu Fan",
            "Yichen Feng",
            "Kelin Fu",
            "Bofei Gao",
            "Hongcheng Gao",
            "Peizhong Gao",
            "Tong Gao",
            "Xinran Gu",
            "Longyu Guan",
            "Haiqing Guo",
            "Jianhang Guo",
            "Hao Hu",
            "Xiaoru Hao",
            "Tianhong He",
            "Weiran He",
            "Wenyang He",
            "Chao Hong",
            "Yangyang Hu",
            "Zhenxing Hu",
            "Weixiao Huang",
            "Zhiqi Huang",
            "Zihao Huang",
            "Tao Jiang",
            "Zhejun Jiang",
            "Xinyi Jin",
            "Yongsheng Kang",
            "Guokun Lai",
            "Cheng Li",
            "Fang Li",
            "Haoyang Li",
            "Ming Li",
            "Wentao Li",
            "Yanhao Li",
            "Yiwei Li",
            "Zhaowei Li",
            "Zheming Li",
            "Hongzhan Lin",
            "Xiaohan Lin",
            "Zongyu Lin",
            "Chengyin Liu",
            "Chenyu Liu",
            "Hongzhang Liu",
            "Jingyuan Liu",
            "Junqi Liu",
            "Liang Liu",
            "Shaowei Liu",
            "T. Y. Liu",
            "Tianwei Liu",
            "Weizhou Liu",
            "Yangyang Liu",
            "Yibo Liu",
            "Yiping Liu",
            "Yue Liu",
            "Zhengying Liu",
            "Enzhe Lu",
            "Lijun Lu",
            "Shengling Ma",
            "Xinyu Ma",
            "Yingwei Ma",
            "Shaoguang Mao",
            "Jie Mei",
            "Xin Men",
            "Yibo Miao",
            "Siyuan Pan",
            "Yebo Peng",
            "Ruoyu Qin",
            "Bowen Qu",
            "Zeyu Shang",
            "Lidong Shi",
            "Shengyuan Shi",
            "Feifan Song",
            "Jianlin Su",
            "Zhengyuan Su",
            "Xinjie Sun",
            "Flood Sung",
            "Heyi Tang",
            "Jiawen Tao",
            "Qifeng Teng",
            "Chensi Wang",
            "Dinglu Wang",
            "Feng Wang",
            "Haiming Wang",
            "Jianzhou Wang",
            "Jiaxing Wang",
            "Jinhong Wang",
            "Shengjie Wang",
            "Shuyi Wang",
            "Yao Wang",
            "Yejie Wang",
            "Yiqin Wang",
            "Yuxin Wang",
            "Yuzhi Wang",
            "Zhaoji Wang",
            "Zhengtao Wang",
            "Zhexu Wang",
            "Chu Wei",
            "Qianqian Wei",
            "Wenhao Wu",
            "Xingzhe Wu",
            "Yuxin Wu",
            "Chenjun Xiao",
            "Xiaotong Xie",
            "Weimin Xiong",
            "Boyu Xu",
            "Jing Xu",
            "Jinjing Xu",
            "L. H. Xu",
            "Lin Xu",
            "Suting Xu",
            "Weixin Xu",
            "Xinran Xu",
            "Yangchuan Xu",
            "Ziyao Xu",
            "Junjie Yan",
            "Yuzi Yan",
            "Xiaofei Yang",
            "Ying Yang",
            "Zhen Yang",
            "Zhilin Yang",
            "Zonghan Yang",
            "Haotian Yao",
            "Xingcheng Yao",
            "Wenjie Ye",
            "Zhuorui Ye",
            "Bohong Yin",
            "Longhui Yu",
            "Enming Yuan",
            "Hongbang Yuan",
            "Mengjie Yuan",
            "Haobing Zhan",
            "Dehao Zhang",
            "Hao Zhang",
            "Wanlu Zhang",
            "Xiaobin Zhang",
            "Yangkun Zhang",
            "Yizhi Zhang",
            "Yongting Zhang",
            "Yu Zhang",
            "Yutao Zhang",
            "Yutong Zhang",
            "Zheng Zhang",
            "Haotian Zhao",
            "Yikai Zhao",
            "Huabin Zheng",
            "Shaojie Zheng",
            "Jianren Zhou",
            "Xinyu Zhou",
            "Zaida Zhou",
            "Zhen Zhu",
            "Weiyu Zhuang",
            "Xinxing Zu"
        ],
        "submitted": "2025-07-28 05:35:43",
        "source": "arxiv",
        "comment": "tech report of Kimi K2"
    },
    {
        "title": "Dialogues of Dissent: Thematic and Rhetorical Dimensions of Hate and Counter-Hate Speech in Social Media Conversations",
        "abstract": "We introduce a novel multi-labeled scheme for joint annotation of hate and\ncounter-hate speech in social media conversations, categorizing hate and\ncounter-hate messages into thematic and rhetorical dimensions. The thematic\ncategories outline different discursive aspects of each type of speech, while\nthe rhetorical dimension captures how hate and counter messages are\ncommunicated, drawing on Aristotle's Logos, Ethos and Pathos. We annotate a\nsample of 92 conversations, consisting of 720 tweets, and conduct statistical\nanalyses, incorporating public metrics, to explore patterns of interaction\nbetween the thematic and rhetorical dimensions within and between hate and\ncounter-hate speech. Our findings provide insights into the spread of hate\nmessages on social media, the strategies used to counter them, and their\npotential impact on online behavior.",
        "url": "http://arxiv.org/abs/2507.20528v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20528v1",
        "arxiv_id": "2507.20528v1",
        "authors": [
            "Effi Levi",
            "Gal Ron",
            "Odelia Oshri",
            "Shaul R. Shenhav"
        ],
        "submitted": "2025-07-28 05:22:45",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SAND-Math: Using LLMs to Generate Novel, Difficult and Useful Mathematics Questions and Answers",
        "abstract": "The demand for Large Language Models (LLMs) capable of sophisticated\nmathematical reasoning is growing across industries. However, the development\nof performant mathematical LLMs is critically bottlenecked by the scarcity of\ndifficult, novel training data. We introduce \\textbf{SAND-Math} (Synthetic\nAugmented Novel and Difficult Mathematics problems and solutions), a pipeline\nthat addresses this by first generating high-quality problems from scratch and\nthen systematically elevating their complexity via a new \\textbf{Difficulty\nHiking} step. We demonstrate the effectiveness of our approach through two key\nfindings. First, augmenting a strong baseline with SAND-Math data significantly\nboosts performance, outperforming the next-best synthetic dataset by\n\\textbf{$\\uparrow$ 17.85 absolute points} on the AIME25 benchmark. Second, in a\ndedicated ablation study, we show our Difficulty Hiking process is highly\neffective: by increasing average problem difficulty from 5.02 to 5.98, this\nstep lifts AIME25 performance from 46.38\\% to 49.23\\%. The full generation\npipeline, final dataset, and a fine-tuned model form a practical and scalable\ntoolkit for building more capable and efficient mathematical reasoning LLMs.\nSAND-Math dataset is released here:\n\\href{https://huggingface.co/datasets/amd/SAND-MATH}{https://huggingface.co/datasets/amd/SAND-MATH}",
        "url": "http://arxiv.org/abs/2507.20527v2",
        "pdf_url": "http://arxiv.org/pdf/2507.20527v2",
        "arxiv_id": "2507.20527v2",
        "authors": [
            "Chaitanya Manem",
            "Pratik Prabhanjan Brahma",
            "Prakamya Mishra",
            "Zicheng Liu",
            "Emad Barsoum"
        ],
        "submitted": "2025-07-28 05:17:48",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Security Challenges in AI Agent Deployment: Insights from a Large Scale Public Competition",
        "abstract": "Recent advances have enabled LLM-powered AI agents to autonomously execute\ncomplex tasks by combining language model reasoning with tools, memory, and web\naccess. But can these systems be trusted to follow deployment policies in\nrealistic environments, especially under attack? To investigate, we ran the\nlargest public red-teaming competition to date, targeting 22 frontier AI agents\nacross 44 realistic deployment scenarios. Participants submitted 1.8 million\nprompt-injection attacks, with over 60,000 successfully eliciting policy\nviolations such as unauthorized data access, illicit financial actions, and\nregulatory noncompliance. We use these results to build the Agent Red Teaming\n(ART) benchmark - a curated set of high-impact attacks - and evaluate it across\n19 state-of-the-art models. Nearly all agents exhibit policy violations for\nmost behaviors within 10-100 queries, with high attack transferability across\nmodels and tasks. Importantly, we find limited correlation between agent\nrobustness and model size, capability, or inference-time compute, suggesting\nthat additional defenses are needed against adversarial misuse. Our findings\nhighlight critical and persistent vulnerabilities in today's AI agents. By\nreleasing the ART benchmark and accompanying evaluation framework, we aim to\nsupport more rigorous security assessment and drive progress toward safer agent\ndeployment.",
        "url": "http://arxiv.org/abs/2507.20526v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20526v1",
        "arxiv_id": "2507.20526v1",
        "authors": [
            "Andy Zou",
            "Maxwell Lin",
            "Eliot Jones",
            "Micha Nowak",
            "Mateusz Dziemian",
            "Nick Winter",
            "Alexander Grattan",
            "Valent Nathanael",
            "Ayla Croft",
            "Xander Davies",
            "Jai Patel",
            "Robert Kirk",
            "Nate Burnikell",
            "Yarin Gal",
            "Dan Hendrycks",
            "J. Zico Kolter",
            "Matt Fredrikson"
        ],
        "submitted": "2025-07-28 05:13:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "AQUA: A Large Language Model for Aquaculture & Fisheries",
        "abstract": "Aquaculture plays a vital role in global food security and coastal economies\nby providing sustainable protein sources. As the industry expands to meet\nrising demand, it faces growing challenges such as disease outbreaks,\ninefficient feeding practices, rising labor costs, logistical inefficiencies,\nand critical hatchery issues, including high mortality rates and poor water\nquality control. Although artificial intelligence has made significant\nprogress, existing machine learning methods fall short of addressing the\ndomain-specific complexities of aquaculture. To bridge this gap, we introduce\nAQUA, the first large language model (LLM) tailored for aquaculture, designed\nto support farmers, researchers, and industry practitioners. Central to this\neffort is AQUADAPT (Data Acquisition, Processing and Tuning), an Agentic\nFramework for generating and refining high-quality synthetic data using a\ncombination of expert knowledge, largescale language models, and automated\nevaluation techniques. Our work lays the foundation for LLM-driven innovations\nin aquaculture research, advisory systems, and decision-making tools.",
        "url": "http://arxiv.org/abs/2507.20520v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20520v1",
        "arxiv_id": "2507.20520v1",
        "authors": [
            "Praneeth Narisetty",
            "Uday Kumar Reddy Kattamanchi",
            "Lohit Akshant Nimma",
            "Sri Ram Kaushik Karnati",
            "Shiva Nagendra Babu Kore",
            "Mounika Golamari",
            "Tejashree Nageshreddy"
        ],
        "submitted": "2025-07-28 05:06:07",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Customize Multi-modal RAI Guardrails with Precedent-based predictions",
        "abstract": "A multi-modal guardrail must effectively filter image content based on\nuser-defined policies, identifying material that may be hateful, reinforce\nharmful stereotypes, contain explicit material, or spread misinformation.\nDeploying such guardrails in real-world applications, however, poses\nsignificant challenges. Users often require varied and highly customizable\npolicies and typically cannot provide abundant examples for each custom policy.\nConsequently, an ideal guardrail should be scalable to the multiple policies\nand adaptable to evolving user standards with minimal retraining. Existing\nfine-tuning methods typically condition predictions on pre-defined policies,\nrestricting their generalizability to new policies or necessitating extensive\nretraining to adapt. Conversely, training-free methods struggle with limited\ncontext lengths, making it difficult to incorporate all the policies\ncomprehensively. To overcome these limitations, we propose to condition model's\njudgment on \"precedents\", which are the reasoning processes of prior data\npoints similar to the given input. By leveraging precedents instead of fixed\npolicies, our approach greatly enhances the flexibility and adaptability of the\nguardrail. In this paper, we introduce a critique-revise mechanism for\ncollecting high-quality precedents and two strategies that utilize precedents\nfor robust prediction. Experimental results demonstrate that our approach\noutperforms previous methods across both few-shot and full-dataset scenarios\nand exhibits superior generalization to novel policies.",
        "url": "http://arxiv.org/abs/2507.20503v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20503v1",
        "arxiv_id": "2507.20503v1",
        "authors": [
            "Cheng-Fu Yang",
            "Thanh Tran",
            "Christos Christodoulopoulos",
            "Weitong Ruan",
            "Rahul Gupta",
            "Kai-Wei Chang"
        ],
        "submitted": "2025-07-28 03:45:34",
        "source": "arxiv",
        "comment": "Accepted to COLM 2025"
    },
    {
        "title": "Speaking in Words, Thinking in Logic: A Dual-Process Framework in QA Systems",
        "abstract": "Recent advances in large language models (LLMs) have significantly enhanced\nquestion-answering (QA) capabilities, particularly in open-domain contexts.\nHowever, in closed-domain scenarios such as education, healthcare, and law,\nusers demand not only accurate answers but also transparent reasoning and\nexplainable decision-making processes. While neural-symbolic (NeSy) frameworks\nhave emerged as a promising solution, leveraging LLMs for natural language\nunderstanding and symbolic systems for formal reasoning, existing approaches\noften rely on large-scale models and exhibit inefficiencies in translating\nnatural language into formal logic representations.\n  To address these limitations, we introduce Text-JEPA (Text-based\nJoint-Embedding Predictive Architecture), a lightweight yet effective framework\nfor converting natural language into first-order logic (NL2FOL). Drawing\ninspiration from dual-system cognitive theory, Text-JEPA emulates System 1 by\nefficiently generating logic representations, while the Z3 solver operates as\nSystem 2, enabling robust logical inference. To rigorously evaluate the\nNL2FOL-to-reasoning pipeline, we propose a comprehensive evaluation framework\ncomprising three custom metrics: conversion score, reasoning score, and\nSpearman rho score, which collectively capture the quality of logical\ntranslation and its downstream impact on reasoning accuracy.\n  Empirical results on domain-specific datasets demonstrate that Text-JEPA\nachieves competitive performance with significantly lower computational\noverhead compared to larger LLM-based systems. Our findings highlight the\npotential of structured, interpretable reasoning frameworks for building\nefficient and explainable QA systems in specialized domains.",
        "url": "http://arxiv.org/abs/2507.20491v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20491v1",
        "arxiv_id": "2507.20491v1",
        "authors": [
            "Tuan Bui",
            "Trong Le",
            "Phat Thai",
            "Sang Nguyen",
            "Minh Hua",
            "Ngan Pham",
            "Thang Bui",
            "Tho Quan"
        ],
        "submitted": "2025-07-28 03:00:35",
        "source": "arxiv",
        "comment": "8 pages, 3 figures. Accepted at the International Joint Conference on\n  Neural Networks (IJCNN) 2025, Workshop on Trustworthiness and Reliability in\n  Neuro-Symbolic AI. https://2025.ijcnn.org"
    },
    {
        "title": "Improving Community Detection in Academic Networks by Handling Publication Bias",
        "abstract": "Finding potential research collaborators is a challenging task, especially in\ntoday's fast-growing and interdisciplinary research landscape. While\ntraditional methods often rely on observable relationships such as\nco-authorships and citations to construct the research network, in this work,\nwe focus solely on publication content to build a topic-based research network\nusing BERTopic with a fine-tuned SciBERT model that connects and recommends\nresearchers across disciplines based on shared topical interests. A major\nchallenge we address is publication imbalance, where some researchers publish\nmuch more than others, often across several topics. Without careful handling,\ntheir less frequent interests are hidden under dominant topics, limiting the\nnetwork's ability to detect their full research scope. To tackle this, we\nintroduce a cloning strategy that clusters a researcher's publications and\ntreats each cluster as a separate node. This allows researchers to be part of\nmultiple communities, improving the detection of interdisciplinary links.\nEvaluation on the proposed method shows that the cloned network structure leads\nto more meaningful communities and uncovers a broader set of collaboration\nopportunities.",
        "url": "http://arxiv.org/abs/2507.20449v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20449v1",
        "arxiv_id": "2507.20449v1",
        "authors": [
            "Md Asaduzzaman Noor",
            "John Sheppard",
            "Jason Clark"
        ],
        "submitted": "2025-07-28 00:48:33",
        "source": "arxiv",
        "comment": "This paper is an extended version of a work accepted at ASONAM 2025"
    },
    {
        "title": "TIMEST: Temporal Information Motif Estimator Using Sampling Trees",
        "abstract": "The mining of pattern subgraphs, known as motifs, is a core task in the field\nof graph mining. Edges in real-world networks often have timestamps, so there\nis a need for temporal motif mining. A temporal motif is a richer structure\nthat imposes timing constraints on the edges of the motif. Temporal motifs have\nbeen used to analyze social networks, financial transactions, and biological\nnetworks.\n  Motif counting in temporal graphs is particularly challenging. A graph with\nmillions of edges can have trillions of temporal motifs, since the same edge\ncan occur with multiple timestamps. There is a combinatorial explosion of\npossibilities, and state-of-the-art algorithms cannot manage motifs with more\nthan four vertices.\n  In this work, we present TIMEST: a general, fast, and accurate estimation\nalgorithm to count temporal motifs of arbitrary sizes in temporal networks. Our\napproach introduces a temporal spanning tree sampler that leverages weighted\nsampling to generate substructures of target temporal motifs. This method\ncarefully takes a subset of temporal constraints of the motif that can be\njointly and efficiently sampled. TIMEST uses randomized estimation techniques\nto obtain accurate estimates of motif counts.\n  We give theoretical guarantees on the running time and approximation\nguarantees of TIMEST. We perform an extensive experimental evaluation and show\nthat TIMEST is both faster and more accurate than previous algorithms. Our CPU\nimplementation exhibits an average speedup of 28x over state-of-the-art GPU\nimplementation of the exact algorithm, and 6x speedup over SOTA approximate\nalgorithms while consistently showcasing less than 5% error in most cases. For\nexample, TIMEST can count the number of instances of a financial fraud temporal\nmotif in four minutes with 0.6% error, while exact methods take more than two\ndays.",
        "url": "http://arxiv.org/abs/2507.20441v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20441v1",
        "arxiv_id": "2507.20441v1",
        "authors": [
            "Yunjie Pan",
            "Omkar Bhalerao",
            "C. Seshadhri",
            "Nishil Talati"
        ],
        "submitted": "2025-07-27 23:31:55",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CodeNER: Code Prompting for Named Entity Recognition",
        "abstract": "Recent studies have explored various approaches for treating candidate named\nentity spans as both source and target sequences in named entity recognition\n(NER) by leveraging large language models (LLMs). Although previous approaches\nhave successfully generated candidate named entity spans with suitable labels,\nthey rely solely on input context information when using LLMs, particularly,\nChatGPT. However, NER inherently requires capturing detailed labeling\nrequirements with input context information. To address this issue, we propose\na novel method that leverages code-based prompting to improve the capabilities\nof LLMs in understanding and performing NER. By embedding code within prompts,\nwe provide detailed BIO schema instructions for labeling, thereby exploiting\nthe ability of LLMs to comprehend long-range scopes in programming languages.\nExperimental results demonstrate that the proposed code-based prompting method\noutperforms conventional text-based prompting on ten benchmarks across English,\nArabic, Finnish, Danish, and German datasets, indicating the effectiveness of\nexplicitly structuring NER instructions. We also verify that combining the\nproposed code-based prompting method with the chain-of-thought prompting\nfurther improves performance.",
        "url": "http://arxiv.org/abs/2507.20423v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20423v1",
        "arxiv_id": "2507.20423v1",
        "authors": [
            "Sungwoo Han",
            "Hyeyeon Kim",
            "Jingun Kwon",
            "Hidetaka Kamigaito",
            "Manabu Okumura"
        ],
        "submitted": "2025-07-27 21:49:36",
        "source": "arxiv",
        "comment": "18 pages, 6 figures"
    },
    {
        "title": "Survey of NLU Benchmarks Diagnosing Linguistic Phenomena: Why not Standardize Diagnostics Benchmarks?",
        "abstract": "Natural Language Understanding (NLU) is a basic task in Natural Language\nProcessing (NLP). The evaluation of NLU capabilities has become a trending\nresearch topic that attracts researchers in the last few years, resulting in\nthe development of numerous benchmarks. These benchmarks include various tasks\nand datasets in order to evaluate the results of pretrained models via public\nleaderboards. Notably, several benchmarks contain diagnostics datasets designed\nfor investigation and fine-grained error analysis across a wide range of\nlinguistic phenomena. This survey provides a comprehensive review of available\nEnglish, Arabic, and Multilingual NLU benchmarks, with a particular emphasis on\ntheir diagnostics datasets and the linguistic phenomena they covered. We\npresent a detailed comparison and analysis of these benchmarks, highlighting\ntheir strengths and limitations in evaluating NLU tasks and providing in-depth\nerror analysis. When highlighting the gaps in the state-of-the-art, we noted\nthat there is no naming convention for macro and micro categories or even a\nstandard set of linguistic phenomena that should be covered. Consequently, we\nformulated a research question regarding the evaluation metrics of the\nevaluation diagnostics benchmarks: \"Why do not we have an evaluation standard\nfor the NLU evaluation diagnostics benchmarks?\" similar to ISO standard in\nindustry. We conducted a deep analysis and comparisons of the covered\nlinguistic phenomena in order to support experts in building a global hierarchy\nfor linguistic phenomena in future. We think that having evaluation metrics for\ndiagnostics evaluation could be valuable to gain more insights when comparing\nthe results of the studied models on different diagnostics benchmarks.",
        "url": "http://arxiv.org/abs/2507.20419v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20419v1",
        "arxiv_id": "2507.20419v1",
        "authors": [
            "Khloud AL Jallad",
            "Nada Ghneim",
            "Ghaida Rebdawi"
        ],
        "submitted": "2025-07-27 21:30:50",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CONCAP: Seeing Beyond English with Concepts Retrieval-Augmented Captioning",
        "abstract": "Multilingual vision-language models have made significant strides in image\ncaptioning, yet they still lag behind their English counterparts due to limited\nmultilingual training data and costly large-scale model parameterization.\nRetrieval-augmented generation (RAG) offers a promising alternative by\nconditioning caption generation on retrieved examples in the target language,\nreducing the need for extensive multilingual training. However, multilingual\nRAG captioning models often depend on retrieved captions translated from\nEnglish, which can introduce mismatches and linguistic biases relative to the\nsource language. We introduce CONCAP, a multilingual image captioning model\nthat integrates retrieved captions with image-specific concepts, enhancing the\ncontextualization of the input image and grounding the captioning process\nacross different languages. Experiments on the XM3600 dataset indicate that\nCONCAP enables strong performance on low- and mid-resource languages, with\nhighly reduced data requirements. Our findings highlight the effectiveness of\nconcept-aware retrieval augmentation in bridging multilingual performance gaps.",
        "url": "http://arxiv.org/abs/2507.20411v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20411v1",
        "arxiv_id": "2507.20411v1",
        "authors": [
            "George Ibrahim",
            "Rita Ramos",
            "Yova Kementchedjhieva"
        ],
        "submitted": "2025-07-27 21:00:02",
        "source": "arxiv",
        "comment": "Published as a conference paper at COLM 2025"
    },
    {
        "title": "Cognitive Chain-of-Thought: Structured Multimodal Reasoning about Social Situations",
        "abstract": "Chain-of-Thought (CoT) prompting helps models think step by step. But what\nhappens when they must see, understand, and judge-all at once? In visual tasks\ngrounded in social context, where bridging perception with norm-grounded\njudgments is essential, flat CoT often breaks down. We introduce Cognitive\nChain-of-Thought (CoCoT), a prompting strategy that scaffolds VLM reasoning\nthrough three cognitively inspired stages: perception, situation, and norm. Our\nexperiments show that, across multiple multimodal benchmarks (including intent\ndisambiguation, commonsense reasoning, and safety), CoCoT consistently\noutperforms CoT and direct prompting (+8\\% on average). Our findings\ndemonstrate that cognitively grounded reasoning stages enhance interpretability\nand social awareness in VLMs, paving the way for safer and more reliable\nmultimodal systems.",
        "url": "http://arxiv.org/abs/2507.20409v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20409v1",
        "arxiv_id": "2507.20409v1",
        "authors": [
            "Eunkyu Park",
            "Wesley Hanwen Deng",
            "Gunhee Kim",
            "Motahhare Eslami",
            "Maarten Sap"
        ],
        "submitted": "2025-07-27 20:40:30",
        "source": "arxiv",
        "comment": "Under review; 17 pages"
    },
    {
        "title": "Length Representations in Large Language Models",
        "abstract": "Large language models (LLMs) have shown remarkable capabilities across\nvarious tasks, that are learned from massive amounts of text-based data.\nAlthough LLMs can control output sequence length, particularly in\ninstruction-based settings, the internal mechanisms behind this control have\nbeen unexplored yet. In this study, we provide empirical evidence on how output\nsequence length information is encoded within the internal representations in\nLLMs. In particular, our findings show that multi-head attention mechanisms are\ncritical in determining output sequence length, which can be adjusted in a\ndisentangled manner. By scaling specific hidden units within the model, we can\ncontrol the output sequence length without losing the informativeness of the\ngenerated text, thereby indicating that length information is partially\ndisentangled from semantic information. Moreover, some hidden units become\nincreasingly active as prompts become more length-specific, thus reflecting the\nmodel's internal awareness of this attribute. Our findings suggest that LLMs\nhave learned robust and adaptable internal mechanisms for controlling output\nlength without any external control.",
        "url": "http://arxiv.org/abs/2507.20398v1",
        "pdf_url": "http://arxiv.org/pdf/2507.20398v1",
        "arxiv_id": "2507.20398v1",
        "authors": [
            "Sangjun Moon",
            "Dasom Choi",
            "Jingun Kwon",
            "Hidetaka Kamigaito",
            "Manabu Okumura"
        ],
        "submitted": "2025-07-27 19:41:39",
        "source": "arxiv",
        "comment": null
    }
]