[
    {
        "title": "Learning from Supervision with Semantic and Episodic Memory: A Reflective Approach to Agent Adaptation",
        "abstract": "We investigate how agents built on pretrained large language models can learn\ntarget classification functions from labeled examples without parameter\nupdates. While conventional approaches like fine-tuning are often costly,\ninflexible, and opaque, we propose a memory-augmented framework that leverages\nboth labeled data and LLM-generated critiques. Our framework uses episodic\nmemory to store instance-level critiques-capturing specific past\nexperiences-and semantic memory to distill these into reusable, task-level\nguidance. Across a diverse set of tasks, incorporating critiques yields up to a\n24.8 percent accuracy improvement over retrieval-based (RAG-style) baselines\nthat rely only on labels. Through extensive empirical evaluation, we uncover\ndistinct behavioral differences between OpenAI and opensource models,\nparticularly in how they handle fact-oriented versus preference-based data. To\ninterpret how models respond to different representations of supervision\nencoded in memory, we introduce a novel metric, suggestibility. This helps\nexplain observed behaviors and illuminates how model characteristics and memory\nstrategies jointly shape learning dynamics. Our findings highlight the promise\nof memory-driven, reflective learning for building more adaptive and\ninterpretable LLM agents.",
        "url": "http://arxiv.org/abs/2510.19897v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19897v1",
        "arxiv_id": "2510.19897v1",
        "authors": [
            "Jackson Hassell",
            "Dan Zhang",
            "Hannah Kim",
            "Tom Mitchell",
            "Estevam Hruschka"
        ],
        "submitted": "2025-10-22 17:58:03",
        "source": "arxiv",
        "comment": "11 pages"
    },
    {
        "title": "olmOCR 2: Unit Test Rewards for Document OCR",
        "abstract": "We present olmOCR 2, the latest in our family of powerful OCR systems for\nconverting digitized print documents, like PDFs, into clean, naturally ordered\nplain text. olmOCR 2 is powered by olmOCR-2-7B-1025, a specialized, 7B vision\nlanguage model (VLM) trained using reinforcement learning with verifiable\nrewards (RLVR), where our rewards are a diverse set of binary unit tests. To\nscale unit test creation, we develop a pipeline for generating synthetic\ndocuments with diverse and challenging layouts, known ground-truth HTML source\ncode, and extracted test cases. We show that RL training on these test cases\nresults in state-of-the-art performance on olmOCR-Bench, our English-language\nOCR benchmark, with the largest improvements in math formula conversion, table\nparsing, and multi-column layouts compared to previous versions. We release our\nmodel, data and code under permissive open licenses.",
        "url": "http://arxiv.org/abs/2510.19817v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19817v1",
        "arxiv_id": "2510.19817v1",
        "authors": [
            "Jake Poznanski",
            "Luca Soldaini",
            "Kyle Lo"
        ],
        "submitted": "2025-10-22 17:53:02",
        "source": "arxiv",
        "comment": "https://olmocr.allen.ai/"
    },
    {
        "title": "Hubble: a Model Suite to Advance the Study of LLM Memorization",
        "abstract": "We present Hubble, a suite of fully open-source large language models (LLMs)\nfor the scientific study of LLM memorization. Hubble models come in standard\nand perturbed variants: standard models are pretrained on a large English\ncorpus, and perturbed models are trained in the same way but with controlled\ninsertion of text (e.g., book passages, biographies, and test sets) designed to\nemulate key memorization risks. Our core release includes 8 models -- standard\nand perturbed models with 1B or 8B parameters, pretrained on 100B or 500B\ntokens -- establishing that memorization risks are determined by the frequency\nof sensitive data relative to size of the training corpus (i.e., a password\nappearing once in a smaller corpus is memorized better than the same password\nin a larger corpus). Our release also includes 6 perturbed models with text\ninserted at different pretraining phases, showing that sensitive data without\ncontinued exposure can be forgotten. These findings suggest two best practices\nfor addressing memorization risks: to dilute sensitive data by increasing the\nsize of the training corpus, and to order sensitive data to appear earlier in\ntraining. Beyond these general empirical findings, Hubble enables a broad range\nof memorization research; for example, analyzing the biographies reveals how\nreadily different types of private information are memorized. We also\ndemonstrate that the randomized insertions in Hubble make it an ideal testbed\nfor membership inference and machine unlearning, and invite the community to\nfurther explore, benchmark, and build upon our work.",
        "url": "http://arxiv.org/abs/2510.19811v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19811v1",
        "arxiv_id": "2510.19811v1",
        "authors": [
            "Johnny Tian-Zheng Wei",
            "Ameya Godbole",
            "Mohammad Aflah Khan",
            "Ryan Wang",
            "Xiaoyuan Zhu",
            "James Flemings",
            "Nitya Kashyap",
            "Krishna P. Gummadi",
            "Willie Neiswanger",
            "Robin Jia"
        ],
        "submitted": "2025-10-22 17:48:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Pico-Banana-400K: A Large-Scale Dataset for Text-Guided Image Editing",
        "abstract": "Recent advances in multimodal models have demonstrated remarkable text-guided\nimage editing capabilities, with systems like GPT-4o and Nano-Banana setting\nnew benchmarks. However, the research community's progress remains constrained\nby the absence of large-scale, high-quality, and openly accessible datasets\nbuilt from real images. We introduce Pico-Banana-400K, a comprehensive\n400K-image dataset for instruction-based image editing. Our dataset is\nconstructed by leveraging Nano-Banana to generate diverse edit pairs from real\nphotographs in the OpenImages collection. What distinguishes Pico-Banana-400K\nfrom previous synthetic datasets is our systematic approach to quality and\ndiversity. We employ a fine-grained image editing taxonomy to ensure\ncomprehensive coverage of edit types while maintaining precise content\npreservation and instruction faithfulness through MLLM-based quality scoring\nand careful curation. Beyond single turn editing, Pico-Banana-400K enables\nresearch into complex editing scenarios. The dataset includes three specialized\nsubsets: (1) a 72K-example multi-turn collection for studying sequential\nediting, reasoning, and planning across consecutive modifications; (2) a\n56K-example preference subset for alignment research and reward model training;\nand (3) paired long-short editing instructions for developing instruction\nrewriting and summarization capabilities. By providing this large-scale,\nhigh-quality, and task-rich resource, Pico-Banana-400K establishes a robust\nfoundation for training and benchmarking the next generation of text-guided\nimage editing models.",
        "url": "http://arxiv.org/abs/2510.19808v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19808v1",
        "arxiv_id": "2510.19808v1",
        "authors": [
            "Yusu Qian",
            "Eli Bocek-Rivele",
            "Liangchen Song",
            "Jialing Tong",
            "Yinfei Yang",
            "Jiasen Lu",
            "Wenze Hu",
            "Zhe Gan"
        ],
        "submitted": "2025-10-22 17:43:15",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Large Language Model enabled Mathematical Modeling",
        "abstract": "The integration of Large Language Models (LLMs) with optimization modeling\noffers a promising avenue for advancing decision-making in operations research\n(OR). Traditional optimization methods,such as linear programming, mixed\ninteger programming, and simulation depend heavily on domain expertise to\ntranslate real-world problems into solvable mathematical models. While solvers\nlike Gurobi and COPT are powerful, expert input remains essential for defining\nobjectives, constraints, and variables. This research investigates the\npotential of LLMs, specifically the DeepSeek-R1 model, to bridge this\nformulation gap using natural language understanding and code generation.\nAlthough prior models like GPT-4, Claude, and Bard have shown strong\nperformance in NLP and reasoning tasks, their high token costs and tendency\ntoward hallucinations limit real-world applicability in supply chain contexts.\nIn contrast, DeepSeek-R1, a cost-efficient and high-performing model trained\nwith reinforcement learning, presents a viable alternative. Despite its success\nin benchmarks such as LiveCodeBench and Math-500, its effectiveness in applied\nOR scenarios remains under explored. This study systematically evaluates\nDeepSeek-R1 across four key OR benchmarks: NL4OPT, IndustryOR, EasyLP, and\nComplexOR. Our methodology includes baseline assessments, the development of a\nhallucination taxonomy, and the application of mitigation strategies like\nLLM-as-a-Judge, Few-shot Learning (FSL), Tool Calling, and a Multi-agent\nFramework. These techniques aim to reduce hallucinations, enhance formulation\naccuracy, and better align model outputs with user intent.",
        "url": "http://arxiv.org/abs/2510.19895v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19895v1",
        "arxiv_id": "2510.19895v1",
        "authors": [
            "Guoyun Zhang"
        ],
        "submitted": "2025-10-22 17:41:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Scaf-GRPO: Scaffolded Group Relative Policy Optimization for Enhancing LLM Reasoning",
        "abstract": "Reinforcement learning from verifiable rewards has emerged as a powerful\ntechnique for enhancing the complex reasoning abilities of Large Language\nModels (LLMs). However, these methods are fundamentally constrained by the\n''learning cliff'' phenomenon: when faced with problems far beyond their\ncurrent capabilities, models consistently fail, yielding a persistent\nzero-reward signal. In policy optimization algorithms like GRPO, this collapses\nthe advantage calculation to zero, rendering these difficult problems invisible\nto the learning gradient and stalling progress. To overcome this, we introduce\nScaf-GRPO (Scaffolded Group Relative Policy Optimization), a progressive\ntraining framework that strategically provides minimal guidance only when a\nmodel's independent learning has plateaued. The framework first diagnoses\nlearning stagnation and then intervenes by injecting tiered in-prompt hints,\nranging from abstract concepts to concrete steps, enabling the model to\nconstruct a valid solution by itself. Extensive experiments on challenging\nmathematics benchmarks demonstrate Scaf-GRPO's effectiveness, boosting the\npass@1 score of the Qwen2.5-Math-7B model on the AIME24 benchmark by a relative\n44.3% over a vanilla GRPO baseline. This result demonstrates our framework\nprovides a robust and effective methodology for unlocking a model's ability to\nsolve problems previously beyond its reach, a critical step towards extending\nthe frontier of autonomous reasoning in LLM.",
        "url": "http://arxiv.org/abs/2510.19807v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19807v1",
        "arxiv_id": "2510.19807v1",
        "authors": [
            "Xichen Zhang",
            "Sitong Wu",
            "Yinghao Zhu",
            "Haoru Tan",
            "Shaozuo Yu",
            "Ziyi He",
            "Jiaya Jia"
        ],
        "submitted": "2025-10-22 17:41:30",
        "source": "arxiv",
        "comment": "Code: https://github.com/dvlab-research/Scaf-GRPO"
    },
    {
        "title": "The Art of Asking: Multilingual Prompt Optimization for Synthetic Data",
        "abstract": "Synthetic data has become a cornerstone for scaling large language models,\nyet its multilingual use remains bottlenecked by translation-based prompts.\nThis strategy inherits English-centric framing and style and neglects cultural\ndimensions, ultimately constraining model generalization. We argue that the\noverlooked prompt space-the very inputs that define training\ndistributions-offers a more powerful lever for improving multilingual\nperformance. We introduce a lightweight framework for prompt-space\noptimization, where translated prompts are systematically transformed for\nNaturalness, Cultural Adaptation, and Difficulty Enhancement. Using an\noff-the-shelf multilingual LLM, we apply these transformations to prompts for\n12 languages spanning 7 families. Under identical data conditions, our\napproaches achieve substantial and consistent downstream improvements over the\ntranslation-only baseline: +4.7% on Global-MMLU accuracy, +2.4% on Flores\nXCometXL and +35.3% wins in preferences on mArenaHard. We establish\nprompt-space optimization as a simple yet powerful paradigm for building\nmultilingual LLMs that are more robust, culturally grounded, and globally\ncapable.",
        "url": "http://arxiv.org/abs/2510.19806v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19806v1",
        "arxiv_id": "2510.19806v1",
        "authors": [
            "David Mora",
            "Viraat Aryabumi",
            "Wei-Yin Ko",
            "Sara Hooker",
            "Julia Kreutzer",
            "Marzieh Fadaee"
        ],
        "submitted": "2025-10-22 17:41:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Blackbox Model Provenance via Palimpsestic Membership Inference",
        "abstract": "Suppose Alice trains an open-weight language model and Bob uses a blackbox\nderivative of Alice's model to produce text. Can Alice prove that Bob is using\nher model, either by querying Bob's derivative model (query setting) or from\nthe text alone (observational setting)? We formulate this question as an\nindependence testing problem--in which the null hypothesis is that Bob's model\nor text is independent of Alice's randomized training run--and investigate it\nthrough the lens of palimpsestic memorization in language models: models are\nmore likely to memorize data seen later in training, so we can test whether Bob\nis using Alice's model using test statistics that capture correlation between\nBob's model or text and the ordering of training examples in Alice's training\nrun. If Alice has randomly shuffled her training data, then any significant\ncorrelation amounts to exactly quantifiable statistical evidence against the\nnull hypothesis, regardless of the composition of Alice's training data. In the\nquery setting, we directly estimate (via prompting) the likelihood Bob's model\ngives to Alice's training examples and order; we correlate the likelihoods of\nover 40 fine-tunes of various Pythia and OLMo base models ranging from 1B to\n12B parameters with the base model's training data order, achieving a p-value\non the order of at most 1e-8 in all but six cases. In the observational\nsetting, we try two approaches based on estimating 1) the likelihood of Bob's\ntext overlapping with spans of Alice's training examples and 2) the likelihood\nof Bob's text with respect to different versions of Alice's model we obtain by\nrepeating the last phase (e.g., 1%) of her training run on reshuffled data. The\nsecond approach can reliably distinguish Bob's text from as little as a few\nhundred tokens; the first does not involve any retraining but requires many\nmore tokens (several hundred thousand) to achieve high power.",
        "url": "http://arxiv.org/abs/2510.19796v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19796v1",
        "arxiv_id": "2510.19796v1",
        "authors": [
            "Rohith Kuditipudi",
            "Jing Huang",
            "Sally Zhu",
            "Diyi Yang",
            "Christopher Potts",
            "Percy Liang"
        ],
        "submitted": "2025-10-22 17:30:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ToolDreamer: Instilling LLM Reasoning Into Tool Retrievers",
        "abstract": "Tool calling has become increasingly popular for Large Language Models\n(LLMs). However, for large tool sets, the resulting tokens would exceed the\nLLM's context window limit, making it impossible to include every tool. Hence,\nan external retriever is used to provide LLMs with the most relevant tools for\na query. Existing retrieval models rank tools based on the similarity between a\nuser query and a tool description (TD). This leads to suboptimal retrieval as\nuser requests are often poorly aligned with the language of TD. To remedy the\nissue, we propose ToolDreamer, a framework to condition retriever models to\nfetch tools based on hypothetical (synthetic) TD generated using an LLM, i.e.,\ndescription of tools that the LLM feels will be potentially useful for the\nquery. The framework enables a more natural alignment between queries and tools\nwithin the language space of TD's. We apply ToolDreamer on the ToolRet dataset\nand show that our method improves the performance of sparse and dense\nretrievers with and without training, thus showcasing its flexibility. Through\nour proposed framework, our aim is to offload a portion of the reasoning burden\nto the retriever so that the LLM may effectively handle a large collection of\ntools without inundating its context window.",
        "url": "http://arxiv.org/abs/2510.19791v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19791v1",
        "arxiv_id": "2510.19791v1",
        "authors": [
            "Saptarshi Sengupta",
            "Zhengyu Zhou",
            "Jun Araki",
            "Xingbo Wang",
            "Bingqing Wang",
            "Suhang Wang",
            "Zhe Feng"
        ],
        "submitted": "2025-10-22 17:26:05",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Can They Dixit? Yes they Can! Dixit as a Playground for Multimodal Language Model Capabilities",
        "abstract": "Multi-modal large language models (MLMs) are often assessed on static,\nindividual benchmarks -- which cannot jointly assess MLM capabilities in a\nsingle task -- or rely on human or model pairwise comparisons -- which is\nhighly subjective, expensive, and allows models to exploit superficial\nshortcuts (e.g., verbosity) to inflate their win-rates. To overcome these\nissues, we propose game-based evaluations to holistically assess MLM\ncapabilities. Games require multiple abilities for players to win, are\ninherently competitive, and are governed by fix, objective rules, and makes\nevaluation more engaging, providing a robust framework to address the\naforementioned challenges. We manifest this evaluation specifically through\nDixit, a fantasy card game where players must generate captions for a card that\ntrick some, but not all players, into selecting the played card. Our\nquantitative experiments with five MLMs show Dixit win-rate rankings are\nperfectly correlated with those on popular MLM benchmarks, while games between\nhuman and MLM players in Dixit reveal several differences between agent\nstrategies and areas of improvement for MLM reasoning.",
        "url": "http://arxiv.org/abs/2510.19892v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19892v1",
        "arxiv_id": "2510.19892v1",
        "authors": [
            "Nishant Balepur",
            "Dang Nguyen",
            "Dayeon Ki"
        ],
        "submitted": "2025-10-22 17:21:16",
        "source": "arxiv",
        "comment": "Accepted as a Spotlight paper at the EMNLP 2025 Wordplay Workshop"
    },
    {
        "title": "Adapting Multilingual Models to Code-Mixed Tasks via Model Merging",
        "abstract": "We study model merging as a practical alternative to conventional adaptation\nstrategies for code-mixed NLP. Starting from a multilingual base model, we: (i)\nperform continued pre-training (CPT) on unlabeled code-mixed text to obtain an\nadapted checkpoint, (ii) merge checkpoint with the base model, and (iii)\nfine-tune (FT) on the downstream task data. We evaluate our approach for\nsentence classification (sentiment and hate speech) task in English-Hindi\n(En-Hi) and English-Spanish (En-Es) using XLM-R and Llama-3.2-1B models. Our\nresults show that merged models consistently outperform full fine-tuning and\nCPT->FT. We observe gains of 2--5 points in F1 over full fine-tuning and ~1-2\npoints over CPT->FT, indicating that unlabeled data is leveraged more\neffectively via merging than via CPT alone. Zero-/few-shot prompting with\nlarger LLMs (e.g., Llama-3.3-70B) lags behind fine-tuned and merged\ncheckpoints, underscoring limits of in-context learning for code-mixed inputs.\nWe further test cross-pair transfer by training on En-Hi and evaluating on\nEn-Ta and En-Ml: merged checkpoints transfer more strongly than\nmonolingual-English baselines (e.g., TV/TIES variants reaching 0.65-0.68 F1 vs\n0.61-0.63 for full fine-tuning), suggesting that code-mixed knowledge is a more\nreliable substrate for low-resource pairs. We conclude with adaptation recipes\nmatched to common data regimes (labeled only; labeled+unlabeled; transfer-only)\nand discuss limitations and scaling considerations for broader tasks and larger\nmodels.",
        "url": "http://arxiv.org/abs/2510.19782v2",
        "pdf_url": "http://arxiv.org/pdf/2510.19782v2",
        "arxiv_id": "2510.19782v2",
        "authors": [
            "Prashant Kodali",
            "Vaishnavi Shivkumar",
            "Swarang Joshi",
            "Monojit Choudhary",
            "Ponnurangam Kumaraguru",
            "Manish Shrivastava"
        ],
        "submitted": "2025-10-22 17:16:23",
        "source": "arxiv",
        "comment": "9 pages, 5 tables, CODS 2025"
    },
    {
        "title": "AdaSPEC: Selective Knowledge Distillation for Efficient Speculative Decoders",
        "abstract": "Speculative Decoding (SD) accelerates large language model inference by\nemploying a small draft model to generate predictions, which are then verified\nby a larger target model. The effectiveness of SD hinges on the alignment\nbetween these models, which is typically enhanced by Knowledge Distillation\n(KD). However, conventional KD methods aim to minimize the KL divergence\nbetween the draft and target models across all tokens, a goal that is\nmisaligned with the true objective of SD, which is to maximize token acceptance\nrate. Therefore, draft models often struggle to fully assimilate the target\nmodel's knowledge due to capacity constraints, leading to suboptimal\nperformance. To address this challenge, we propose AdaSPEC, a novel method that\nincorporates selective token filtering into the KD process. AdaSPEC utilizes a\nreference model to identify and filter out difficult-to-fit tokens, enabling\nthe distillation of a draft model that better aligns with the target model on\nsimpler tokens. This approach improves the overall token acceptance rate\nwithout compromising generation quality. We evaluate AdaSPEC across diverse\ntasks, including arithmetic reasoning, instruction-following, coding, and\nsummarization, using model configurations of 31M/1.4B and 350M/2.7B parameters.\nOur results demonstrate that AdaSPEC consistently outperforms the\nstate-of-the-art DistillSpec method, achieving higher acceptance rates across\nall tasks (up to 15\\%). The code is publicly available at\nhttps://github.com/yuezhouhu/adaspec.",
        "url": "http://arxiv.org/abs/2510.19779v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19779v1",
        "arxiv_id": "2510.19779v1",
        "authors": [
            "Yuezhou Hu",
            "Jiaxin Guo",
            "Xinyu Feng",
            "Tuo Zhao"
        ],
        "submitted": "2025-10-22 17:13:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "GaLLoP: Gradient-based Sparse Learning on Low-Magnitude Parameters",
        "abstract": "Sparse fine-tuning techniques adapt LLMs to downstream tasks by only tuning a\nsparse subset of model parameters. However, the effectiveness of sparse\nadaptation depends on optimally selecting the model parameters to be\nfine-tuned. In this work, we introduce a novel sparse fine-tuning technique\nnamed GaLLoP: Gradient-based Sparse Learning on Low-Magnitude Parameters, which\nfine-tunes only those model parameters which have the largest gradient\nmagnitudes on downstream tasks and the smallest pre-trained magnitudes,\nintuitively prioritizing parameters that are highly task-relevant, but\nminimally disruptive to pre-trained knowledge. Our experimentation with LLaMA3\n8B and Gemma 2B as base models shows that GaLLoP consistently improves or\nmatches the in-distribution as well as out-of-distribution performance obtained\nvia the usage of other leading parameter-efficient fine-tuning techniques,\nincluding LoRA, DoRA, and SAFT. Our analysis demonstrates that GaLLoP mitigates\ncatastrophic forgetting and memorization of task data, as important pre-trained\nparameters remain unchanged, and stabilizes performance relative to other\nfine-tuning techniques, robustly generalizing across most random seeds.",
        "url": "http://arxiv.org/abs/2510.19778v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19778v1",
        "arxiv_id": "2510.19778v1",
        "authors": [
            "Anand Choudhary",
            "Yasser Sulaıman",
            "Lukas Mauch",
            "Ghouthi Boukli Hacene",
            "Fabien Cardinaux",
            "Antoine Bosselut"
        ],
        "submitted": "2025-10-22 17:11:49",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SmartSwitch: Advancing LLM Reasoning by Overcoming Underthinking via Promoting Deeper Thought Exploration",
        "abstract": "The long chain-of-thought (LongCoT) capability is central to the recent\nbreakthroughs achieved by large language models in complex reasoning tasks.\nHowever, the accompanying issue of ''underthinking'', where models exhibit\nshallow reasoning by frequently switching thoughts without sufficient\nexploration, limits both performance and token efficiency. To address this\nproblem, we propose a simple yet effective reasoning strategy: the SmartSwitch\ninference framework. This framework can be easily integrated into any large\nlanguage model as a plug-and-play solution, continuously monitoring the model's\nreasoning process to detect underthinking and guide it toward deeper\nexploration of promising but overlooked thoughts. Specifically, the perception\nmodule identifies points where thoughts switch and evaluates the potential of\nthe preceding thought using an off-the-shelf process reward model (PRM). If a\nhigh-potential thought is found to be prematurely abandoned, the intervention\nmodule interrupts the ongoing inference, backtracks to the point before the\nswitch, and inserts a \"deepening prompt\" to encourage further exploration along\nthat promising path. Extensive experiments on challenging mathematical\nreasoning benchmarks demonstrate that our method significantly enhances the\nperformance of various large language models of different sizes.",
        "url": "http://arxiv.org/abs/2510.19767v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19767v1",
        "arxiv_id": "2510.19767v1",
        "authors": [
            "Xichen Zhang",
            "Sitong Wu",
            "Haoru Tan",
            "Shaozuo Yu",
            "Yinghao Zhu",
            "Ziyi He",
            "Jiaya Jia"
        ],
        "submitted": "2025-10-22 16:56:01",
        "source": "arxiv",
        "comment": "Code: https://github.com/dvlab-research/SmartSwitch"
    },
    {
        "title": "Top-P Masking for Cross Language Information Retrieval",
        "abstract": "Top-K masking schemes have been proposed as a method to promote sparse\nrepresentations in Information Retrieval (IR) tasks, as a simple alternative to\nFloating Point Operations per Second (FLOPS) regularization. Algorithms such as\nBilingual Lexical and Document Expansion Model (BLADE), adopt this approach as\na post-processing stage. We propose using Top-P Dynamic Masking similar to\nNucleus Sampling in Large Language Models, and demonstrate better performance\nthan Top-K masking. Specifically, we evaluate our methods in the domain of\nCross Language Information Retrieval (CLIR)",
        "url": "http://arxiv.org/abs/2510.19758v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19758v1",
        "arxiv_id": "2510.19758v1",
        "authors": [
            "Joseph Casale",
            "Andrew Silverschotz",
            "Joseph DeSimone"
        ],
        "submitted": "2025-10-22 16:47:42",
        "source": "arxiv",
        "comment": "Unsubmitted"
    },
    {
        "title": "Zhyper: Factorized Hypernetworks for Conditioned LLM Fine-Tuning",
        "abstract": "Large Language Model (LLM) conditioning refers to instructing an LLM to\ngenerate content in accordance with the norms and values of a specific culture,\nbeliefs of a particular political orientation, or any desired text-specified\nsemantic conditioning. Unfortunately, prompt engineering does not ensure that\nLLMs behave in accordance with a desired conditioning due to the inductive bias\nof the pre-training and alignment datasets. Prior works have focused on\nfine-tuning LLMs by directly conditioning the LoRA weights; however, such\nmethods introduce a large number of parameters. As a remedy, we propose Zhyper,\na parameter-efficient factorized hypernetwork framework that generates\ncontext-aware LoRA adapters from textual descriptions. Experiments on multiple\nbenchmarks show that Zhyper achieves competitive performance with up to 26x\nfewer parameters than the state-of-the-art baselines. Furthermore, we extend\nZhyper to cultural alignment, demonstrating improved generalization to\nout-of-domain settings and a better capturing of fine-grained contextual\nvalues.",
        "url": "http://arxiv.org/abs/2510.19733v2",
        "pdf_url": "http://arxiv.org/pdf/2510.19733v2",
        "arxiv_id": "2510.19733v2",
        "authors": [
            "M. H. I. Abdalla",
            "Zhipin Wang",
            "Christian Frey",
            "Steffen Eger",
            "Josif Grabocka"
        ],
        "submitted": "2025-10-22 16:25:43",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "From Answers to Guidance: A Proactive Dialogue System for Legal Documents",
        "abstract": "The accessibility of legal information remains a constant challenge,\nparticularly for laypersons seeking to understand and apply complex\ninstitutional texts. While the European Union provides open access to\nlegislation, parliamentary responses, and regulatory documents, these resources\ncan be challenging for laypeople to explore. In this paper, we introduce\nEUDial, a proactive multi-turn dialogue dataset constructed from 204 blogs\ncurated by the Citizens' Enquiries Unit (AskEP) of the European Parliamentary\nResearch Service. EUDial contains 880 dialogue turns (averaging 4.3 turns per\ndialogue), where each dialogue includes initial questions, structured answers,\nand follow-up questions. Beyond dataset construction, we propose the LexGuide\nframework that leverages retrieval-augmented generation with hierarchical topic\norganization to structure dialogue progression, ensuring both comprehensive\ncoverage of legal aspects and coherence across conversational turns. The\nresults demonstrate that proactive, structured navigation closes the gap\nbetween the availability of legal information and citizen comprehension,\nestablishing EUDial and LexGuide as practical resources for advancing proactive\nlegal dialogue systems.",
        "url": "http://arxiv.org/abs/2510.19723v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19723v1",
        "arxiv_id": "2510.19723v1",
        "authors": [
            "Ashish Chouhan",
            "Michael Gertz"
        ],
        "submitted": "2025-10-22 16:08:05",
        "source": "arxiv",
        "comment": "21 pages, 3 figures, 2 tables, 2 prompts"
    },
    {
        "title": "An Expert-grounded benchmark of General Purpose LLMs in LCA",
        "abstract": "Purpose: Artificial intelligence (AI), and in particular large language\nmodels (LLMs), are increasingly being explored as tools to support life cycle\nassessment (LCA). While demonstrations exist across environmental and social\ndomains, systematic evidence on their reliability, robustness, and usability\nremains limited. This study provides the first expert-grounded benchmark of\nLLMs in LCA, addressing the absence of standardized evaluation frameworks in a\nfield where no clear ground truth or consensus protocols exist.\n  Methods: We evaluated eleven general-purpose LLMs, spanning both commercial\nand open-source families, across 22 LCA-related tasks. Seventeen experienced\npractitioners reviewed model outputs against criteria directly relevant to LCA\npractice, including scientific accuracy, explanation quality, robustness,\nverifiability, and adherence to instructions. We collected 168 expert reviews.\n  Results: Experts judged 37% of responses to contain inaccurate or misleading\ninformation. Ratings of accuracy and quality of explanation were generally\nrated average or good on many models even smaller models, and format adherence\nwas generally rated favourably. Hallucination rates varied significantly, with\nsome models producing hallucinated citations at rates of up to 40%. There was\nno clear-cut distinction between ratings on open-weight versus closed-weight\nLLMs, with open-weight models outperforming or competing on par with\nclosed-weight models on criteria such as accuracy and quality of explanation.\n  Conclusion: These findings highlight the risks of applying LLMs na\\\"ively in\nLCA, such as when LLMs are treated as free-form oracles, while also showing\nbenefits especially around quality of explanation and alleviating labour\nintensiveness of simple tasks. The use of general-purpose LLMs without\ngrounding mechanisms presents ...",
        "url": "http://arxiv.org/abs/2510.19886v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19886v1",
        "arxiv_id": "2510.19886v1",
        "authors": [
            "Artur Donaldson",
            "Bharathan Balaji",
            "Cajetan Oriekezie",
            "Manish Kumar",
            "Laure Patouillard"
        ],
        "submitted": "2025-10-22 15:56:54",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Do Prompts Reshape Representations? An Empirical Study of Prompting Effects on Embeddings",
        "abstract": "Prompting is a common approach for leveraging LMs in zero-shot settings.\nHowever, the underlying mechanisms that enable LMs to perform diverse tasks\nwithout task-specific supervision remain poorly understood. Studying the\nrelationship between prompting and the quality of internal representations can\nshed light on how pre-trained embeddings may support in-context task solving.\nIn this empirical study, we conduct a series of probing experiments on prompt\nembeddings, analyzing various combinations of prompt templates for zero-shot\nclassification. Our findings show that while prompting affects the quality of\nrepresentations, these changes do not consistently correlate with the relevance\nof the prompts to the target task. This result challenges the assumption that\nmore relevant prompts necessarily lead to better representations. We further\nanalyze potential factors that may contribute to this unexpected behavior.",
        "url": "http://arxiv.org/abs/2510.19694v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19694v1",
        "arxiv_id": "2510.19694v1",
        "authors": [
            "Cesar Gonzalez-Gutierrez",
            "Dirk Hovy"
        ],
        "submitted": "2025-10-22 15:43:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Are Large Language Models Sensitive to the Motives Behind Communication?",
        "abstract": "Human communication is motivated: people speak, write, and create content\nwith a particular communicative intent in mind. As a result, information that\nlarge language models (LLMs) and AI agents process is inherently framed by\nhumans' intentions and incentives. People are adept at navigating such nuanced\ninformation: we routinely identify benevolent or self-serving motives in order\nto decide what statements to trust. For LLMs to be effective in the real world,\nthey too must critically evaluate content by factoring in the motivations of\nthe source -- for instance, weighing the credibility of claims made in a sales\npitch. In this paper, we undertake a comprehensive study of whether LLMs have\nthis capacity for motivational vigilance. We first employ controlled\nexperiments from cognitive science to verify that LLMs' behavior is consistent\nwith rational models of learning from motivated testimony, and find they\nsuccessfully discount information from biased sources in a human-like manner.\nWe then extend our evaluation to sponsored online adverts, a more naturalistic\nreflection of LLM agents' information ecosystems. In these settings, we find\nthat LLMs' inferences do not track the rational models' predictions nearly as\nclosely -- partly due to additional information that distracts them from\nvigilance-relevant considerations. However, a simple steering intervention that\nboosts the salience of intentions and incentives substantially increases the\ncorrespondence between LLMs and the rational model. These results suggest that\nLLMs possess a basic sensitivity to the motivations of others, but generalizing\nto novel real-world settings will require further improvements to these models.",
        "url": "http://arxiv.org/abs/2510.19687v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19687v1",
        "arxiv_id": "2510.19687v1",
        "authors": [
            "Addison J. Wu",
            "Ryan Liu",
            "Kerem Oktar",
            "Theodore R. Sumers",
            "Thomas L. Griffiths"
        ],
        "submitted": "2025-10-22 15:35:00",
        "source": "arxiv",
        "comment": "NeurIPS 2025"
    },
    {
        "title": "CoSense-LLM: Semantics at the Edge with Cost- and Uncertainty-Aware Cloud-Edge Cooperation",
        "abstract": "We present CoSense-LLM, an edge-first framework that turns continuous\nmultimodal sensor streams (for example Wi-Fi CSI, IMU, audio, RFID, and\nlightweight vision) into compact, verifiable semantic tokens and coordinates\nwith large language models under explicit latency, energy, bandwidth, and\nprivacy constraints. CoSense-LLM has four parts: (i) SenseFusion, a lightweight\nencoder that aligns sensor embeddings with language and compresses them into\nshort discrete code sequences; (ii) Edge-RAG, a local hybrid retrieval layer\nthat grounds generation in site specific policies and notes; (iii)\nPromptRouter, a cost and uncertainty aware policy that selects edge only\ngeneration, edge plus retrieval, or compact cloud escalation; and (iv) Secure\nExecution, an auditable redaction path that enforces data minimization so raw\nwaveforms never leave the device. The system works with modern serving\noptimizations, including paged or streaming KV caches, FlashAttention style\nkernels, speculative decoding, and quantized LoRA adapters, and supports on\ndevice personalization and federated updates under non IID drift. Across home,\noffice, and clinic deployments, CoSense-LLM delivers grounded explanations\nwhile meeting tight service level objectives: it sustains sub second (p95) end\nto end latency on edge dominant paths, reduces inter tier token and bandwidth\ncosts by preferring local retrieval grounded responses, and preserves privacy\nby transmitting only discrete codes and redacted metadata. Ablations show that\nEdge-RAG improves factual consistency and reduces contradictions, calibrated\nuncertainty enables selective abstention and controlled escalations, and KV\nplus decoding accelerators lower energy per decision. The results support an\nedge first design that treats semantics, privacy, and predictable latency as co\nequal goals for large model deployments in interference prone environments.",
        "url": "http://arxiv.org/abs/2510.19670v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19670v1",
        "arxiv_id": "2510.19670v1",
        "authors": [
            "Hasan Akgul",
            "Mari Eplik",
            "Javier Rojas",
            "Aina Binti Abdullah",
            "Pieter van der Merwe"
        ],
        "submitted": "2025-10-22 15:16:56",
        "source": "arxiv",
        "comment": "19 pages,8 figures"
    },
    {
        "title": "DiffAdapt: Difficulty-Adaptive Reasoning for Token-Efficient LLM Inference",
        "abstract": "Recent reasoning Large Language Models (LLMs) demonstrate remarkable\nproblem-solving abilities but often generate long thinking traces whose utility\nis unclear. Our work aims to improve their efficiency, enabling them to reach\nhigh performance without overthinking. First, we analyze the entropy of token\nprobabilities in reasoning traces. Across three models, we observe a consistent\nU-shaped entropy pattern: high entropy on easy problems despite high accuracy,\nlow entropy on problems with medium difficulty, and high entropy on hard\nproblems reflecting uncertainty. Specifically, we notice 22--25\\% entropy\nreduction from easy to medium difficulty regions, suggesting an {overthinking}\nphenomenon on easy instances. Building on these insights, we introduce\n\\textbf{DiffAdapt}, a lightweight framework that selects Easy/Normal/Hard\ninference strategies per question based on their difficulty and reasoning trace\nentropy. Each inference strategy consists of a fixed prompt, temperature and\nmaximum token length. In contrast to existing efficiency optimization methods,\nour approach does not fine-tune base LLM but a small probe that classifies\nLLM's final hidden state, allowing inexpensive adaptation. We comprehensively\nevaluate our method on five models and eight benchmarks. Our method achieves\ncomparable or improved accuracy while reducing token usage by up to 22.4\\%,\nestablishing a practical path toward compute-efficient reasoning.",
        "url": "http://arxiv.org/abs/2510.19669v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19669v1",
        "arxiv_id": "2510.19669v1",
        "authors": [
            "Xiang Liu",
            "Xuming Hu",
            "Xiaowen Chu",
            "Eunsol Choi"
        ],
        "submitted": "2025-10-22 15:16:06",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Unraveling Emotions with Pre-Trained Models",
        "abstract": "Transformer models have significantly advanced the field of emotion\nrecognition. However, there are still open challenges when exploring open-ended\nqueries for Large Language Models (LLMs). Although current models offer good\nresults, automatic emotion analysis in open texts presents significant\nchallenges, such as contextual ambiguity, linguistic variability, and\ndifficulty interpreting complex emotional expressions. These limitations make\nthe direct application of generalist models difficult. Accordingly, this work\ncompares the effectiveness of fine-tuning and prompt engineering in emotion\ndetection in three distinct scenarios: (i) performance of fine-tuned\npre-trained models and general-purpose LLMs using simple prompts; (ii)\neffectiveness of different emotion prompt designs with LLMs; and (iii) impact\nof emotion grouping techniques on these models. Experimental tests attain\nmetrics above 70% with a fine-tuned pre-trained model for emotion recognition.\nMoreover, the findings highlight that LLMs require structured prompt\nengineering and emotion grouping to enhance their performance. These\nadvancements improve sentiment analysis, human-computer interaction, and\nunderstanding of user behavior across various domains.",
        "url": "http://arxiv.org/abs/2510.19668v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19668v1",
        "arxiv_id": "2510.19668v1",
        "authors": [
            "Alejandro Pajón-Sanmartín",
            "Francisco De Arriba-Pérez",
            "Silvia García-Méndez",
            "Fátima Leal",
            "Benedita Malheiro",
            "Juan Carlos Burguillo-Rial"
        ],
        "submitted": "2025-10-22 15:13:52",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "From Forecasting to Planning: Policy World Model for Collaborative State-Action Prediction",
        "abstract": "Despite remarkable progress in driving world models, their potential for\nautonomous systems remains largely untapped: the world models are mostly\nlearned for world simulation and decoupled from trajectory planning. While\nrecent efforts aim to unify world modeling and planning in a single framework,\nthe synergistic facilitation mechanism of world modeling for planning still\nrequires further exploration. In this work, we introduce a new driving paradigm\nnamed Policy World Model (PWM), which not only integrates world modeling and\ntrajectory planning within a unified architecture, but is also able to benefit\nplanning using the learned world knowledge through the proposed action-free\nfuture state forecasting scheme. Through collaborative state-action prediction,\nPWM can mimic the human-like anticipatory perception, yielding more reliable\nplanning performance. To facilitate the efficiency of video forecasting, we\nfurther introduce a dynamically enhanced parallel token generation mechanism,\nequipped with a context-guided tokenizer and an adaptive dynamic focal loss.\nDespite utilizing only front camera input, our method matches or exceeds\nstate-of-the-art approaches that rely on multi-view and multi-modal inputs.\nCode and model weights will be released at\nhttps://github.com/6550Zhao/Policy-World-Model.",
        "url": "http://arxiv.org/abs/2510.19654v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19654v1",
        "arxiv_id": "2510.19654v1",
        "authors": [
            "Zhida Zhao",
            "Talas Fu",
            "Yifan Wang",
            "Lijun Wang",
            "Huchuan Lu"
        ],
        "submitted": "2025-10-22 14:57:51",
        "source": "arxiv",
        "comment": "Accepted by NuerIPS 2025 (Poster)"
    },
    {
        "title": "LLavaCode: Compressed Code Representations for Retrieval-Augmented Code Generation",
        "abstract": "Retrieval-augmented generation has emerged as one of the most effective\napproaches for code completion, particularly when context from a surrounding\nrepository is essential. However, incorporating context significantly extends\nsequence length, leading to slower inference - a critical limitation for\ninteractive settings such as IDEs. In this work, we introduce LlavaCode, a\nframework that compresses code into compact, semantically rich representations\ninterpretable by code LLM, enhancing generation quality while reducing the\nretrieved context to only a few compressed single-token vectors. Using a small\nprojector module we can significantly increase the EM and ES metrics of coding\nmodel with negligible latency increase. Our experiments demonstrate that\ncompressed context enables 20-38% reduction in Time-to-First-Token (TTFT) on\nline completion tasks compared to full-RAG pipelines.",
        "url": "http://arxiv.org/abs/2510.19644v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19644v1",
        "arxiv_id": "2510.19644v1",
        "authors": [
            "Daria Cherniuk",
            "Nikita Sukhorukov",
            "Nikita Sushko",
            "Daniil Gusak",
            "Danil Sivtsov",
            "Elena Tutubalina",
            "Evgeny Frolov"
        ],
        "submitted": "2025-10-22 14:49:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Style Attack Disguise: When Fonts Become a Camouflage for Adversarial Intent",
        "abstract": "With social media growth, users employ stylistic fonts and font-like emoji to\nexpress individuality, creating visually appealing text that remains\nhuman-readable. However, these fonts introduce hidden vulnerabilities in NLP\nmodels: while humans easily read stylistic text, models process these\ncharacters as distinct tokens, causing interference. We identify this\nhuman-model perception gap and propose a style-based attack, Style Attack\nDisguise (SAD). We design two sizes: light for query efficiency and strong for\nsuperior attack performance. Experiments on sentiment classification and\nmachine translation across traditional models, LLMs, and commercial services\ndemonstrate SAD's strong attack performance. We also show SAD's potential\nthreats to multimodal tasks including text-to-image and text-to-speech\ngeneration.",
        "url": "http://arxiv.org/abs/2510.19641v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19641v1",
        "arxiv_id": "2510.19641v1",
        "authors": [
            "Yangshijie Zhang",
            "Xinda Wang",
            "Jialin Liu",
            "Wenqiang Wang",
            "Zhicong Ma",
            "Xingxing Jia"
        ],
        "submitted": "2025-10-22 14:40:24",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "HSCodeComp: A Realistic and Expert-level Benchmark for Deep Search Agents in Hierarchical Rule Application",
        "abstract": "Effective deep search agents must not only access open-domain and\ndomain-specific knowledge but also apply complex rules-such as legal clauses,\nmedical manuals and tariff rules. These rules often feature vague boundaries\nand implicit logic relationships, making precise application challenging for\nagents. However, this critical capability is largely overlooked by current\nagent benchmarks.\n  To fill this gap, we introduce HSCodeComp, the first realistic, expert-level\ne-commerce benchmark designed to evaluate deep search agents in hierarchical\nrule application. In this task, the deep reasoning process of agents is guided\nby these rules to predict 10-digit Harmonized System Code (HSCode) of products\nwith noisy but realistic descriptions. These codes, established by the World\nCustoms Organization, are vital for global supply chain efficiency. Built from\nreal-world data collected from large-scale e-commerce platforms, our proposed\nHSCodeComp comprises 632 product entries spanning diverse product categories,\nwith these HSCodes annotated by several human experts.\n  Extensive experimental results on several state-of-the-art LLMs, open-source,\nand closed-source agents reveal a huge performance gap: best agent achieves\nonly 46.8% 10-digit accuracy, far below human experts at 95.0%. Besides,\ndetailed analysis demonstrates the challenges of hierarchical rule application,\nand test-time scaling fails to improve performance further.",
        "url": "http://arxiv.org/abs/2510.19631v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19631v1",
        "arxiv_id": "2510.19631v1",
        "authors": [
            "Yiqian Yang",
            "Tian Lan",
            "Qianghuai Jia",
            "Li Zhu",
            "Hui Jiang",
            "Hang Zhu",
            "Longyue Wang",
            "Weihua Luo",
            "Kaifu Zhang"
        ],
        "submitted": "2025-10-22 14:28:33",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CrossNews-UA: A Cross-lingual News Semantic Similarity Benchmark for Ukrainian, Polish, Russian, and English",
        "abstract": "In the era of social networks and rapid misinformation spread, news analysis\nremains a critical task. Detecting fake news across multiple languages,\nparticularly beyond English, poses significant challenges. Cross-lingual news\ncomparison offers a promising approach to verify information by leveraging\nexternal sources in different languages (Chen and Shu, 2024). However, existing\ndatasets for cross-lingual news analysis (Chen et al., 2022a) were manually\ncurated by journalists and experts, limiting their scalability and adaptability\nto new languages. In this work, we address this gap by introducing a scalable,\nexplainable crowdsourcing pipeline for cross-lingual news similarity\nassessment. Using this pipeline, we collected a novel dataset CrossNews-UA of\nnews pairs in Ukrainian as a central language with linguistically and\ncontextually relevant languages-Polish, Russian, and English. Each news pair is\nannotated for semantic similarity with detailed justifications based on the 4W\ncriteria (Who, What, Where, When). We further tested a range of models, from\ntraditional bag-of-words, Transformer-based architectures to large language\nmodels (LLMs). Our results highlight the challenges in multilingual news\nanalysis and offer insights into models performance.",
        "url": "http://arxiv.org/abs/2510.19628v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19628v1",
        "arxiv_id": "2510.19628v1",
        "authors": [
            "Daryna Dementieva",
            "Evgeniya Sukhodolskaya",
            "Alexander Fraser"
        ],
        "submitted": "2025-10-22 14:23:50",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "PBBQ: A Persian Bias Benchmark Dataset Curated with Human-AI Collaboration for Large Language Models",
        "abstract": "With the increasing adoption of large language models (LLMs), ensuring their\nalignment with social norms has become a critical concern. While prior research\nhas examined bias detection in various languages, there remains a significant\ngap in resources addressing social biases within Persian cultural contexts. In\nthis work, we introduce PBBQ, a comprehensive benchmark dataset designed to\nevaluate social biases in Persian LLMs. Our benchmark, which encompasses 16\ncultural categories, was developed through questionnaires completed by 250\ndiverse individuals across multiple demographics, in close collaboration with\nsocial science experts to ensure its validity. The resulting PBBQ dataset\ncontains over 37,000 carefully curated questions, providing a foundation for\nthe evaluation and mitigation of bias in Persian language models. We benchmark\nseveral open-source LLMs, a closed-source model, and Persian-specific\nfine-tuned models on PBBQ. Our findings reveal that current LLMs exhibit\nsignificant social biases across Persian culture. Additionally, by comparing\nmodel outputs to human responses, we observe that LLMs often replicate human\nbias patterns, highlighting the complex interplay between learned\nrepresentations and cultural stereotypes.Upon acceptance of the paper, our PBBQ\ndataset will be publicly available for use in future work. Content warning:\nThis paper contains unsafe content.",
        "url": "http://arxiv.org/abs/2510.19616v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19616v1",
        "arxiv_id": "2510.19616v1",
        "authors": [
            "Farhan Farsi",
            "Shayan Bali",
            "Fatemeh Valeh",
            "Parsa Ghofrani",
            "Alireza Pakniat",
            "Kian Kashfipour",
            "Amir H. Payberah"
        ],
        "submitted": "2025-10-22 14:12:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Human-Agent Collaborative Paper-to-Page Crafting for Under $0.1",
        "abstract": "In the quest for scientific progress, communicating research is as vital as\nthe discovery itself. Yet, researchers are often sidetracked by the manual,\nrepetitive chore of building project webpages to make their dense papers\naccessible. While automation has tackled static slides and posters, the\ndynamic, interactive nature of webpages has remained an unaddressed challenge.\nTo bridge this gap, we reframe the problem, arguing that the solution lies not\nin a single command, but in a collaborative, hierarchical process. We introduce\n$\\textbf{AutoPage}$, a novel multi-agent system that embodies this philosophy.\nAutoPage deconstructs paper-to-page creation into a coarse-to-fine pipeline\nfrom narrative planning to multimodal content generation and interactive\nrendering. To combat AI hallucination, dedicated \"Checker\" agents verify each\nstep against the source paper, while optional human checkpoints ensure the\nfinal product aligns perfectly with the author's vision, transforming the\nsystem from a mere tool into a powerful collaborative assistant. To rigorously\nvalidate our approach, we also construct $\\textbf{PageBench}$, the first\nbenchmark for this new task. Experiments show AutoPage not only generates\nhigh-quality, visually appealing pages but does so with remarkable efficiency\nin under 15 minutes for less than \\$0.1. Code and dataset will be released at\n$\\href{https://mqleet.github.io/AutoPage_ProjectPage/}{Webpage}$.",
        "url": "http://arxiv.org/abs/2510.19600v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19600v1",
        "arxiv_id": "2510.19600v1",
        "authors": [
            "Qianli Ma",
            "Siyu Wang",
            "Yilin Chen",
            "Yinhao Tang",
            "Yixiang Yang",
            "Chang Guo",
            "Bingjie Gao",
            "Zhening Xing",
            "Yanan Sun",
            "Zhipeng Zhang"
        ],
        "submitted": "2025-10-22 13:53:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Detecting Latin in Historical Books with Large Language Models: A Multimodal Benchmark",
        "abstract": "This paper presents a novel task of extracting Latin fragments from\nmixed-language historical documents with varied layouts. We benchmark and\nevaluate the performance of large foundation models against a multimodal\ndataset of 724 annotated pages. The results demonstrate that reliable Latin\ndetection with contemporary models is achievable. Our study provides the first\ncomprehensive analysis of these models' capabilities and limits for this task.",
        "url": "http://arxiv.org/abs/2510.19585v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19585v1",
        "arxiv_id": "2510.19585v1",
        "authors": [
            "Yu Wu",
            "Ke Shu",
            "Jonas Fischer",
            "Lidia Pivovarova",
            "David Rosson",
            "Eetu Mäkelä",
            "Mikko Tolonen"
        ],
        "submitted": "2025-10-22 13:37:52",
        "source": "arxiv",
        "comment": "Under review. Both the dataset and code will be published"
    },
    {
        "title": "A Matter of Time: Revealing the Structure of Time in Vision-Language Models",
        "abstract": "Large-scale vision-language models (VLMs) such as CLIP have gained popularity\nfor their generalizable and expressive multimodal representations. By\nleveraging large-scale training data with diverse textual metadata, VLMs\nacquire open-vocabulary capabilities, solving tasks beyond their training\nscope. This paper investigates the temporal awareness of VLMs, assessing their\nability to position visual content in time. We introduce TIME10k, a benchmark\ndataset of over 10,000 images with temporal ground truth, and evaluate the\ntime-awareness of 37 VLMs by a novel methodology. Our investigation reveals\nthat temporal information is structured along a low-dimensional, non-linear\nmanifold in the VLM embedding space. Based on this insight, we propose methods\nto derive an explicit ``timeline'' representation from the embedding space.\nThese representations model time and its chronological progression and thereby\nfacilitate temporal reasoning tasks. Our timeline approaches achieve\ncompetitive to superior accuracy compared to a prompt-based baseline while\nbeing computationally efficient. All code and data are available at\nhttps://tekayanidham.github.io/timeline-page/.",
        "url": "http://arxiv.org/abs/2510.19559v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19559v1",
        "arxiv_id": "2510.19559v1",
        "authors": [
            "Nidham Tekaya",
            "Manuela Waldner",
            "Matthias Zeppelzauer"
        ],
        "submitted": "2025-10-22 13:14:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "[De|Re]constructing VLMs' Reasoning in Counting",
        "abstract": "Vision-Language Models (VLMs) have recently gained attention due to their\ncompetitive performance on multiple downstream tasks, achieved by following\nuser-input instructions. However, VLMs still exhibit several limitations in\nvisual reasoning, such as difficulties in identifying relations (e.g., spatial,\ntemporal, and among objects), understanding temporal sequences (e.g., frames),\nand counting objects. In this work, we go beyond score-level benchmark\nevaluations of VLMs by investigating the underlying causes of their failures\nand proposing a targeted approach to improve their reasoning capabilities. We\nstudy the reasoning skills of seven state-of-the-art VLMs in the counting task\nunder controlled experimental conditions. Our experiments show that VLMs are\nhighly sensitive to the number and type of objects, their spatial arrangement,\nand the co-occurrence of distractors. A layer-wise analysis reveals that errors\nare due to incorrect mapping of the last-layer representation into the output\nspace. Our targeted training shows that fine-tuning just the output layer\nimproves accuracy by up to 21%. We corroborate these findings by achieving\nconsistent improvements on real-world datasets.",
        "url": "http://arxiv.org/abs/2510.19555v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19555v1",
        "arxiv_id": "2510.19555v1",
        "authors": [
            "Simone Alghisi",
            "Gabriel Roccabruna",
            "Massimo Rizzoli",
            "Seyed Mahed Mousavi",
            "Giuseppe Riccardi"
        ],
        "submitted": "2025-10-22 13:08:47",
        "source": "arxiv",
        "comment": "This work has been submitted to the IEEE for possible publication"
    },
    {
        "title": "Conditions for Catastrophic Forgetting in Multilingual Translation",
        "abstract": "Fine-tuning multilingual foundation models on specific languages often\ninduces catastrophic forgetting, degrading performance on languages unseen in\nfine-tuning. While this phenomenon is widely-documented, the literature\npresents fragmented results about when forgetting occurs. To address this\nambiguity, we conduct a systematic empirical study using machine translation as\na testbed to identify the conditions that trigger catastrophic forgetting in\nmultilingual fine-tuning. Through controlled experiments across different model\narchitectures, data scales, and fine-tuning approaches, we reveal that the\nrelative scale between model and data size is a primary determinant of\nforgetting. Moreover, we demonstrate that a model's instruction-following\nability is more critical for retaining multilingual knowledge than its\narchitecture. Contrary to assumptions, parameter-efficient fine-tuning offers\nno clear advantage over full fine-tuning in mitigating forgetting. Lastly, we\nshow that cross-lingual alignment can mitigate forgetting while also\nfacilitating positive transfer to unseen target languages.",
        "url": "http://arxiv.org/abs/2510.19546v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19546v1",
        "arxiv_id": "2510.19546v1",
        "authors": [
            "Danni Liu",
            "Jan Niehues"
        ],
        "submitted": "2025-10-22 12:54:00",
        "source": "arxiv",
        "comment": "Multilingual Representation Learning (MRL) Workshop 2025"
    },
    {
        "title": "Which Evaluation for Which Model? A Taxonomy for Speech Model Assessment",
        "abstract": "Speech foundation models have recently achieved remarkable capabilities\nacross a wide range of tasks. However, their evaluation remains disjointed\nacross tasks and model types. Different models excel at distinct aspects of\nspeech processing and thus require different evaluation protocols. This paper\nproposes a unified taxonomy that addresses the question: Which evaluation is\nappropriate for which model? The taxonomy defines three orthogonal axes: the\n\\textbf{evaluation aspect} being measured, the model capabilities required to\nattempt the task, and the task or protocol requirements needed to perform it.\nWe classify a broad set of existing evaluations and benchmarks along these\naxes, spanning areas such as representation learning, speech generation, and\ninteractive dialogue. By mapping each evaluation to the capabilities a model\nexposes (e.g., speech generation, real-time processing) and to its\nmethodological demands (e.g., fine-tuning data, human judgment), the taxonomy\nprovides a principled framework for aligning models with suitable evaluation\nmethods. It also reveals systematic gaps, such as limited coverage of prosody,\ninteraction, or reasoning, that highlight priorities for future benchmark\ndesign. Overall, this work offers a conceptual foundation and practical guide\nfor selecting, interpreting, and extending evaluations of speech models.",
        "url": "http://arxiv.org/abs/2510.19509v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19509v1",
        "arxiv_id": "2510.19509v1",
        "authors": [
            "Maureen de Seyssel",
            "Eeshan Gunesh Dhekane"
        ],
        "submitted": "2025-10-22 12:04:32",
        "source": "arxiv",
        "comment": "57 pages (26 main, 25 appendix, 6 references)"
    },
    {
        "title": "Lookahead Routing for Large Language Models",
        "abstract": "Large language model (LLM) routers improve the efficiency of multi-model\nsystems by directing each query to the most appropriate model while leveraging\nthe diverse strengths of heterogeneous LLMs. Most existing approaches frame\nrouting as a classification problem based solely on the input query. While this\nreduces overhead by avoiding inference across all models, it overlooks valuable\ninformation that could be gleaned from potential outputs and fails to capture\nimplicit intent or contextual nuances that often emerge only during response\ngeneration. These limitations can result in suboptimal routing decisions,\nparticularly for complex or ambiguous queries that require deeper semantic\nunderstanding. To address this challenge, we propose Lookahead, a routing\nframework that \"foresees\" potential model outputs by predicting their latent\nrepresentations and uses these predictions to guide model selection, thus\nenabling more informed routing without full inference. Within this framework,\nwe implement two approaches based on causal and masked language models.\nEmpirical evaluations across seven public benchmarks - spanning instruction\nfollowing, mathematical reasoning, and code generation - show that Lookahead\nconsistently outperforms existing routing baselines, achieving an average\nperformance gain of 7.7% over the state-of-the-art. Our code is available at\nhttps://github.com/huangcb01/lookahead-routing.",
        "url": "http://arxiv.org/abs/2510.19506v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19506v1",
        "arxiv_id": "2510.19506v1",
        "authors": [
            "Canbin Huang",
            "Tianyuan Shi",
            "Yuhua Zhu",
            "Ruijun Chen",
            "Xiaojun Quan"
        ],
        "submitted": "2025-10-22 12:00:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Automated HIV Screening on Dutch EHR with Large Language Models",
        "abstract": "Efficient screening and early diagnosis of HIV are critical for reducing\nonward transmission. Although large scale laboratory testing is not feasible,\nthe widespread adoption of Electronic Health Records (EHRs) offers new\nopportunities to address this challenge. Existing research primarily focuses on\napplying machine learning methods to structured data, such as patient\ndemographics, for improving HIV diagnosis. However, these approaches often\noverlook unstructured text data such as clinical notes, which potentially\ncontain valuable information relevant to HIV risk. In this study, we propose a\nnovel pipeline that leverages a Large Language Model (LLM) to analyze\nunstructured EHR text and determine a patient's eligibility for further HIV\ntesting. Experimental results on clinical data from Erasmus University Medical\nCenter Rotterdam demonstrate that our pipeline achieved high accuracy while\nmaintaining a low false negative rate.",
        "url": "http://arxiv.org/abs/2510.19879v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19879v1",
        "arxiv_id": "2510.19879v1",
        "authors": [
            "Lang Zhou",
            "Amrish Jhingoer",
            "Yinghao Luo",
            "Klaske Vliegenthart--Jongbloed",
            "Carlijn Jordans",
            "Ben Werkhoven",
            "Tom Seinen",
            "Erik van Mulligen",
            "Casper Rokx",
            "Yunlei Li"
        ],
        "submitted": "2025-10-22 11:53:14",
        "source": "arxiv",
        "comment": "28 pages, 6 figures"
    },
    {
        "title": "What is the Best Sequence Length for BABYLM?",
        "abstract": "Transformer language models typically operate with a fixed-length context\nwindow, which has grown in step with large-scale pretraining datasets. In the\nBabyLM Challenge, however, many past submissions have defaulted to using much\nshorter sequence lengths. We examine the impact of sequence length on BabyLM\npretraining, to answer the simple question: what sequence length should we be\nusing when training Baby LMs? Using 100M-word training data and fixed compute\nbudgets, we compare 125M-parameter Mamba and OPT models, finding that although\nlonger is often better, the optimal length depends on both task and\narchitecture. Shorter sequences are sufficient for grammatical generalization\ntasks whereas longer contexts benefit morphological analogical reasoning tasks.",
        "url": "http://arxiv.org/abs/2510.19493v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19493v1",
        "arxiv_id": "2510.19493v1",
        "authors": [
            "Suchir Salhan",
            "Richard Diehl Martinez",
            "Zébulon Goriely",
            "Paula Buttery"
        ],
        "submitted": "2025-10-22 11:42:33",
        "source": "arxiv",
        "comment": "Paper Accepted at the 2025 BabyLM Workshop @ EMNLP (Suzhou, China)"
    },
    {
        "title": "Machine Text Detectors are Membership Inference Attacks",
        "abstract": "Although membership inference attacks (MIAs) and machine-generated text\ndetection target different goals, identifying training samples and synthetic\ntexts, their methods often exploit similar signals based on a language model's\nprobability distribution. Despite this shared methodological foundation, the\ntwo tasks have been independently studied, which may lead to conclusions that\noverlook stronger methods and valuable insights developed in the other task. In\nthis work, we theoretically and empirically investigate the transferability,\ni.e., how well a method originally developed for one task performs on the\nother, between MIAs and machine text detection. For our theoretical\ncontribution, we prove that the metric that achieves the asymptotically highest\nperformance on both tasks is the same. We unify a large proportion of the\nexisting literature in the context of this optimal metric and hypothesize that\nthe accuracy with which a given method approximates this metric is directly\ncorrelated with its transferability. Our large-scale empirical experiments,\nincluding 7 state-of-the-art MIA methods and 5 state-of-the-art machine text\ndetectors across 13 domains and 10 generators, demonstrate very strong rank\ncorrelation (rho > 0.6) in cross-task performance. We notably find that\nBinoculars, originally designed for machine text detection, achieves\nstate-of-the-art performance on MIA benchmarks as well, demonstrating the\npractical impact of the transferability. Our findings highlight the need for\ngreater cross-task awareness and collaboration between the two research\ncommunities. To facilitate cross-task developments and fair evaluations, we\nintroduce MINT, a unified evaluation suite for MIAs and machine-generated text\ndetection, with implementation of 15 recent methods from both tasks.",
        "url": "http://arxiv.org/abs/2510.19492v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19492v1",
        "arxiv_id": "2510.19492v1",
        "authors": [
            "Ryuto Koike",
            "Liam Dugan",
            "Masahiro Kaneko",
            "Chris Callison-Burch",
            "Naoaki Okazaki"
        ],
        "submitted": "2025-10-22 11:39:01",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "VideoAgentTrek: Computer Use Pretraining from Unlabeled Videos",
        "abstract": "Training computer-use agents requires massive amounts of GUI interaction\ndata, but manually annotating action trajectories at scale is prohibitively\nexpensive. We present VideoAgentTrek, a scalable pipeline that automatically\nmines training data from publicly available screen-recorded videos at web\nscale, eliminating the need for manual annotation. Our approach addresses a key\nchallenge: raw videos contain implicit demonstrations but lack explicit action\nlabels. To solve this, we develop Video2Action, an inverse dynamics module\n(IDM) with two components: (1) a video grounding model that detects and\nlocalizes GUI actions with precise temporal boundaries and context, and (2) an\naction-content recognizer that extracts structured parameters like click\ncoordinates and typed text with high fidelity. Applied to 39,000 YouTube\ntutorial videos, our pipeline generates 1.52 million interaction steps\nautomatically. We leverage this data through continued pretraining followed by\nsupervised fine-tuning. On OSWorld-Verified, our approach improves task success\nrates from 9.3% (SFT-only baseline) to 15.8%, a 70% relative improvement. On\nAgentNetBench, step accuracy increases from 64.1% to 69.3%. Our results\ndemonstrate that passive internet videos can be transformed into high-quality\nsupervision for computer-use agents, providing a scalable alternative to\nexpensive manual annotation.",
        "url": "http://arxiv.org/abs/2510.19488v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19488v1",
        "arxiv_id": "2510.19488v1",
        "authors": [
            "Dunjie Lu",
            "Yiheng Xu",
            "Junli Wang",
            "Haoyuan Wu",
            "Xinyuan Wang",
            "Zekun Wang",
            "Junlin Yang",
            "Hongjin Su",
            "Jixuan Chen",
            "Junda Chen",
            "Yuchen Mao",
            "Jingren Zhou",
            "Junyang Lin",
            "Binyuan Hui",
            "Tao Yu"
        ],
        "submitted": "2025-10-22 11:25:48",
        "source": "arxiv",
        "comment": "8 pages, 6 figures"
    },
    {
        "title": "Re-evaluating Minimum Bayes Risk Decoding for Automatic Speech Recognition",
        "abstract": "Recent work has shown that sample-based Minimum Bayes Risk (MBR) decoding\noutperforms beam search in text-to-text generation tasks, such as machine\ntranslation, text summarization, and image captioning. On the other hand, beam\nsearch is the current practice for speech-to-text tasks such as automatic\nspeech recognition (ASR) and Speech Translation (ST). Given that MBR decoding\nis effective in text-to-text generation tasks, it is reasonable to expect it to\nalso be effective for speech-to-text tasks. In this paper, we evaluate MBR\ndecoding for ASR and ST tasks on English and Japanese using Whisper and its\nderivative models. We observe that the accuracy of MBR decoding outperforms\nthat of beam search in most of the experimental settings we have evaluated. The\nresults show that MBR decoding is a promising method for offline ASR and ST\ntasks that require high accuracy. The code is available at\nhttps://github.com/CyberAgentAILab/mbr-for-asr",
        "url": "http://arxiv.org/abs/2510.19471v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19471v1",
        "arxiv_id": "2510.19471v1",
        "authors": [
            "Yuu Jinnai"
        ],
        "submitted": "2025-10-22 11:06:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MINED: Probing and Updating with Multimodal Time-Sensitive Knowledge for Large Multimodal Models",
        "abstract": "Large Multimodal Models (LMMs) encode rich factual knowledge via cross-modal\npre-training, yet their static representations struggle to maintain an accurate\nunderstanding of time-sensitive factual knowledge. Existing benchmarks remain\nconstrained by static designs, inadequately evaluating LMMs' ability to\nunderstand time-sensitive knowledge. To address this gap, we propose MINED, a\ncomprehensive benchmark that evaluates temporal awareness along 6 key\ndimensions and 11 challenging tasks: cognition, awareness, trustworthiness,\nunderstanding, reasoning, and robustness. MINED is constructed from Wikipedia\nby two professional annotators, containing 2,104 time-sensitive knowledge\nsamples spanning six knowledge types. Evaluating 15 widely used LMMs on MINED\nshows that Gemini-2.5-Pro achieves the highest average CEM score of 63.07,\nwhile most open-source LMMs still lack time understanding ability. Meanwhile,\nLMMs perform best on organization knowledge, whereas their performance is\nweakest on sport. To address these challenges, we investigate the feasibility\nof updating time-sensitive knowledge in LMMs through knowledge editing methods\nand observe that LMMs can effectively update knowledge via knowledge editing\nmethods in single editing scenarios.",
        "url": "http://arxiv.org/abs/2510.19457v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19457v1",
        "arxiv_id": "2510.19457v1",
        "authors": [
            "Kailin Jiang",
            "Ning Jiang",
            "Yuchen Ren",
            "Yuchen Li",
            "Yifan Gao",
            "Jinhe Bi",
            "Yunpu Ma",
            "Qingqing Liu",
            "Xianhao Wang",
            "Yifan Jia",
            "Hongbo Jiang",
            "Yaocong Hu",
            "Bin Li",
            "Lei Liu",
            "Yuntao Du"
        ],
        "submitted": "2025-10-22 10:41:57",
        "source": "arxiv",
        "comment": "project page:https://mined-lmm.github.io/"
    },
    {
        "title": "LLM Unlearning with LLM Beliefs",
        "abstract": "Large language models trained on vast corpora inherently risk memorizing\nsensitive or harmful content, which may later resurface in their outputs.\nPrevailing unlearning methods generally rely on gradient ascent and its\nvariants to lower the probability of specific target responses. However, we\nfind that this strategy induces a critical side effect: probability mass is\nredistributed into high-likelihood regions, often corresponding to semantically\nrelated rephrasings of the targets. We refer to this as the squeezing effect,\nwhich explains why many methods yield merely spurious unlearning, a problem\nfurther obscured by automated metrics (e.g., ROUGE, truth ratio) that misreport\nactual success. To address this, we propose a bootstrapping (BS) framework that\nexplicitly links the squeezing effect with the model's own high-confidence\ngenerations, namely its model beliefs. Since model beliefs inherently capture\nthe very high-likelihood regions where probability mass is squeezed,\nincorporating them into the unlearning objective directly counters the\nsqueezing effect. By jointly suppressing both target responses and model\nbeliefs, BS-T (token) attenuates high-probability tokens, whereas BS-S\n(sequence) removes entire high-confidence generations, together achieving more\nthorough forgetting while preserving utility. Extensive experiments across\ndiverse benchmarks with various model families confirm the effectiveness of our\napproach.",
        "url": "http://arxiv.org/abs/2510.19422v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19422v1",
        "arxiv_id": "2510.19422v1",
        "authors": [
            "Kemou Li",
            "Qizhou Wang",
            "Yue Wang",
            "Fengpeng Li",
            "Jun Liu",
            "Bo Han",
            "Jiantao Zhou"
        ],
        "submitted": "2025-10-22 09:44:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Stream: Scaling up Mechanistic Interpretability to Long Context in LLMs via Sparse Attention",
        "abstract": "As Large Language Models (LLMs) scale to million-token contexts, traditional\nMechanistic Interpretability techniques for analyzing attention scale\nquadratically with context length, demanding terabytes of memory beyond 100,000\ntokens. We introduce Sparse Tracing, a novel technique that leverages dynamic\nsparse attention to efficiently analyze long context attention patterns. We\npresent Stream, a compilable hierarchical pruning algorithm that estimates\nper-head sparse attention masks in near-linear time $O(T \\log T)$ and linear\nspace $O(T)$, enabling one-pass interpretability at scale. Stream performs a\nbinary-search-style refinement to retain only the top-$k$ key blocks per query\nwhile preserving the model's next-token behavior. We apply Stream to long\nchain-of-thought reasoning traces and identify thought anchors while pruning\n97-99\\% of token interactions. On the RULER benchmark, Stream preserves\ncritical retrieval paths while discarding 90-96\\% of interactions and exposes\nlayer-wise routes from the needle to output. Our method offers a practical\ndrop-in tool for analyzing attention patterns and tracing information flow\nwithout terabytes of caches. By making long context interpretability feasible\non consumer GPUs, Sparse Tracing helps democratize chain-of-thought monitoring.\nCode is available at https://anonymous.4open.science/r/stream-03B8/.",
        "url": "http://arxiv.org/abs/2510.19875v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19875v1",
        "arxiv_id": "2510.19875v1",
        "authors": [
            "J Rosser",
            "José Luis Redondo García",
            "Gustavo Penha",
            "Konstantina Palla",
            "Hugues Bouchard"
        ],
        "submitted": "2025-10-22 09:42:29",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "BLiSS 1.0: Evaluating Bilingual Learner Competence in Second Language Small Language Models",
        "abstract": "To bridge the gap between performance-oriented benchmarks and the evaluation\nof cognitively inspired models, we introduce BLiSS 1.0, a Benchmark of Learner\nInterlingual Syntactic Structure. Our benchmark operationalizes a new paradigm\nof selective tolerance, testing whether a model finds a naturalistic learner\nerror more plausible than a matched, artificial error within the same sentence.\nConstructed from over 2.8 million naturalistic learner sentences, BLiSS\nprovides 136,867 controlled triplets (corrected, learner, artificial) for this\npurpose. Experiments on a diverse suite of models demonstrate that selective\ntolerance is a distinct capability from standard grammaticality, with\nperformance clustering strongly by training paradigm. This validates BLiSS as a\nrobust tool for measuring how different training objectives impact a model's\nalignment with the systematic patterns of human language acquisition.",
        "url": "http://arxiv.org/abs/2510.19419v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19419v1",
        "arxiv_id": "2510.19419v1",
        "authors": [
            "Yuan Gao",
            "Suchir Salhan",
            "Andrew Caines",
            "Paula Buttery",
            "Weiwei Sun"
        ],
        "submitted": "2025-10-22 09:42:01",
        "source": "arxiv",
        "comment": "Accepted Paper at the BabyLM Workshop 2025 @ EMNLP (Presentation in\n  Suzhou, China)"
    },
    {
        "title": "Spatio-temporal Sign Language Representation and Translation",
        "abstract": "This paper describes the DFKI-MLT submission to the WMT-SLT 2022 sign\nlanguage translation (SLT) task from Swiss German Sign Language (video) into\nGerman (text). State-of-the-art techniques for SLT use a generic seq2seq\narchitecture with customized input embeddings. Instead of word embeddings as\nused in textual machine translation, SLT systems use features extracted from\nvideo frames. Standard approaches often do not benefit from temporal features.\nIn our participation, we present a system that learns spatio-temporal feature\nrepresentations and translation in a single model, resulting in a real\nend-to-end architecture expected to better generalize to new data sets. Our\nbest system achieved $5\\pm1$ BLEU points on the development set, but the\nperformance on the test dropped to $0.11\\pm0.06$ BLEU points.",
        "url": "http://arxiv.org/abs/2510.19413v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19413v1",
        "arxiv_id": "2510.19413v1",
        "authors": [
            "Yasser Hamidullah",
            "Josef van Genabith",
            "Cristina España-Bonet"
        ],
        "submitted": "2025-10-22 09:34:01",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ToMMeR -- Efficient Entity Mention Detection from Large Language Models",
        "abstract": "Identifying which text spans refer to entities -- mention detection -- is\nboth foundational for information extraction and a known performance\nbottleneck. We introduce ToMMeR, a lightweight model (<300K parameters) probing\nmention detection capabilities from early LLM layers. Across 13 NER benchmarks,\nToMMeR achieves 93\\% recall zero-shot, with over 90\\% precision using an LLM as\na judge showing that ToMMeR rarely produces spurious predictions despite high\nrecall. Cross-model analysis reveals that diverse architectures (14M-15B\nparameters) converge on similar mention boundaries (DICE >75\\%), confirming\nthat mention detection emerges naturally from language modeling. When extended\nwith span classification heads, ToMMeR achieves near SOTA NER performance\n(80-87\\% F1 on standard benchmarks). Our work provides evidence that structured\nentity representations exist in early transformer layers and can be efficiently\nrecovered with minimal parameters.",
        "url": "http://arxiv.org/abs/2510.19410v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19410v1",
        "arxiv_id": "2510.19410v1",
        "authors": [
            "Victor Morand",
            "Nadi Tomeh",
            "Josiane Mothe",
            "Benjamin Piwowarski"
        ],
        "submitted": "2025-10-22 09:28:18",
        "source": "arxiv",
        "comment": "Code is available at https://github.com/VictorMorand/llm2ner"
    },
    {
        "title": "SONAR-SLT: Multilingual Sign Language Translation via Language-Agnostic Sentence Embedding Supervision",
        "abstract": "Sign language translation (SLT) is typically trained with text in a single\nspoken language, which limits scalability and cross-language generalization.\nEarlier approaches have replaced gloss supervision with text-based sentence\nembeddings, but up to now, these remain tied to a specific language and\nmodality. In contrast, here we employ language-agnostic, multimodal embeddings\ntrained on text and speech from multiple languages to supervise SLT, enabling\ndirect multilingual translation. To address data scarcity, we propose a coupled\naugmentation method that combines multilingual target augmentations (i.e.\ntranslations into many languages) with video-level perturbations, improving\nmodel robustness. Experiments show consistent BLEURT gains over text-only\nsentence embedding supervision, with larger improvements in low-resource\nsettings. Our results demonstrate that language-agnostic embedding supervision,\ncombined with coupled augmentation, provides a scalable and semantically robust\nalternative to traditional SLT training.",
        "url": "http://arxiv.org/abs/2510.19398v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19398v1",
        "arxiv_id": "2510.19398v1",
        "authors": [
            "Yasser Hamidullah",
            "Shakib Yazdani",
            "Cennet Oguz",
            "Josef van Genabith",
            "Cristina España-Bonet"
        ],
        "submitted": "2025-10-22 09:17:31",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ColorAgent: Building A Robust, Personalized, and Interactive OS Agent",
        "abstract": "With the advancements in hardware, software, and large language model\ntechnologies, the interaction between humans and operating systems has evolved\nfrom the command-line interface to the rapidly emerging AI agent interactions.\nBuilding an operating system (OS) agent capable of executing user instructions\nand faithfully following user desires is becoming a reality. In this technical\nreport, we present ColorAgent, an OS agent designed to engage in long-horizon,\nrobust interactions with the environment while also enabling personalized and\nproactive user interaction. To enable long-horizon interactions with the\nenvironment, we enhance the model's capabilities through step-wise\nreinforcement learning and self-evolving training, while also developing a\ntailored multi-agent framework that ensures generality, consistency, and\nrobustness. In terms of user interaction, we explore personalized user intent\nrecognition and proactive engagement, positioning the OS agent not merely as an\nautomation tool but as a warm, collaborative partner. We evaluate ColorAgent on\nthe AndroidWorld and AndroidLab benchmarks, achieving success rates of 77.2%\nand 50.7%, respectively, establishing a new state of the art. Nonetheless, we\nnote that current benchmarks are insufficient for a comprehensive evaluation of\nOS agents and propose further exploring directions in future work, particularly\nin the areas of evaluation paradigms, agent collaboration, and security. Our\ncode is available at https://github.com/MadeAgents/mobile-use.",
        "url": "http://arxiv.org/abs/2510.19386v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19386v1",
        "arxiv_id": "2510.19386v1",
        "authors": [
            "Ning Li",
            "Qiqiang Lin",
            "Zheng Wu",
            "Xiaoyun Mo",
            "Weiming Zhang",
            "Yin Zhao",
            "Xiangmou Qu",
            "Jiamu Zhou",
            "Jun Wang",
            "Congmin Zheng",
            "Yuanyi Song",
            "Hongjiang Chen",
            "Heyuan Huang",
            "Jihong Wang",
            "Jiaxin Yin",
            "Jingwei Yu",
            "Junwei Liao",
            "Qiuying Peng",
            "Xingyu Lou",
            "Jun Wang",
            "Weiwen Liu",
            "Zhuosheng Zhang",
            "Weinan Zhang"
        ],
        "submitted": "2025-10-22 09:02:48",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Sign Language Translation with Sentence Embedding Supervision",
        "abstract": "State-of-the-art sign language translation (SLT) systems facilitate the\nlearning process through gloss annotations, either in an end2end manner or by\ninvolving an intermediate step. Unfortunately, gloss labelled sign language\ndata is usually not available at scale and, when available, gloss annotations\nwidely differ from dataset to dataset. We present a novel approach using\nsentence embeddings of the target sentences at training time that take the role\nof glosses. The new kind of supervision does not need any manual annotation but\nit is learned on raw textual data. As our approach easily facilitates\nmultilinguality, we evaluate it on datasets covering German (PHOENIX-2014T) and\nAmerican (How2Sign) sign languages and experiment with mono- and multilingual\nsentence embeddings and translation systems. Our approach significantly\noutperforms other gloss-free approaches, setting the new state-of-the-art for\ndata sets where glosses are not available and when no additional SLT datasets\nare used for pretraining, diminishing the gap between gloss-free and\ngloss-dependent systems.",
        "url": "http://arxiv.org/abs/2510.19367v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19367v1",
        "arxiv_id": "2510.19367v1",
        "authors": [
            "Yasser Hamidullah",
            "Josef van Genabith",
            "Cristina España-Bonet"
        ],
        "submitted": "2025-10-22 08:40:41",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MoE-Prism: Disentangling Monolithic Experts for Elastic MoE Services via Model-System Co-Designs",
        "abstract": "Mixture-of-Experts (MoE) models, the state-of-the-art in large-scale AI,\nachieve high quality by sparsely activating parameters. However, their reliance\non routing between a few monolithic experts via a top-k mechanism creates a\n\"quality cliff\", offering only a few coarse-grained operating points. This\ninflexibility forces a difficult trade-off between cost and quality, preventing\nadaptation to diverse Service Level Objectives (SLOs) and leading to\nsignificant resource over-provisioning.\n  This paper introduces MoE-Prism, a model-system co-design that transforms\nrigid MoE models into elastic services. Our methodology is divided into two\nphases. First, an \\emph{Offline Refactoring Engine} systematically deconstructs\nmonolithic experts into fine-grained \"sub-experts.\" This engine employs a\npartitioning optimization solver that uses a metaheuristic-based approach to\ngroup neurons, preserving functional locality without requiring retraining.\nSecond, an \\emph{Online Scheduling Engine} leverages this new elasticity\nthrough QoS-aware scheduling. It implements specialized policies to solve\ncomplex system problems, including maximizing throughput in cloud deployments\nand managing latency-optimized offloading for memory-constrained devices. Our\nevaluation across three different MoE models shows that MoE-Prismprovides over\n4 times more distinct, stable operating points than the baseline. This allows\nan AI service to dynamically improve throughput by up to 19.9\\% under a strict\nlatency budget or reduce latency by up to 10.36\\% under limited resources.\nMoE-Prism provides the critical \"control knob\" to bridge the model-system gap,\nenabling the next generation of adaptive, efficient, and QoS-aware AI services.",
        "url": "http://arxiv.org/abs/2510.19366v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19366v1",
        "arxiv_id": "2510.19366v1",
        "authors": [
            "Xinfeng Xia",
            "Jiacheng Liu",
            "Xiaofeng Hou",
            "Peng Tang",
            "Mingxuan Zhang",
            "Wenfeng Wang",
            "Chao Li"
        ],
        "submitted": "2025-10-22 08:40:01",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The Massive Legal Embedding Benchmark (MLEB)",
        "abstract": "We present the Massive Legal Embedding Benchmark (MLEB), the largest, most\ndiverse, and most comprehensive open-source benchmark for legal information\nretrieval to date. MLEB consists of ten expert-annotated datasets spanning\nmultiple jurisdictions (the US, UK, EU, Australia, Ireland, and Singapore),\ndocument types (cases, legislation, regulatory guidance, contracts, and\nliterature), and task types (search, zero-shot classification, and question\nanswering). Seven of the datasets in MLEB were newly constructed in order to\nfill domain and jurisdictional gaps in the open-source legal information\nretrieval landscape. We document our methodology in building MLEB and creating\nthe new constituent datasets, and release our code, results, and data openly to\nassist with reproducible evaluations.",
        "url": "http://arxiv.org/abs/2510.19365v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19365v1",
        "arxiv_id": "2510.19365v1",
        "authors": [
            "Umar Butler",
            "Abdur-Rahman Butler",
            "Adrian Lucas Malec"
        ],
        "submitted": "2025-10-22 08:38:44",
        "source": "arxiv",
        "comment": "15 pages, 2 figures"
    },
    {
        "title": "LoongRL:Reinforcement Learning for Advanced Reasoning over Long Contexts",
        "abstract": "Reasoning over long contexts is essential for large language models. While\nreinforcement learning (RL) enhances short-context reasoning by inducing \"Aha\"\nmoments in chain-of-thought, the advanced thinking patterns required for\nlong-context reasoning remain largely unexplored, and high-difficulty RL data\nare scarce. In this paper, we introduce LoongRL, a data-driven RL method for\nadvanced long-context reasoning. Central to LoongRL is KeyChain, a synthesis\napproach that transforms short multi-hop QA into high-difficulty long-context\ntasks by inserting UUID chains that hide the true question among large\ncollections of distracting documents. Solving these tasks requires the model to\ntrace the correct chain step-by-step, identify the true question, retrieve\nrelevant facts and reason over them to answer correctly. RL training on\nKeyChain data induces an emergent plan-retrieve-reason-recheck reasoning\npattern that generalizes far beyond training length. Models trained at 16K\neffectively solve 128K tasks without prohibitive full-length RL rollout costs.\nOn Qwen2.5-7B and 14B, LoongRL substantially improves long-context multi-hop QA\naccuracy by +23.5% and +21.1% absolute gains. The resulting LoongRL-14B reaches\na score of 74.2, rivaling much larger frontier models such as o3-mini (74.5)\nand DeepSeek-R1 (74.9). It also improves long-context retrieval, passes all\n128K needle-in-a-haystack stress tests, and preserves short-context reasoning\ncapabilities.",
        "url": "http://arxiv.org/abs/2510.19363v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19363v1",
        "arxiv_id": "2510.19363v1",
        "authors": [
            "Siyuan Wang",
            "Gaokai Zhang",
            "Li Lyna Zhang",
            "Ning Shang",
            "Fan Yang",
            "Dongyao Chen",
            "Mao Yang"
        ],
        "submitted": "2025-10-22 08:35:28",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "AgenticMath: Enhancing LLM Reasoning via Agentic-based Math Data Generation",
        "abstract": "The creation of high-quality datasets to improve Large Language Model (LLM)\nreasoning remains a significant challenge, as current methods often suffer from\ngenerating low-quality/incorrect answers and limited information richness from\navailable data sources. To address this, we propose AgenticMath, a novel\nagentic pipeline for generating high-quality mathematical question-answer pairs\nto enhance the supervised fine-tuning of LLMs. Our method operates through four\nstages: (1) Seed Question Filter that selects questions with high information\nrichness, complexity, and clarity; (2) an Agentic Question Rephrase step that\nemploys a multi-agent system to generate diverse, logically consistent\nparaphrases; (3) an Answer Augment step where rewrite answers using\nchain-of-thought reasoning to enhance numerical and logical correctness,\nwithout reliance on human-provided labels; and (4) a final Question and Answer\nEvaluation that retains only the most superior pairs. Extensive experiments\ndemonstrate that, fine-tuning 3B-8B parameter LLMs on AgenticMath generated\ndatasets (comprising only 30-60K math samples) achieves competitive or superior\nperformance on diverse in domain and out-of-domain mathematical reasoning\nbenchmarks compared to baselines trained on much more data (e.g., 400K or 2.3M\nsamples). Our work demonstrates that targeted, high-quality data generation is\na more efficient path to improving mathematical reasoning in LLMs than\nlarge-scale, low-quality alternatives.",
        "url": "http://arxiv.org/abs/2510.19361v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19361v1",
        "arxiv_id": "2510.19361v1",
        "authors": [
            "Xianyang Liu",
            "Yilin Liu",
            "Shuai Wang",
            "Hao Cheng",
            "Andrew Estornell",
            "Yuzhi Zhao",
            "Jiaheng Wei"
        ],
        "submitted": "2025-10-22 08:34:13",
        "source": "arxiv",
        "comment": "Work in progress"
    },
    {
        "title": "M3-SLU: Evaluating Speaker-Attributed Reasoning in Multimodal Large Language Models",
        "abstract": "We present M3-SLU, a new multimodal large language model (MLLM) benchmark for\nevaluating multi-speaker, multi-turn spoken language understanding. While\nrecent models show strong performance in speech and text comprehension, they\nstill struggle with speaker-attributed reasoning, the ability to understand who\nsaid what and when in natural conversations. M3-SLU is built from four open\ncorpora (CHiME-6, MELD, MultiDialog, and AMI) and comprises over 12,000\nvalidated instances with paired audio, transcripts, and metadata. It includes\ntwo tasks: (1) Speaker-Attributed Question Answering and (2) Speaker\nAttribution via Utterance Matching. We provide baseline results for both\ncascaded pipelines and end-to-end MLLMs, evaluated using an LLM-as-Judge and\naccuracy metrics. Results show that while models can capture what was said,\nthey often fail to identify who said it, revealing a key gap in speaker-aware\ndialogue understanding. M3-SLU offers as a challenging benchmark to advance\nresearch in speaker-aware multimodal understanding.",
        "url": "http://arxiv.org/abs/2510.19358v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19358v1",
        "arxiv_id": "2510.19358v1",
        "authors": [
            "Yejin Kwon",
            "Taewoo Kang",
            "Hyunsoo Yoon",
            "Changouk Kim"
        ],
        "submitted": "2025-10-22 08:28:43",
        "source": "arxiv",
        "comment": "Submitted to LREC 2026. 11 pages, 5 figures"
    },
    {
        "title": "Modeling Turn-Taking with Semantically Informed Gestures",
        "abstract": "In conversation, humans use multimodal cues, such as speech, gestures, and\ngaze, to manage turn-taking. While linguistic and acoustic features are\ninformative, gestures provide complementary cues for modeling these\ntransitions. To study this, we introduce DnD Gesture++, an extension of the\nmulti-party DnD Gesture corpus enriched with 2,663 semantic gesture annotations\nspanning iconic, metaphoric, deictic, and discourse types. Using this dataset,\nwe model turn-taking prediction through a Mixture-of-Experts framework\nintegrating text, audio, and gestures. Experiments show that incorporating\nsemantically guided gestures yields consistent performance gains over\nbaselines, demonstrating their complementary role in multimodal turn-taking.",
        "url": "http://arxiv.org/abs/2510.19350v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19350v1",
        "arxiv_id": "2510.19350v1",
        "authors": [
            "Varsha Suresh",
            "M. Hamza Mughal",
            "Christian Theobalt",
            "Vera Demberg"
        ],
        "submitted": "2025-10-22 08:17:54",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Local Obfuscation by GLINER for Impartial Context Aware Lineage: Development and evaluation of PII Removal system",
        "abstract": "Removing Personally Identifiable Information (PII) from clinical notes in\nElectronic Health Records (EHRs) is essential for research and AI development.\nWhile Large Language Models (LLMs) are powerful, their high computational costs\nand the data privacy risks of API-based services limit their use, especially in\nlow-resource settings. To address this, we developed LOGICAL (Local Obfuscation\nby GLINER for Impartial Context-Aware Lineage), an efficient, locally\ndeployable PII removal system built on a fine-tuned Generalist and Lightweight\nNamed Entity Recognition (GLiNER) model. We used 1515 clinical documents from a\npsychiatric hospital's EHR system. We defined nine PII categories for removal.\nA modern-gliner-bi-large-v1.0 model was fine-tuned on 2849 text instances and\nevaluated on a test set of 376 instances using character-level precision,\nrecall, and F1-score. We compared its performance against Microsoft Azure NER,\nMicrosoft Presidio, and zero-shot prompting with Gemini-Pro-2.5 and\nLlama-3.3-70B-Instruct. The fine-tuned GLiNER model achieved superior\nperformance, with an overall micro-average F1-score of 0.980, significantly\noutperforming Gemini-Pro-2.5 (F1-score: 0.845). LOGICAL correctly sanitised 95%\nof documents completely, compared to 64% for the next-best solution. The model\noperated efficiently on a standard laptop without a dedicated GPU. However, a\n2% entity-level false negative rate underscores the need for human-in-the-loop\nvalidation across all tested systems. Fine-tuned, specialised transformer\nmodels like GLiNER offer an accurate, computationally efficient, and secure\nsolution for PII removal from clinical notes. This \"sanitisation at the source\"\napproach is a practical alternative to resource-intensive LLMs, enabling the\ncreation of de-identified datasets for research and AI development while\npreserving data privacy, particularly in resource-constrained environments.",
        "url": "http://arxiv.org/abs/2510.19346v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19346v1",
        "arxiv_id": "2510.19346v1",
        "authors": [
            "Prakrithi Shivaprakash",
            "Lekhansh Shukla",
            "Animesh Mukherjee",
            "Prabhat Chand",
            "Pratima Murthy"
        ],
        "submitted": "2025-10-22 08:12:07",
        "source": "arxiv",
        "comment": "30 pages, 15 main text and 15 supplementary material"
    },
    {
        "title": "CoRECT: A Framework for Evaluating Embedding Compression Techniques at Scale",
        "abstract": "Dense retrieval systems have proven to be effective across various\nbenchmarks, but require substantial memory to store large search indices.\nRecent advances in embedding compression show that index sizes can be greatly\nreduced with minimal loss in ranking quality. However, existing studies often\noverlook the role of corpus complexity -- a critical factor, as recent work\nshows that both corpus size and document length strongly affect dense retrieval\nperformance. In this paper, we introduce CoRECT (Controlled Retrieval\nEvaluation of Compression Techniques), a framework for large-scale evaluation\nof embedding compression methods, supported by a newly curated dataset\ncollection. To demonstrate its utility, we benchmark eight representative types\nof compression methods. Notably, we show that non-learned compression achieves\nsubstantial index size reduction, even on up to 100M passages, with\nstatistically insignificant performance loss. However, selecting the optimal\ncompression method remains challenging, as performance varies across models.\nSuch variability highlights the necessity of CoRECT to enable consistent\ncomparison and informed selection of compression methods. All code, data, and\nresults are available on GitHub and HuggingFace.",
        "url": "http://arxiv.org/abs/2510.19340v2",
        "pdf_url": "http://arxiv.org/pdf/2510.19340v2",
        "arxiv_id": "2510.19340v2",
        "authors": [
            "L. Caspari",
            "M. Dinzinger",
            "K. Ghosh Dastidar",
            "C. Fellicious",
            "J. Mitrović",
            "M. Granitzer"
        ],
        "submitted": "2025-10-22 08:03:31",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Every Attention Matters: An Efficient Hybrid Architecture for Long-Context Reasoning",
        "abstract": "In this technical report, we present the Ring-linear model series,\nspecifically including Ring-mini-linear-2.0 and Ring-flash-linear-2.0.\nRing-mini-linear-2.0 comprises 16B parameters and 957M activations, while\nRing-flash-linear-2.0 contains 104B parameters and 6.1B activations. Both\nmodels adopt a hybrid architecture that effectively integrates linear attention\nand softmax attention, significantly reducing I/O and computational overhead in\nlong-context inference scenarios. Compared to a 32 billion parameter dense\nmodel, this series reduces inference cost to 1/10, and compared to the original\nRing series, the cost is also reduced by over 50%. Furthermore, through\nsystematic exploration of the ratio between different attention mechanisms in\nthe hybrid architecture, we have identified the currently optimal model\nstructure. Additionally, by leveraging our self-developed high-performance FP8\noperator library-linghe, overall training efficiency has been improved by 50%.\nBenefiting from the high alignment between the training and inference engine\noperators, the models can undergo long-term, stable, and highly efficient\noptimization during the reinforcement learning phase, consistently maintaining\nSOTA performance across multiple challenging complex reasoning benchmarks.",
        "url": "http://arxiv.org/abs/2510.19338v2",
        "pdf_url": "http://arxiv.org/pdf/2510.19338v2",
        "arxiv_id": "2510.19338v2",
        "authors": [
            "Ling Team",
            "Bin Han",
            "Caizhi Tang",
            "Chen Liang",
            "Donghao Zhang",
            "Fan Yuan",
            "Feng Zhu",
            "Jie Gao",
            "Jingyu Hu",
            "Longfei Li",
            "Meng Li",
            "Mingyang Zhang",
            "Peijie Jiang",
            "Peng Jiao",
            "Qian Zhao",
            "Qingyuan Yang",
            "Wenbo Shen",
            "Xinxing Yang",
            "Yalin Zhang",
            "Yankun Ren",
            "Yao Zhao",
            "Yibo Cao",
            "Yixuan Sun",
            "Yue Zhang",
            "Yuchen Fang",
            "Zibin Lin",
            "Zixuan Cheng",
            "Jun Zhou"
        ],
        "submitted": "2025-10-22 07:59:38",
        "source": "arxiv",
        "comment": "20 pages, 13 figures"
    },
    {
        "title": "Metadata Extraction Leveraging Large Language Models",
        "abstract": "The advent of Large Language Models has revolutionized tasks across domains,\nincluding the automation of legal document analysis, a critical component of\nmodern contract management systems. This paper presents a comprehensive\nimplementation of LLM-enhanced metadata extraction for contract review,\nfocusing on the automatic detection and annotation of salient legal clauses.\nLeveraging both the publicly available Contract Understanding Atticus Dataset\n(CUAD) and proprietary contract datasets, our work demonstrates the integration\nof advanced LLM methodologies with practical applications. We identify three\npivotal elements for optimizing metadata extraction: robust text conversion,\nstrategic chunk selection, and advanced LLM-specific techniques, including\nChain of Thought (CoT) prompting and structured tool calling. The results from\nour experiments highlight the substantial improvements in clause identification\naccuracy and efficiency. Our approach shows promise in reducing the time and\ncost associated with contract review while maintaining high accuracy in legal\nclause identification. The results suggest that carefully optimized LLM systems\ncould serve as valuable tools for legal professionals, potentially increasing\naccess to efficient contract review services for organizations of all sizes.",
        "url": "http://arxiv.org/abs/2510.19334v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19334v1",
        "arxiv_id": "2510.19334v1",
        "authors": [
            "Cuize Han",
            "Sesh Jalagam"
        ],
        "submitted": "2025-10-22 07:56:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Algorithmic Fairness in NLP: Persona-Infused LLMs for Human-Centric Hate Speech Detection",
        "abstract": "In this paper, we investigate how personalising Large Language Models\n(Persona-LLMs) with annotator personas affects their sensitivity to hate\nspeech, particularly regarding biases linked to shared or differing identities\nbetween annotators and targets. To this end, we employ Google's Gemini and\nOpenAI's GPT-4.1-mini models and two persona-prompting methods: shallow persona\nprompting and a deeply contextualised persona development based on\nRetrieval-Augmented Generation (RAG) to incorporate richer persona profiles. We\nanalyse the impact of using in-group and out-group annotator personas on the\nmodels' detection performance and fairness across diverse social groups. This\nwork bridges psychological insights on group identity with advanced NLP\ntechniques, demonstrating that incorporating socio-demographic attributes into\nLLMs can address bias in automated hate speech detection. Our results highlight\nboth the potential and limitations of persona-based approaches in reducing\nbias, offering valuable insights for developing more equitable hate speech\ndetection systems.",
        "url": "http://arxiv.org/abs/2510.19331v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19331v1",
        "arxiv_id": "2510.19331v1",
        "authors": [
            "Ewelina Gajewska",
            "Arda Derbent",
            "Jaroslaw A Chudziak",
            "Katarzyna Budzynska"
        ],
        "submitted": "2025-10-22 07:48:57",
        "source": "arxiv",
        "comment": "This paper has been accepted for the upcoming 59th Hawaii\n  International Conference on System Sciences (HICSS-59), 2026, Hawaii, USA.\n  The final published version will appear in the official conference\n  proceedings"
    },
    {
        "title": "Slot Filling as a Reasoning Task for SpeechLLMs",
        "abstract": "We propose integration of reasoning into speech large language models\n(speechLLMs) for the end-to-end slot-filling task. Inspired by the recent\ndevelopment of reasoning LLMs, we use a chain-of-thought framework to decompose\nthe slot-filling task into multiple reasoning steps, create a reasoning dataset\nand apply the supervised fine-tuning strategy to a speechLLM. We distinguish\nbetween regular and reasoning speechLLMs and experiment with different types\nand sizes of LLMs as their text foundation models. We demonstrate performance\nimprovements by introducing reasoning (intermediate) steps. However, we show\nthat a reasoning textual LLM developed mainly for math, logic and coding\ndomains might be inferior as a foundation model for a reasoning speechLLM. We\nfurther show that hybrid speechLLMs, built on a hybrid text foundation LLM and\nfine-tuned to preserve both direct and reasoning modes of operation, have\nbetter performance than those fine-tuned employing only one mode of operation.",
        "url": "http://arxiv.org/abs/2510.19326v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19326v1",
        "arxiv_id": "2510.19326v1",
        "authors": [
            "Kadri Hacioglu",
            "Manjunath K E",
            "Andreas Stolcke"
        ],
        "submitted": "2025-10-22 07:39:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Balancing Rewards in Text Summarization: Multi-Objective Reinforcement Learning via HyperVolume Optimization",
        "abstract": "Text summarization is a crucial task that requires the simultaneous\noptimization of multiple objectives, including consistency, coherence,\nrelevance, and fluency, which presents considerable challenges. Although large\nlanguage models (LLMs) have demonstrated remarkable performance, enhanced by\nreinforcement learning (RL), few studies have focused on optimizing the\nmulti-objective problem of summarization through RL based on LLMs. In this\npaper, we introduce hypervolume optimization (HVO), a novel optimization\nstrategy that dynamically adjusts the scores between groups during the reward\nprocess in RL by using the hypervolume method. This method guides the model's\noptimization to progressively approximate the pareto front, thereby generating\nbalanced summaries across multiple objectives. Experimental results on several\nrepresentative summarization datasets demonstrate that our method outperforms\ngroup relative policy optimization (GRPO) in overall scores and shows more\nbalanced performance across different dimensions. Moreover, a 7B foundation\nmodel enhanced by HVO performs comparably to GPT-4 in the summarization task,\nwhile maintaining a shorter generation length. Our code is publicly available\nat https://github.com/ai4business-LiAuto/HVO.git",
        "url": "http://arxiv.org/abs/2510.19325v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19325v1",
        "arxiv_id": "2510.19325v1",
        "authors": [
            "Junjie Song",
            "Yiwen Liu",
            "Dapeng Li",
            "Yin Sun",
            "Shukun Fu",
            "Siqi Chen",
            "Yuji Cao"
        ],
        "submitted": "2025-10-22 07:39:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "HAD: HAllucination Detection Language Models Based on a Comprehensive Hallucination Taxonomy",
        "abstract": "The increasing reliance on natural language generation (NLG) models,\nparticularly large language models, has raised concerns about the reliability\nand accuracy of their outputs. A key challenge is hallucination, where models\nproduce plausible but incorrect information. As a result, hallucination\ndetection has become a critical task. In this work, we introduce a\ncomprehensive hallucination taxonomy with 11 categories across various NLG\ntasks and propose the HAllucination Detection (HAD) models\nhttps://github.com/pku0xff/HAD, which integrate hallucination detection,\nspan-level identification, and correction into a single inference process.\nTrained on an elaborate synthetic dataset of about 90K samples, our HAD models\nare versatile and can be applied to various NLG tasks. We also carefully\nannotate a test set for hallucination detection, called HADTest, which contains\n2,248 samples. Evaluations on in-domain and out-of-domain test sets show that\nour HAD models generally outperform the existing baselines, achieving\nstate-of-the-art results on HaluEval, FactCHD, and FaithBench, confirming their\nrobustness and versatility.",
        "url": "http://arxiv.org/abs/2510.19318v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19318v1",
        "arxiv_id": "2510.19318v1",
        "authors": [
            "Fan Xu",
            "Xinyu Hu",
            "Zhenghan Yu",
            "Li Lin",
            "Xu Zhang",
            "Yang Zhang",
            "Wei Zhou",
            "Jinjie Gu",
            "Xiaojun Wan"
        ],
        "submitted": "2025-10-22 07:28:37",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "KORE: Enhancing Knowledge Injection for Large Multimodal Models via Knowledge-Oriented Augmentations and Constraints",
        "abstract": "Large Multimodal Models encode extensive factual knowledge in their\npre-trained weights. However, its knowledge remains static and limited, unable\nto keep pace with real-world developments, which hinders continuous knowledge\nacquisition. Effective knowledge injection thus becomes critical, involving two\ngoals: knowledge adaptation (injecting new knowledge) and knowledge retention\n(preserving old knowledge). Existing methods often struggle to learn new\nknowledge and suffer from catastrophic forgetting. To address this, we propose\nKORE, a synergistic method of KnOwledge-oRientEd augmentations and constraints\nfor injecting new knowledge into large multimodal models while preserving old\nknowledge. Unlike general text or image data augmentation, KORE automatically\nconverts individual knowledge items into structured and comprehensive knowledge\nto ensure that the model accurately learns new knowledge, enabling accurate\nadaptation. Meanwhile, KORE stores previous knowledge in the covariance matrix\nof LMM's linear layer activations and initializes the adapter by projecting the\noriginal weights into the matrix's null space, defining a fine-tuning direction\nthat minimizes interference with previous knowledge, enabling powerful\nretention. Extensive experiments on various LMMs, including LLaVA-v1.5-7B,\nLLaVA-v1.5-13B, and Qwen2.5-VL-7B, show that KORE achieves superior new\nknowledge injection performance and effectively mitigates catastrophic\nforgetting.",
        "url": "http://arxiv.org/abs/2510.19316v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19316v1",
        "arxiv_id": "2510.19316v1",
        "authors": [
            "Kailin Jiang",
            "Hongbo Jiang",
            "Ning Jiang",
            "Zhi Gao",
            "Jinhe Bi",
            "Yuchen Ren",
            "Bin Li",
            "Yuntao Du",
            "Lei Liu",
            "Qing Li"
        ],
        "submitted": "2025-10-22 07:26:55",
        "source": "arxiv",
        "comment": "project page: https://kore-lmm.github.io/"
    },
    {
        "title": "JointCQ: Improving Factual Hallucination Detection with Joint Claim and Query Generation",
        "abstract": "Current large language models (LLMs) often suffer from hallucination issues,\ni,e, generating content that appears factual but is actually unreliable. A\ntypical hallucination detection pipeline involves response decomposition (i.e.,\nclaim extraction), query generation, evidence collection (i.e., search or\nretrieval), and claim verification. However, existing methods exhibit\nlimitations in the first two stages, such as context loss during claim\nextraction and low specificity in query generation, resulting in degraded\nperformance across the hallucination detection pipeline. In this work, we\nintroduce JointCQ https://github.com/pku0xff/JointCQ, a joint claim-and-query\ngeneration framework designed to construct an effective and efficient\nclaim-query generator. Our framework leverages elaborately designed evaluation\ncriteria to filter synthesized training data, and finetunes a language model\nfor joint claim extraction and query generation, providing reliable and\ninformative inputs for downstream search and verification. Experimental results\ndemonstrate that our method outperforms previous methods on multiple\nopen-domain QA hallucination detection benchmarks, advancing the goal of more\ntrustworthy and transparent language model systems.",
        "url": "http://arxiv.org/abs/2510.19310v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19310v1",
        "arxiv_id": "2510.19310v1",
        "authors": [
            "Fan Xu",
            "Huixuan Zhang",
            "Zhenliang Zhang",
            "Jiahao Wang",
            "Xiaojun Wan"
        ],
        "submitted": "2025-10-22 07:15:37",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "From Denoising to Refining: A Corrective Framework for Vision-Language Diffusion Model",
        "abstract": "Discrete diffusion models have emerged as a promising direction for\nvision-language tasks, offering bidirectional context modeling and theoretical\nparallelization. However, their practical application is severely hindered by a\ntrain-inference discrepancy, which leads to catastrophic error cascades:\ninitial token errors during parallel decoding pollute the generation context,\ntriggering a chain reaction of compounding errors and leading to syntactic\nerrors and semantic hallucinations. To address this fundamental challenge, we\nreframe the generation process from passive denoising to active refining. We\nintroduce ReDiff, a refining-enhanced diffusion framework that teaches the\nmodel to identify and correct its own errors. Our approach features a two-stage\ntraining process: first, we instill a foundational revision capability by\ntraining the model to revise synthetic errors; second, we implement a novel\nonline self-correction loop where the model is explicitly trained to revise its\nown flawed drafts by learning from an expert's corrections. This mistake-driven\nlearning endows the model with the crucial ability to revisit and refine its\nalready generated output, effectively breaking the error cascade. Extensive\nexperiments demonstrate that ReDiff significantly improves the coherence and\nfactual accuracy of generated content, enabling stable and efficient parallel\ngeneration far superior to traditional denoising methods. Our codes and models\nare available at https://rediff-hku.github.io/.",
        "url": "http://arxiv.org/abs/2510.19871v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19871v1",
        "arxiv_id": "2510.19871v1",
        "authors": [
            "Yatai Ji",
            "Teng Wang",
            "Yuying Ge",
            "Zhiheng Liu",
            "Sidi Yang",
            "Ying Shan",
            "Ping Luo"
        ],
        "submitted": "2025-10-22 06:58:55",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "TheMCPCompany: Creating General-purpose Agents with Task-specific Tools",
        "abstract": "Since the introduction of the Model Context Protocol (MCP), the number of\navailable tools for Large Language Models (LLMs) has increased significantly.\nThese task-specific tool sets offer an alternative to general-purpose tools\nsuch as web browsers, while being easier to develop and maintain than GUIs.\nHowever, current general-purpose agents predominantly rely on web browsers for\ninteracting with the environment. Here, we introduce TheMCPCompany, a benchmark\nfor evaluating tool-calling agents on tasks that involve interacting with\nvarious real-world services. We use the REST APIs of these services to create\nMCP servers, which include over 18,000 tools. We also provide manually\nannotated ground-truth tools for each task. In our experiments, we use the\nground truth tools to show the potential of tool-calling agents for both\nimproving performance and reducing costs assuming perfect tool retrieval. Next,\nwe explore agent performance using tool retrieval to study the real-world\npracticality of tool-based agents. While all models with tool retrieval perform\nsimilarly or better than browser-based agents, smaller models cannot take full\nadvantage of the available tools through retrieval. On the other hand, GPT-5's\nperformance with tool retrieval is very close to its performance with\nground-truth tools. Overall, our work shows that the most advanced reasoning\nmodels are effective at discovering tools in simpler environments, but\nseriously struggle with navigating complex enterprise environments.\nTheMCPCompany reveals that navigating tens of thousands of tools and combining\nthem in non-trivial ways to solve complex problems is still a challenging task\nfor current models and requires both better reasoning and better retrieval\nmodels.",
        "url": "http://arxiv.org/abs/2510.19286v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19286v1",
        "arxiv_id": "2510.19286v1",
        "authors": [
            "Reza Esfandiarpoor",
            "Vishwas Suryanarayanan",
            "Stephen H. Bach",
            "Vishal Chowdhary",
            "Anthony Aue"
        ],
        "submitted": "2025-10-22 06:42:01",
        "source": "arxiv",
        "comment": "Code: https://github.com/Reza-esfandiarpoor/the-mcp-company"
    },
    {
        "title": "Difficulty-Controllable Multiple-Choice Question Generation Using Large Language Models and Direct Preference Optimization",
        "abstract": "Difficulty-controllable question generation for reading comprehension has\ngained significant attention in the field of education as a fundamental tool\nfor adaptive learning support. Although several neural question generation\nmethods have recently succeeded in controlling difficulty, conventional\napproaches still face two major limitations. First, they cannot directly\ngenerate multiple-choice questions, which are the most widely used question\ntype in educational contexts. Second, they are not explicitly trained to\noptimize the accuracy of difficulty control, leaving room for further\nimprovement in difficulty controllability. To address these limitations, this\nstudy proposes a novel difficulty-controllable multiple-choice question\ngeneration method for reading comprehension which leverages a large language\nmodel trained using a direct preference optimization technique to improve the\naccuracy of difficulty control.",
        "url": "http://arxiv.org/abs/2510.19265v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19265v1",
        "arxiv_id": "2510.19265v1",
        "authors": [
            "Yuto Tomikawa",
            "Masaki Uto"
        ],
        "submitted": "2025-10-22 05:49:31",
        "source": "arxiv",
        "comment": "This work has been submitted to the IEEE for possible publication"
    },
    {
        "title": "SheetBrain: A Neuro-Symbolic Agent for Accurate Reasoning over Complex and Large Spreadsheets",
        "abstract": "Understanding and reasoning over complex spreadsheets remain fundamental\nchallenges for large language models (LLMs), which often struggle with\naccurately capturing the complex structure of tables and ensuring reasoning\ncorrectness. In this work, we propose SheetBrain, a neuro-symbolic dual\nworkflow agent framework designed for accurate reasoning over tabular data,\nsupporting both spreadsheet question answering and manipulation tasks.\nSheetBrain comprises three core modules: an understanding module, which\nproduces a comprehensive overview of the spreadsheet - including sheet summary\nand query-based problem insight to guide reasoning; an execution module, which\nintegrates a Python sandbox with preloaded table-processing libraries and an\nExcel helper toolkit for effective multi-turn reasoning; and a validation\nmodule, which verifies the correctness of reasoning and answers, triggering\nre-execution when necessary. We evaluate SheetBrain on multiple public tabular\nQA and manipulation benchmarks, and introduce SheetBench, a new benchmark\ntargeting large, multi-table, and structurally complex spreadsheets.\nExperimental results show that SheetBrain significantly improves accuracy on\nboth existing benchmarks and the more challenging scenarios presented in\nSheetBench. Our code is publicly available at\nhttps://github.com/microsoft/SheetBrain.",
        "url": "http://arxiv.org/abs/2510.19247v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19247v1",
        "arxiv_id": "2510.19247v1",
        "authors": [
            "Ziwei Wang",
            "Jiayuan Su",
            "Mengyu Zhou",
            "Huaxing Zeng",
            "Mengni Jia",
            "Xiao Lv",
            "Haoyu Dong",
            "Xiaojun Ma",
            "Shi Han",
            "Dongmei Zhang"
        ],
        "submitted": "2025-10-22 05:09:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "C2T-ID: Converting Semantic Codebooks to Textual Document Identifiers for Generative Search",
        "abstract": "Designing document identifiers (docids) that carry rich semantic information\nwhile maintaining tractable search spaces is a important challenge in\ngenerative retrieval (GR). Popular codebook methods address this by building a\nhierarchical semantic tree and constraining generation to its child nodes, yet\ntheir numeric identifiers cannot leverage the large language model's pretrained\nnatural language understanding. Conversely, using text as docid provides more\nsemantic expressivity but inflates the decoding space, making the system\nbrittle to early-step errors. To resolve this trade-off, we propose C2T-ID: (i)\nfirst construct semantic numerical docid via hierarchical clustering; (ii) then\nextract high-frequency metadata keywords and iteratively replace each numeric\nlabel with its cluster's top-K keywords; and (iii) an optional two-level\nsemantic smoothing step further enhances the fluency of C2T-ID. Experiments on\nNatural Questions and Taobao's product search demonstrate that C2T-ID\nsignificantly outperforms atomic, semantic codebook, and pure-text docid\nbaselines, demonstrating its effectiveness in balancing semantic expressiveness\nwith search space constraints.",
        "url": "http://arxiv.org/abs/2510.19221v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19221v1",
        "arxiv_id": "2510.19221v1",
        "authors": [
            "Yingchen Zhang",
            "Ruqing Zhang",
            "Jiafeng Guo",
            "Wenjun Peng",
            "Sen Li",
            "Fuyu Lv",
            "Xueqi Cheng"
        ],
        "submitted": "2025-10-22 04:05:38",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Modality Matching Matters: Calibrating Language Distances for Cross-Lingual Transfer in URIEL+",
        "abstract": "Existing linguistic knowledge bases such as URIEL+ provide valuable\ngeographic, genetic and typological distances for cross-lingual transfer but\nsuffer from two key limitations. One, their one-size-fits-all vector\nrepresentations are ill-suited to the diverse structures of linguistic data,\nand two, they lack a principled method for aggregating these signals into a\nsingle, comprehensive score. In this paper, we address these gaps by\nintroducing a framework for type-matched language distances. We propose novel,\nstructure-aware representations for each distance type: speaker-weighted\ndistributions for geography, hyperbolic embeddings for genealogy, and a latent\nvariables model for typology. We unify these signals into a robust,\ntask-agnostic composite distance. In selecting transfer languages, our\nrepresentations and composite distances consistently improve performance across\na wide range of NLP tasks, providing a more principled and effective toolkit\nfor multilingual research.",
        "url": "http://arxiv.org/abs/2510.19217v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19217v1",
        "arxiv_id": "2510.19217v1",
        "authors": [
            "York Hay Ng",
            "Aditya Khan",
            "Xiang Lu",
            "Matteo Salloum",
            "Michael Zhou",
            "Phuong H. Hoang",
            "A. Seza Doğruöz",
            "En-Shiun Annie Lee"
        ],
        "submitted": "2025-10-22 03:59:19",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DiSRouter: Distributed Self-Routing for LLM Selections",
        "abstract": "The proliferation of Large Language Models (LLMs) has created a diverse\necosystem of models with highly varying performance and costs, necessitating\neffective query routing to balance performance and expense. Current routing\nsystems often rely on a centralized external router trained on a fixed set of\nLLMs, making them inflexible and prone to poor performance since the small\nrouter can not fully understand the knowledge boundaries of different LLMs. We\nintroduce DiSRouter (Distributed Self-Router), a novel paradigm that shifts\nfrom centralized control to distributed routing. In DiSRouter, a query\ntraverses a network of LLM agents, each independently deciding whether to\nanswer or route to other agents based on its own self-awareness, its ability to\njudge its competence. This distributed design offers superior flexibility,\nscalability, and generalizability. To enable this, we propose a two-stage\nSelf-Awareness Training pipeline that enhances each LLM's self-awareness.\nExtensive experiments demonstrate that DiSRouter significantly outperforms\nexisting routing methods in utility across various scenarios, effectively\ndistinguishes between easy and hard queries, and shows strong generalization to\nout-of-domain tasks. Our work validates that leveraging an LLM's intrinsic\nself-awareness is more effective than external assessment, paving the way for\nmore modular and efficient multi-agent systems.",
        "url": "http://arxiv.org/abs/2510.19208v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19208v1",
        "arxiv_id": "2510.19208v1",
        "authors": [
            "Hang Zheng",
            "Hongshen Xu",
            "Yongkai Lin",
            "Shuai Fan",
            "Lu Chen",
            "Kai Yu"
        ],
        "submitted": "2025-10-22 03:36:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Aligning Multilingual News for Stock Return Prediction",
        "abstract": "News spreads rapidly across languages and regions, but translations may lose\nsubtle nuances. We propose a method to align sentences in multilingual news\narticles using optimal transport, identifying semantically similar content\nacross languages. We apply this method to align more than 140,000 pairs of\nBloomberg English and Japanese news articles covering around 3500 stocks in\nTokyo exchange over 2012-2024. Aligned sentences are sparser, more\ninterpretable, and exhibit higher semantic similarity. Return scores\nconstructed from aligned sentences show stronger correlations with realized\nstock returns, and long-short trading strategies based on these alignments\nachieve 10\\% higher Sharpe ratios than analyzing the full text sample.",
        "url": "http://arxiv.org/abs/2510.19203v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19203v1",
        "arxiv_id": "2510.19203v1",
        "authors": [
            "Yuntao Wu",
            "Lynn Tao",
            "Ing-Haw Cheng",
            "Charles Martineau",
            "Yoshio Nozawa",
            "John Hull",
            "Andreas Veneris"
        ],
        "submitted": "2025-10-22 03:23:24",
        "source": "arxiv",
        "comment": "6 pages, 4 tables, 2 figures, AI for Finance Symposium'25 Workshop at\n  ICAIF'25"
    },
    {
        "title": "An Evaluation of the Pedagogical Soundness and Usability of AI-Generated Lesson Plans Across Different Models and Prompt Frameworks in High-School Physics",
        "abstract": "This study evaluates the pedagogical soundness and usability of AI-generated\nlesson plans across five leading large language models: ChatGPT (GPT-5), Claude\nSonnet 4.5, Gemini 2.5 Flash, DeepSeek V3.2, and Grok 4. Beyond model choice,\nthree structured prompt frameworks were tested: TAG (Task, Audience, Goal),\nRACE (Role, Audience, Context, Execution), and COSTAR (Context, Objective,\nStyle, Tone, Audience, Response Format).\n  Fifteen lesson plans were generated for a single high-school physics topic,\nThe Electromagnetic Spectrum. The lesson plans were analyzed through four\nautomated computational metrics: (1) readability and linguistic complexity, (2)\nfactual accuracy and hallucination detection, (3) standards and curriculum\nalignment, and (4) cognitive demand of learning objectives.\n  Results indicate that model selection exerted the strongest influence on\nlinguistic accessibility, with DeepSeek producing the most readable teaching\nplan (FKGL = 8.64) and Claude generating the densest language (FKGL = 19.89).\n  The prompt framework structure most strongly affected the factual accuracy\nand pedagogical completeness, with the RACE framework yielding the lowest\nhallucination index and the highest incidental alignment with NGSS curriculum\nstandards. Across all models, the learning objectives in the fifteen lesson\nplans clustered at the Remember and Understand tiers of Bloom's taxonomy. There\nwere limited higher-order verbs in the learning objectives extracted.\n  Overall, the findings suggest that readability is significantly governed by\nmodel design, while instructional reliability and curricular alignment depend\nmore on the prompt framework. The most effective configuration for lesson plans\nidentified in the results was to combine a readability-optimized model with the\nRACE framework and an explicit checklist of physics concepts, curriculum\nstandards, and higher-order objectives.",
        "url": "http://arxiv.org/abs/2510.19866v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19866v1",
        "arxiv_id": "2510.19866v1",
        "authors": [
            "Xincheng Liu"
        ],
        "submitted": "2025-10-22 02:53:06",
        "source": "arxiv",
        "comment": "20 pages, 6 tables"
    },
    {
        "title": "Multi-Faceted Evaluation of Tool-Augmented Dialogue Systems",
        "abstract": "Evaluating conversational AI systems that use external tools is challenging,\nas errors can arise from complex interactions among user, agent, and tools.\nWhile existing evaluation methods assess either user satisfaction or agents'\ntool-calling capabilities, they fail to capture critical errors in multi-turn\ntool-augmented dialogues-such as when agents misinterpret tool results yet\nappear satisfactory to users. We introduce TRACE, a benchmark of systematically\nsynthesized tool-augmented conversations covering diverse error cases, and\nSCOPE, an evaluation framework that automatically discovers diverse error\npatterns and evaluation rubrics in tool-augmented dialogues. Experiments show\nSCOPE significantly outperforms the baseline, particularly on challenging cases\nwhere user satisfaction signals are misleading.",
        "url": "http://arxiv.org/abs/2510.19186v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19186v1",
        "arxiv_id": "2510.19186v1",
        "authors": [
            "Zhaoyi Joey Hou",
            "Tanya Shourya",
            "Yingfan Wang",
            "Shamik Roy",
            "Vinayshekhar Bannihatti Kumar",
            "Rashmi Gangadharaiah"
        ],
        "submitted": "2025-10-22 02:44:11",
        "source": "arxiv",
        "comment": "The first two authors contributed equally. Manuscript under\n  submission"
    },
    {
        "title": "Interpretable Question Answering with Knowledge Graphs",
        "abstract": "This paper presents a question answering system that operates exclusively on\na knowledge graph retrieval without relying on retrieval augmented generation\n(RAG) with large language models (LLMs). Instead, a small paraphraser model is\nused to paraphrase the entity relationship edges retrieved from querying the\nknowledge graph. The proposed pipeline is divided into two main stages. The\nfirst stage involves pre-processing a document to generate sets of\nquestion-answer (QA) pairs. The second stage converts these QAs into a\nknowledge graph from which graph-based retrieval is performed using embeddings\nand fuzzy techniques. The graph is queried, re-ranked, and paraphrased to\ngenerate a final answer. This work includes an evaluation using LLM-as-a-judge\non the CRAG benchmark, which resulted in accuracies of 71.9% and 54.4% using\nLLAMA-3.2 and GPT-3.5-Turbo, respectively.",
        "url": "http://arxiv.org/abs/2510.19181v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19181v1",
        "arxiv_id": "2510.19181v1",
        "authors": [
            "Kartikeya Aneja",
            "Manasvi Srivastava",
            "Subhayan Das",
            "Nagender Aneja"
        ],
        "submitted": "2025-10-22 02:36:35",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The Zero-Step Thinking: An Empirical Study of Mode Selection as Harder Early Exit in Reasoning Models",
        "abstract": "Reasoning models have demonstrated exceptional performance in tasks such as\nmathematics and logical reasoning, primarily due to their ability to engage in\nstep-by-step thinking during the reasoning process. However, this often leads\nto overthinking, resulting in unnecessary computational overhead. To address\nthis issue, Mode Selection aims to automatically decide between Long-CoT\n(Chain-of-Thought) or Short-CoT by utilizing either a Thinking or NoThinking\nmode. Simultaneously, Early Exit determines the optimal stopping point during\nthe iterative reasoning process. Both methods seek to reduce the computational\nburden. In this paper, we first identify Mode Selection as a more challenging\nvariant of the Early Exit problem, as they share similar objectives but differ\nin decision timing. While Early Exit focuses on determining the best stopping\npoint for concise reasoning at inference time, Mode Selection must make this\ndecision at the beginning of the reasoning process, relying on pre-defined fake\nthoughts without engaging in an explicit reasoning process, referred to as\nzero-step thinking. Through empirical studies on nine baselines, we observe\nthat prompt-based approaches often fail due to their limited classification\ncapabilities when provided with minimal hand-crafted information. In contrast,\napproaches that leverage internal information generally perform better across\nmost scenarios but still exhibit issues with stability. Our findings indicate\nthat existing methods relying solely on the information provided by models are\ninsufficient for effectively addressing Mode Selection in scenarios with\nlimited information, highlighting the ongoing challenges of this task. Our code\nis available at https://github.com/Trae1ounG/Zero_Step_Thinking.",
        "url": "http://arxiv.org/abs/2510.19176v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19176v1",
        "arxiv_id": "2510.19176v1",
        "authors": [
            "Yuqiao Tan",
            "Shizhu He",
            "Kang Liu",
            "Jun Zhao"
        ],
        "submitted": "2025-10-22 02:28:10",
        "source": "arxiv",
        "comment": "Accepted by NeurIPS'25 Efficient Reasoning Workshop"
    },
    {
        "title": "When Facts Change: Probing LLMs on Evolving Knowledge with evolveQA",
        "abstract": "LLMs often fail to handle temporal knowledge conflicts--contradictions\narising when facts evolve over time within their training data. Existing\nstudies evaluate this phenomenon through benchmarks built on structured\nknowledge bases like Wikidata, but they focus on widely-covered,\neasily-memorized popular entities and lack the dynamic structure needed to\nfairly evaluate LLMs with different knowledge cut-off dates. We introduce\nevolveQA, a benchmark specifically designed to evaluate LLMs on temporally\nevolving knowledge, constructed from 3 real-world, time-stamped corpora: AWS\nupdates, Azure changes, and WHO disease outbreak reports. Our framework\nidentifies naturally occurring knowledge evolution and generates questions with\ngold answers tailored to different LLM knowledge cut-off dates. Through\nextensive evaluation of 12 open and closed-source LLMs across 3 knowledge\nprobing formats, we demonstrate significant performance drops of up to 31% on\nevolveQA compared to static knowledge questions.",
        "url": "http://arxiv.org/abs/2510.19172v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19172v1",
        "arxiv_id": "2510.19172v1",
        "authors": [
            "Nishanth Sridhar Nakshatri",
            "Shamik Roy",
            "Manoj Ghuhan Arivazhagan",
            "Hanhan Zhou",
            "Vinayshekhar Bannihatti Kumar",
            "Rashmi Gangadharaiah"
        ],
        "submitted": "2025-10-22 02:12:32",
        "source": "arxiv",
        "comment": "Under submission"
    },
    {
        "title": "Think Straight, Stop Smart: Structured Reasoning for Efficient Multi-Hop RAG",
        "abstract": "Multi-hop retrieval-augmented generation (RAG) is a promising strategy for\ncomplex reasoning, yet existing iterative prompting approaches remain\ninefficient. They often regenerate predictable token sequences at every step\nand rely on stochastic stopping, leading to excessive token usage and unstable\ntermination. We propose TSSS (Think Straight, Stop Smart), a structured\nmulti-hop RAG framework designed for efficiency. TSSS introduces (i) a\ntemplate-based reasoning that caches recurring prefixes and anchors sub-queries\nto the main question, reducing token generation cost while promoting stable\nreasoning, and (ii) a retriever-based terminator, which deterministically halts\nreasoning once additional sub-queries collapse into repetition. This separation\nof structured reasoning and termination control enables both faster inference\nand more reliable answers. On HotpotQA, 2WikiMultiHop, and MuSiQue, TSSS\nachieves state-of-the-art accuracy and competitive efficiency among RAG-CoT\napproaches, highlighting its effectiveness in efficiency-constrained scenarios\nsuch as on-device inference.",
        "url": "http://arxiv.org/abs/2510.19171v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19171v1",
        "arxiv_id": "2510.19171v1",
        "authors": [
            "Jihwan Bang",
            "Juntae Lee",
            "Seunghan Yang",
            "Sungha Choi"
        ],
        "submitted": "2025-10-22 02:09:23",
        "source": "arxiv",
        "comment": "Accepted at NeurIPS 2025 Workshop"
    },
    {
        "title": "OpenGuardrails: An Open-Source Context-Aware AI Guardrails Platform",
        "abstract": "As large language models (LLMs) become increasingly integrated into\nreal-world applications, safeguarding them against unsafe, malicious, or\nprivacy-violating content is critically important. We present OpenGuardrails,\nthe first open-source project to provide both a context-aware safety and\nmanipulation detection model and a deployable platform for comprehensive AI\nguardrails. OpenGuardrails protects against content-safety risks,\nmodel-manipulation attacks (e.g., prompt injection, jailbreaking,\ncode-interpreter abuse, and the generation/execution of malicious code), and\ndata leakage. Content-safety and model-manipulation detection are implemented\nby a unified large model, while data-leakage identification and redaction are\nperformed by a separate lightweight NER pipeline (e.g., Presidio-style models\nor regex-based detectors). The system can be deployed as a security gateway or\nan API-based service, with enterprise-grade, fully private deployment options.\nOpenGuardrails achieves state-of-the-art (SOTA) performance on safety\nbenchmarks, excelling in both prompt and response classification across\nEnglish, Chinese, and multilingual tasks. All models are released under the\nApache 2.0 license for public use.",
        "url": "http://arxiv.org/abs/2510.19169v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19169v1",
        "arxiv_id": "2510.19169v1",
        "authors": [
            "Thomas Wang",
            "Haowen Li"
        ],
        "submitted": "2025-10-22 02:02:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "\"You Are Rejected!\": An Empirical Study of Large Language Models Taking Hiring Evaluations",
        "abstract": "With the proliferation of the internet and the rapid advancement of\nArtificial Intelligence, leading technology companies face an urgent annual\ndemand for a considerable number of software and algorithm engineers. To\nefficiently and effectively identify high-potential candidates from thousands\nof applicants, these firms have established a multi-stage selection process,\nwhich crucially includes a standardized hiring evaluation designed to assess\njob-specific competencies. Motivated by the demonstrated prowess of Large\nLanguage Models (LLMs) in coding and reasoning tasks, this paper investigates a\ncritical question: Can LLMs successfully pass these hiring evaluations? To this\nend, we conduct a comprehensive examination of a widely used professional\nassessment questionnaire. We employ state-of-the-art LLMs to generate responses\nand subsequently evaluate their performance. Contrary to any prior expectation\nof LLMs being ideal engineers, our analysis reveals a significant inconsistency\nbetween the model-generated answers and the company-referenced solutions. Our\nempirical findings lead to a striking conclusion: All evaluated LLMs fails to\npass the hiring evaluation.",
        "url": "http://arxiv.org/abs/2510.19167v2",
        "pdf_url": "http://arxiv.org/pdf/2510.19167v2",
        "arxiv_id": "2510.19167v2",
        "authors": [
            "Dingjie Fu",
            "Dianxing Shi"
        ],
        "submitted": "2025-10-22 01:59:30",
        "source": "arxiv",
        "comment": "Technical Report, 14 pages, 8 figures"
    },
    {
        "title": "SODBench: A Large Language Model Approach to Documenting Spreadsheet Operations",
        "abstract": "Numerous knowledge workers utilize spreadsheets in business, accounting, and\nfinance. However, a lack of systematic documentation methods for spreadsheets\nhinders automation, collaboration, and knowledge transfer, which risks the loss\nof crucial institutional knowledge. This paper introduces Spreadsheet\nOperations Documentation (SOD), an AI task that involves generating\nhuman-readable explanations from spreadsheet operations. Many previous studies\nhave utilized Large Language Models (LLMs) for generating spreadsheet\nmanipulation code; however, translating that code into natural language for SOD\nis a less-explored area. To address this, we present a benchmark of 111\nspreadsheet manipulation code snippets, each paired with a corresponding\nnatural language summary. We evaluate five LLMs, GPT-4o, GPT-4o-mini,\nLLaMA-3.3-70B, Mixtral-8x7B, and Gemma2-9B, using BLEU, GLEU, ROUGE-L, and\nMETEOR metrics. Our findings suggest that LLMs can generate accurate\nspreadsheet documentation, making SOD a feasible prerequisite step toward\nenhancing reproducibility, maintainability, and collaborative workflows in\nspreadsheets, although there are challenges that need to be addressed.",
        "url": "http://arxiv.org/abs/2510.19864v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19864v1",
        "arxiv_id": "2510.19864v1",
        "authors": [
            "Amila Indika",
            "Igor Molybog"
        ],
        "submitted": "2025-10-22 01:36:13",
        "source": "arxiv",
        "comment": "14 pages, 5 figures, 4 tables"
    },
    {
        "title": "Tibetan Language and AI: A Comprehensive Survey of Resources, Methods and Challenges",
        "abstract": "Tibetan, one of the major low-resource languages in Asia, presents unique\nlinguistic and sociocultural characteristics that pose both challenges and\nopportunities for AI research. Despite increasing interest in developing AI\nsystems for underrepresented languages, Tibetan has received limited attention\ndue to a lack of accessible data resources, standardized benchmarks, and\ndedicated tools. This paper provides a comprehensive survey of the current\nstate of Tibetan AI in the AI domain, covering textual and speech data\nresources, NLP tasks, machine translation, speech recognition, and recent\ndevelopments in LLMs. We systematically categorize existing datasets and tools,\nevaluate methods used across different tasks, and compare performance where\npossible. We also identify persistent bottlenecks such as data sparsity,\northographic variation, and the lack of unified evaluation metrics.\nAdditionally, we discuss the potential of cross-lingual transfer, multi-modal\nlearning, and community-driven resource creation. This survey aims to serve as\na foundational reference for future work on Tibetan AI research and encourages\ncollaborative efforts to build an inclusive and sustainable AI ecosystem for\nlow-resource languages.",
        "url": "http://arxiv.org/abs/2510.19144v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19144v1",
        "arxiv_id": "2510.19144v1",
        "authors": [
            "Cheng Huang",
            "Nyima Tashi",
            "Fan Gao",
            "Yutong Liu",
            "Jiahao Li",
            "Hao Tian",
            "Siyang Jiang",
            "Thupten Tsering",
            "Ban Ma-bao",
            "Renzeg Duojie",
            "Gadeng Luosang",
            "Rinchen Dongrub",
            "Dorje Tashi",
            "Jin Zhang",
            "Xiao Feng",
            "Hao Wang",
            "Jie Tang",
            "Guojie Tang",
            "Xiangxiang Wang",
            "Jia Zhang",
            "Tsengdar Lee",
            "Yongbin Yu"
        ],
        "submitted": "2025-10-22 00:29:35",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "A Multi-faceted Analysis of Cognitive Abilities: Evaluating Prompt Methods with Large Language Models on the CONSORT Checklist",
        "abstract": "Despite the rapid expansion of Large Language Models (LLMs) in healthcare,\nthe ability of these systems to assess clinical trial reporting according to\nCONSORT standards remains unclear, particularly with respect to their cognitive\nand reasoning strategies. This study applies a behavioral and metacognitive\nanalytic approach with expert-validated data, systematically comparing two\nrepresentative LLMs under three prompt conditions. Clear differences emerged in\nhow the models approached various CONSORT items, and prompt types, including\nshifts in reasoning style, explicit uncertainty, and alternative\ninterpretations shaped response patterns. Our results highlight the current\nlimitations of these systems in clinical compliance automation and underscore\nthe importance of understanding their cognitive adaptations and strategic\nbehavior in developing more explainable and reliable medical AI.",
        "url": "http://arxiv.org/abs/2510.19139v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19139v1",
        "arxiv_id": "2510.19139v1",
        "authors": [
            "Sohyeon Jeon",
            "Hyung-Chul Lee"
        ],
        "submitted": "2025-10-22 00:15:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Training-Free Spectral Fingerprints of Voice Processing in Transformers",
        "abstract": "Different transformer architectures implement identical linguistic\ncomputations via distinct connectivity patterns, yielding model imprinted\n``computational fingerprints'' detectable through spectral analysis. Using\ngraph signal processing on attention induced token graphs, we track changes in\nalgebraic connectivity (Fiedler value, $\\Delta\\lambda_2$) under voice\nalternation across 20 languages and three model families, with a prespecified\nearly window (layers 2--5). Our analysis uncovers clear architectural\nsignatures: Phi-3-Mini shows a dramatic English specific early layer disruption\n($\\overline{\\Delta\\lambda_2}_{[2,5]}\\!\\approx\\!-0.446$) while effects in 19\nother languages are minimal, consistent with public documentation that\npositions the model primarily for English use. Qwen2.5-7B displays small,\ndistributed shifts that are largest for morphologically rich languages, and\nLLaMA-3.2-1B exhibits systematic but muted responses. These spectral signatures\ncorrelate strongly with behavioral differences (Phi-3: $r=-0.976$) and are\nmodulated by targeted attention head ablations, linking the effect to early\nattention structure and confirming functional relevance. Taken together, the\nfindings are consistent with the view that training emphasis can leave\ndetectable computational imprints: specialized processing strategies that\nmanifest as measurable connectivity patterns during syntactic transformations.\nBeyond voice alternation, the framework differentiates reasoning modes,\nindicating utility as a simple, training free diagnostic for revealing\narchitectural biases and supporting model reliability analysis.",
        "url": "http://arxiv.org/abs/2510.19131v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19131v1",
        "arxiv_id": "2510.19131v1",
        "authors": [
            "Valentin Noël"
        ],
        "submitted": "2025-10-21 23:33:43",
        "source": "arxiv",
        "comment": "Preprint under review (2025). 12 pages, 8 figures"
    },
    {
        "title": "A Graph Signal Processing Framework for Hallucination Detection in Large Language Models",
        "abstract": "Large language models achieve impressive results but distinguishing factual\nreasoning from hallucinations remains challenging. We propose a spectral\nanalysis framework that models transformer layers as dynamic graphs induced by\nattention, with token embeddings as signals on these graphs. Through graph\nsignal processing, we define diagnostics including Dirichlet energy, spectral\nentropy, and high-frequency energy ratios, with theoretical connections to\ncomputational stability. Experiments across GPT architectures suggest universal\nspectral patterns: factual statements exhibit consistent \"energy mountain\"\nbehavior with low-frequency convergence, while different hallucination types\nshow distinct signatures. Logical contradictions destabilize spectra with large\neffect sizes ($g>1.0$), semantic errors remain stable but show connectivity\ndrift, and substitution hallucinations display intermediate perturbations. A\nsimple detector using spectral signatures achieves 88.75% accuracy versus 75%\nfor perplexity-based baselines, demonstrating practical utility. These findings\nindicate that spectral geometry may capture reasoning patterns and error\nbehaviors, potentially offering a framework for hallucination detection in\nlarge language models.",
        "url": "http://arxiv.org/abs/2510.19117v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19117v1",
        "arxiv_id": "2510.19117v1",
        "authors": [
            "Valentin Noël"
        ],
        "submitted": "2025-10-21 22:35:48",
        "source": "arxiv",
        "comment": "Preprint under review (2025). 11 pages, 7 figures. Code and scripts:\n  to be released"
    },
    {
        "title": "That's Deprecated! Understanding, Detecting, and Steering Knowledge Conflicts in Language Models for Code Generation",
        "abstract": "This paper investigates how large language models (LLMs) behave when faced\nwith discrepancies between their parametric knowledge and conflicting\ninformation contained in a prompt. Building on prior question-answering (QA)\nresearch, we extend the investigation of knowledge conflicts to the realm of\ncode generation. We propose a domain-agnostic framework for constructing and\ninterpreting such conflicts, along with a novel evaluation method and dataset\ntailored to code conflict scenarios. Our experiments indicate that sufficiently\nlarge LLMs encode the notion of a knowledge conflict in their parameters,\nenabling us to detect knowledge conflicts with up to \\textbf{80.65\\%} accuracy.\nBuilding on these insights, we show that activation-level steering can achieve\nup to a \\textbf{12.6\\%} improvement in steering success over a random baseline.\nHowever, effectiveness depends critically on balancing model size, task domain,\nand steering direction. The experiment code and data will be made publicly\navailable after acceptance.",
        "url": "http://arxiv.org/abs/2510.19116v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19116v1",
        "arxiv_id": "2510.19116v1",
        "authors": [
            "Jaesung Bae",
            "Cameron Churchwell",
            "Mitchell Hermon",
            "Tsun-An Hsieh",
            "Jocelyn Xu",
            "Yekaterina Yegorova",
            "Mark Hasegawa-Johnson",
            "Heng Ji"
        ],
        "submitted": "2025-10-21 22:27:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "PoSh: Using Scene Graphs To Guide LLMs-as-a-Judge For Detailed Image Descriptions",
        "abstract": "While vision-language models (VLMs) have advanced into detailed image\ndescription, evaluation remains a challenge. Standard metrics (e.g. CIDEr,\nSPICE) were designed for short texts and tuned to recognize errors that are now\nuncommon, such as object misidentification. In contrast, long texts require\nsensitivity to attribute and relation attachments and scores that localize\nerrors to particular text spans. In this work, we introduce PoSh, a metric for\ndetailed image description that uses scene graphs as structured rubrics to\nguide LLMs-as-a-Judge, producing aggregate scores grounded in fine-grained\nerrors (e.g. mistakes in compositional understanding). PoSh is replicable,\ninterpretable and a better proxy for human raters than existing metrics\n(including GPT4o-as-a-Judge). To validate PoSh, we introduce a challenging new\ndataset, DOCENT. This novel benchmark contains artwork, paired with\nexpert-written references, and model-generated descriptions, augmented with\ngranular and coarse judgments of their quality from art history students. Thus,\nDOCENT enables evaluating both detailed image description metrics and detailed\nimage description itself in a challenging new domain. We show that PoSh\nachieves stronger correlations (+0.05 Spearman $\\rho$) with the human judgments\nin DOCENT than the best open-weight alternatives, is robust to image type\n(using CapArena, an existing dataset of web imagery) and is a capable reward\nfunction, outperforming standard supervised fine-tuning. Then, using PoSh, we\ncharacterize the performance of open and closed models in describing the\npaintings, sketches and statues in DOCENT and find that foundation models\nstruggle to achieve full, error-free coverage of images with rich scene\ndynamics, establishing a demanding new task to gauge VLM progress. Through both\nPoSh and DOCENT, we hope to enable advances in important areas such as\nassistive text generation.",
        "url": "http://arxiv.org/abs/2510.19060v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19060v1",
        "arxiv_id": "2510.19060v1",
        "authors": [
            "Amith Ananthram",
            "Elias Stengel-Eskin",
            "Lorena A. Bradford",
            "Julia Demarest",
            "Adam Purvis",
            "Keith Krut",
            "Robert Stein",
            "Rina Elster Pantalony",
            "Mohit Bansal",
            "Kathleen McKeown"
        ],
        "submitted": "2025-10-21 20:30:20",
        "source": "arxiv",
        "comment": "24 pages, 9 figures. Metric/benchmark available at\n  https://github.com/amith-ananthram/posh"
    },
    {
        "title": "DeBERTa-KC: A Transformer-Based Classifier for Knowledge Construction in Online Learning Discourse",
        "abstract": "This study presents DeBERTa-KC, a transformer-based model for automatic\nclassification of knowledge construction (KC) levels in online science learning\ndiscourse. Using comments collected from four popular YouTube science channels\n(2022--2024), a balanced corpus of 20,000 manually annotated samples was\ncreated across four KC categories: \\textit{nonKC}, \\textit{Share},\n\\textit{Explore}, and \\textit{Negotiate}. The proposed model extends DeBERTa-v3\nwith Focal Loss, Label Smoothing, and R-Drop regularization to address class\nimbalance and enhance generalization. A reproducible end-to-end pipeline was\nimplemented, encompassing data extraction, annotation, preprocessing, training,\nand evaluation. Across 10-fold stratified cross-validation, DeBERTa-KC achieved\na macro-F1 of $0.836 \\pm 0.008$, significantly out-performing both classical\nand transformer baselines ($p<0.01$). Per-category results indicate strong\nsensitivity to higher-order epistemic engagement, particularly in\n\\textit{Explore} and \\textit{Negotiate} discourse. These findings demonstrate\nthat large language models can effectively capture nuanced indicators of\nknowledge construction in informal digital learning environments, offering\nscalable, theory-informed approaches to discourse analysis and the development\nof automated tools for assessing epistemic engagement.",
        "url": "http://arxiv.org/abs/2510.19858v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19858v1",
        "arxiv_id": "2510.19858v1",
        "authors": [
            "Jindi Wang",
            "Yidi Zhang",
            "Zhaoxing Li"
        ],
        "submitted": "2025-10-21 20:26:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "From Memorization to Generalization: Fine-Tuning Large Language Models for Biomedical Term-to-Identifier Normalization",
        "abstract": "Effective biomedical data integration depends on automated term\nnormalization, the mapping of natural language biomedical terms to standardized\nidentifiers. This linking of terms to identifiers is essential for semantic\ninteroperability. Large language models (LLMs) show promise for this task but\nperform unevenly across terminologies. We evaluated both memorization\n(training-term performance) and generalization (validation-term performance)\nacross multiple biomedical ontologies. Fine-tuning Llama 3.1 8B revealed marked\ndifferences by terminology. GO mappings showed strong memorization gains (up to\n77% improvement in term-to-identifier accuracy), whereas HPO showed minimal\nimprovement. Generalization occurred only for protein-gene (GENE) mappings\n(13.9% gain), while fine-tuning for HPO and GO yielded negligible transfer.\nBaseline accuracy varied by model scale, with GPT-4o outperforming both Llama\nvariants for all terminologies. Embedding analyses showed tight semantic\nalignment between gene symbols and protein names but weak alignment between\nterms and identifiers for GO or HPO, consistent with limited lexicalization.\nFine-tuning success depended on two interacting factors: identifier popularity\nand lexicalization. Popular identifiers were more likely encountered during\npretraining, enhancing memorization. Lexicalized identifiers, such as gene\nsymbols, enabled semantic generalization. By contrast, arbitrary identifiers in\nGO and HPO constrained models to rote learning. These findings provide a\npredictive framework for when fine-tuning enhances factual recall versus when\nit fails due to sparse or non-lexicalized identifiers.",
        "url": "http://arxiv.org/abs/2510.19036v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19036v1",
        "arxiv_id": "2510.19036v1",
        "authors": [
            "Suswitha Pericharla",
            "Daniel B. Hier",
            "Tayo Obafemi-Ajayi"
        ],
        "submitted": "2025-10-21 19:39:10",
        "source": "arxiv",
        "comment": "Submitted for publication to BMC BioData Mining"
    },
    {
        "title": "When Can We Trust LLMs in Mental Health? Large-Scale Benchmarks for Reliable LLM Evaluation",
        "abstract": "Evaluating Large Language Models (LLMs) for mental health support is\nchallenging due to the emotionally and cognitively complex nature of\ntherapeutic dialogue. Existing benchmarks are limited in scale, reliability,\noften relying on synthetic or social media data, and lack frameworks to assess\nwhen automated judges can be trusted. To address the need for large-scale\ndialogue datasets and judge reliability assessment, we introduce two benchmarks\nthat provide a framework for generation and evaluation. MentalBench-100k\nconsolidates 10,000 one-turn conversations from three real scenarios datasets,\neach paired with nine LLM-generated responses, yielding 100,000 response pairs.\nMentalAlign-70k}reframes evaluation by comparing four high-performing LLM\njudges with human experts across 70,000 ratings on seven attributes, grouped\ninto Cognitive Support Score (CSS) and Affective Resonance Score (ARS). We then\nemploy the Affective Cognitive Agreement Framework, a statistical methodology\nusing intraclass correlation coefficients (ICC) with confidence intervals to\nquantify agreement, consistency, and bias between LLM judges and human experts.\nOur analysis reveals systematic inflation by LLM judges, strong reliability for\ncognitive attributes such as guidance and informativeness, reduced precision\nfor empathy, and some unreliability in safety and relevance. Our contributions\nestablish new methodological and empirical foundations for reliable,\nlarge-scale evaluation of LLMs in mental health. We release the benchmarks and\ncodes at: https://github.com/abeerbadawi/MentalBench/",
        "url": "http://arxiv.org/abs/2510.19032v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19032v1",
        "arxiv_id": "2510.19032v1",
        "authors": [
            "Abeer Badawi",
            "Elahe Rahimi",
            "Md Tahmid Rahman Laskar",
            "Sheri Grach",
            "Lindsay Bertrand",
            "Lames Danok",
            "Jimmy Huang",
            "Frank Rudzicz",
            "Elham Dolatabadi"
        ],
        "submitted": "2025-10-21 19:21:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Re:Member: Emotional Question Generation from Personal Memories",
        "abstract": "We present Re:Member, a system that explores how emotionally expressive,\nmemory-grounded interaction can support more engaging second language (L2)\nlearning. By drawing on users' personal videos and generating stylized spoken\nquestions in the target language, Re:Member is designed to encourage affective\nrecall and conversational engagement. The system aligns emotional tone with\nvisual context, using expressive speech styles such as whispers or late-night\ntones to evoke specific moods. It combines WhisperX-based transcript alignment,\n3-frame visual sampling, and Style-BERT-VITS2 for emotional synthesis within a\nmodular generation pipeline. Designed as a stylized interaction probe,\nRe:Member highlights the role of affect and personal media in learner-centered\neducational technologies.",
        "url": "http://arxiv.org/abs/2510.19030v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19030v1",
        "arxiv_id": "2510.19030v1",
        "authors": [
            "Zackary Rackauckas",
            "Nobuaki Minematsu",
            "Julia Hirschberg"
        ],
        "submitted": "2025-10-21 19:14:15",
        "source": "arxiv",
        "comment": "Accepted to HCI+NLP at ACL 2025"
    },
    {
        "title": "Are they lovers or friends? Evaluating LLMs' Social Reasoning in English and Korean Dialogues",
        "abstract": "As large language models (LLMs) are increasingly used in human-AI\ninteractions, their social reasoning capabilities in interpersonal contexts are\ncritical. We introduce SCRIPTS, a 1k-dialogue dataset in English and Korean,\nsourced from movie scripts. The task involves evaluating models' social\nreasoning capability to infer the interpersonal relationships (e.g., friends,\nsisters, lovers) between speakers in each dialogue. Each dialogue is annotated\nwith probabilistic relational labels (Highly Likely, Less Likely, Unlikely) by\nnative (or equivalent) Korean and English speakers from Korea and the U.S.\nEvaluating nine models on our task, current proprietary LLMs achieve around\n75-80% on the English dataset, whereas their performance on Korean drops to\n58-69%. More strikingly, models select Unlikely relationships in 10-25% of\ntheir responses. Furthermore, we find that thinking models and chain-of-thought\nprompting, effective for general reasoning, provide minimal benefits for social\nreasoning and occasionally amplify social biases. Our findings reveal\nsignificant limitations in current LLMs' social reasoning capabilities,\nhighlighting the need for efforts to develop socially-aware language models.",
        "url": "http://arxiv.org/abs/2510.19028v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19028v1",
        "arxiv_id": "2510.19028v1",
        "authors": [
            "Eunsu Kim",
            "Junyeong Park",
            "Juhyun Oh",
            "Kiwoong Park",
            "Seyoung Song",
            "A. Seza Dogruoz",
            "Najoung Kim",
            "Alice Oh"
        ],
        "submitted": "2025-10-21 19:12:47",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "XGen-Q: An Explainable Domain-Adaptive LLM Framework with Retrieval-Augmented Generation for Software Security",
        "abstract": "Generative AI and large language models (LLMs) have shown strong capabilities\nin code understanding, but their use in cybersecurity, particularly for malware\ndetection and analysis, remains limited. Existing detection systems often fail\nto generalize to obfuscated or previously unseen threats, underscoring the need\nfor more adaptable and explainable models. To address this challenge, we\nintroduce XGen-Q, a domain-adapted LLM built on the Qwen-Coder architecture and\npretrained on a large-scale corpus of over one million malware samples,\nspanning both source and assembly code. XGen-Q uses a multi-stage prompt\nstrategy combined with retrieval-augmented generation (RAG) to deliver reliable\nmalware identification and detailed forensic reporting, even in the presence of\ncomplex code obfuscation. To further enhance generalization, we design a\ntraining pipeline that systematically exposes the model to diverse obfuscation\npatterns. Experimental results show that XGen-Q achieves significantly lower\nperplexity than competitive baselines and exhibits strong performance on novel\nmalware samples, demonstrating the promise of LLM-based approaches for\ninterpretable and robust malware analysis.",
        "url": "http://arxiv.org/abs/2510.19006v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19006v1",
        "arxiv_id": "2510.19006v1",
        "authors": [
            "Hamed Jelodar",
            "Mohammad Meymani",
            "Roozbeh Razavi-Far",
            "Ali A. Ghorbani"
        ],
        "submitted": "2025-10-21 18:35:38",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Dynamic Evaluation for Oversensitivity in LLMs",
        "abstract": "Oversensitivity occurs when language models defensively reject prompts that\nare actually benign. This behavior not only disrupts user interactions but also\nobscures the boundary between harmful and harmless content. Existing benchmarks\nrely on static datasets that degrade overtime as models evolve, leading to data\ncontamination and diminished evaluative power. To address this, we develop a\nframework that dynamically generates model-specific challenging datasets,\ncapturing emerging defensive patterns and aligning with each model's unique\nbehavior. Building on this approach, we construct OVERBENCH, a benchmark that\naggregates these datasets across diverse LLM families, encompassing 450,000\nsamples from 25 models. OVERBENCH provides a dynamic and evolving perspective\non oversensitivity, allowing for continuous monitoring of defensive triggers as\nmodels advance, highlighting vulnerabilities that static datasets overlook.",
        "url": "http://arxiv.org/abs/2510.19005v1",
        "pdf_url": "http://arxiv.org/pdf/2510.19005v1",
        "arxiv_id": "2510.19005v1",
        "authors": [
            "Sophia Xiao Pu",
            "Sitao Cheng",
            "Xin Eric Wang",
            "William Yang Wang"
        ],
        "submitted": "2025-10-21 18:33:47",
        "source": "arxiv",
        "comment": "EMNLP-Findings 2025"
    }
]