[
    {
        "title": "TimeLens: Rethinking Video Temporal Grounding with Multimodal LLMs",
        "abstract": "This paper does not introduce a novel method but instead establishes a straightforward, incremental, yet essential baseline for video temporal grounding (VTG), a core capability in video understanding. While multimodal large language models (MLLMs) excel at various video understanding tasks, the recipes for optimizing them for VTG remain under-explored. In this paper, we present TimeLens, a systematic investigation into building MLLMs with strong VTG ability, along two primary dimensions: data quality and algorithmic design. We first expose critical quality issues in existing VTG benchmarks and introduce TimeLens-Bench, comprising meticulously re-annotated versions of three popular benchmarks with strict quality criteria. Our analysis reveals dramatic model re-rankings compared to legacy benchmarks, confirming the unreliability of prior evaluation standards. We also address noisy training data through an automated re-annotation pipeline, yielding TimeLens-100K, a large-scale, high-quality training dataset. Building on our data foundation, we conduct in-depth explorations of algorithmic design principles, yielding a series of meaningful insights and effective yet efficient practices. These include interleaved textual encoding for time representation, a thinking-free reinforcement learning with verifiable rewards (RLVR) approach as the training paradigm, and carefully designed recipes for RLVR training. These efforts culminate in TimeLens models, a family of MLLMs with state-of-the-art VTG performance among open-source models and even surpass proprietary models such as GPT-5 and Gemini-2.5-Flash. All codes, data, and models will be released to facilitate future research.",
        "url": "http://arxiv.org/abs/2512.14698v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14698v1",
        "arxiv_id": "2512.14698v1",
        "authors": [
            "Jun Zhang",
            "Teng Wang",
            "Yuying Ge",
            "Yixiao Ge",
            "Xinhao Li",
            "Ying Shan",
            "Limin Wang"
        ],
        "submitted": "2025-12-16 18:59:58",
        "source": "arxiv",
        "comment": "Project Page: https://timelens-arc-lab.github.io/"
    },
    {
        "title": "MMGR: Multi-Modal Generative Reasoning",
        "abstract": "Video foundation models generate visually realistic and temporally coherent content, but their reliability as world simulators depends on whether they capture physical, logical, and spatial constraints. Existing metrics such as Frechet Video Distance (FVD) emphasize perceptual quality and overlook reasoning failures, including violations of causality, physics, and global consistency. We introduce MMGR (Multi-Modal Generative Reasoning Evaluation and Benchmark), a principled evaluation framework based on five reasoning abilities: Physical, Logical, 3D Spatial, 2D Spatial, and Temporal. MMGR evaluates generative reasoning across three domains: Abstract Reasoning (ARC-AGI, Sudoku), Embodied Navigation (real-world 3D navigation and localization), and Physical Commonsense (sports and compositional interactions). MMGR applies fine-grained metrics that require holistic correctness across both video and image generation. We benchmark leading video models (Veo-3, Sora-2, Wan-2.2) and image models (Nano-banana, Nano-banana Pro, GPT-4o-image, Qwen-image), revealing strong performance gaps across domains. Models show moderate success on Physical Commonsense tasks but perform poorly on Abstract Reasoning (below 10 percent accuracy on ARC-AGI) and struggle with long-horizon spatial planning in embodied settings. Our analysis highlights key limitations in current models, including overreliance on perceptual data, weak global state consistency, and objectives that reward visual plausibility over causal correctness. MMGR offers a unified diagnostic benchmark and a path toward reasoning-aware generative world models.",
        "url": "http://arxiv.org/abs/2512.14691v2",
        "pdf_url": "https://arxiv.org/pdf/2512.14691v2",
        "arxiv_id": "2512.14691v2",
        "authors": [
            "Zefan Cai",
            "Haoyi Qiu",
            "Tianyi Ma",
            "Haozhe Zhao",
            "Gengze Zhou",
            "Kung-Hsiang Huang",
            "Parisa Kordjamshidi",
            "Minjia Zhang",
            "Wen Xiao",
            "Jiuxiang Gu",
            "Nanyun Peng",
            "Junjie Hu"
        ],
        "submitted": "2025-12-16 18:58:04",
        "source": "arxiv",
        "comment": "work in progress"
    },
    {
        "title": "Spoken DialogSum: An Emotion-Rich Conversational Dataset for Spoken Dialogue Summarization",
        "abstract": "Recent audio language models can follow long conversations. However, research on emotion-aware or spoken dialogue summarization is constrained by the lack of data that links speech, summaries, and paralinguistic cues. We introduce Spoken DialogSum, the first corpus aligning raw conversational audio with factual summaries, emotion-rich summaries, and utterance-level labels for speaker age, gender, and emotion. The dataset is built in two stages: first, an LLM rewrites DialogSum scripts with Switchboard-style fillers and back-channels, then tags each utterance with emotion, pitch, and speaking rate. Second, an expressive TTS engine synthesizes speech from the tagged scripts, aligned with paralinguistic labels. Spoken DialogSum comprises 13,460 emotion-diverse dialogues, each paired with both a factual and an emotion-focused summary. The dataset is available online at https://fatfat-emosum.github.io/EmoDialog-Sum-Audio-Samples/. Baselines show that an Audio-LLM raises emotional-summary ROUGE-L by 28% relative to a cascaded ASR-LLM system, confirming the value of end-to-end speech modeling.",
        "url": "http://arxiv.org/abs/2512.14687v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14687v1",
        "arxiv_id": "2512.14687v1",
        "authors": [
            "Yen-Ju Lu",
            "Kunxiao Gao",
            "Mingrui Liang",
            "Helin Wang",
            "Thomas Thebaud",
            "Laureano Moro-Velazquez",
            "Najim Dehak",
            "Jesus Villalba"
        ],
        "submitted": "2025-12-16 18:54:20",
        "source": "arxiv",
        "comment": "12 pages, 2 figures"
    },
    {
        "title": "Fast and Accurate Causal Parallel Decoding using Jacobi Forcing",
        "abstract": "Multi-token generation has emerged as a promising paradigm for accelerating transformer-based large model inference. Recent efforts primarily explore diffusion Large Language Models (dLLMs) for parallel decoding to reduce inference latency. To achieve AR-level generation quality, many techniques adapt AR models into dLLMs to enable parallel decoding. However, they suffer from limited speedup compared to AR models due to a pretrain-to-posttrain mismatch. Specifically, the masked data distribution in post-training deviates significantly from the real-world data distribution seen during pretraining, and dLLMs rely on bidirectional attention, which conflicts with the causal prior learned during pretraining and hinders the integration of exact KV cache reuse. To address this, we introduce Jacobi Forcing, a progressive distillation paradigm where models are trained on their own generated parallel decoding trajectories, smoothly shifting AR models into efficient parallel decoders while preserving their pretrained causal inference property. The models trained under this paradigm, Jacobi Forcing Model, achieves 3.8x wall-clock speedup on coding and math benchmarks with minimal loss in performance. Based on Jacobi Forcing Models' trajectory characteristics, we introduce multi-block decoding with rejection recycling, which enables up to 4.5x higher token acceptance count per iteration and nearly 4.0x wall-clock speedup, effectively trading additional compute for lower inference latency. Our code is available at https://github.com/hao-ai-lab/JacobiForcing.",
        "url": "http://arxiv.org/abs/2512.14681v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14681v1",
        "arxiv_id": "2512.14681v1",
        "authors": [
            "Lanxiang Hu",
            "Siqi Kou",
            "Yichao Fu",
            "Samyam Rajbhandari",
            "Tajana Rosing",
            "Yuxiong He",
            "Zhijie Deng",
            "Hao Zhang"
        ],
        "submitted": "2025-12-16 18:45:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Segmental Attention Decoding With Long Form Acoustic Encodings",
        "abstract": "We address the fundamental incompatibility of attention-based encoder-decoder (AED) models with long-form acoustic encodings. AED models trained on segmented utterances learn to encode absolute frame positions by exploiting limited acoustic context beyond segment boundaries, but fail to generalize when decoding long-form segments where these cues vanish. The model loses ability to order acoustic encodings due to permutation invariance of keys and values in cross-attention. We propose four modifications: (1) injecting explicit absolute positional encodings into cross-attention for each decoded segment, (2) long-form training with extended acoustic context to eliminate implicit absolute position encoding, (3) segment concatenation to cover diverse segmentations needed during training, and (4) semantic segmentation to align AED-decoded segments with training segments. We show these modifications close the accuracy gap between continuous and segmented acoustic encodings, enabling auto-regressive use of the attention decoder.",
        "url": "http://arxiv.org/abs/2512.14652v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14652v1",
        "arxiv_id": "2512.14652v1",
        "authors": [
            "Pawel Swietojanski",
            "Xinwei Li",
            "Mingbin Xu",
            "Takaaki Hori",
            "Dogan Can",
            "Xiaodan Zhuang"
        ],
        "submitted": "2025-12-16 18:12:37",
        "source": "arxiv",
        "comment": "5 pages, 1 fig"
    },
    {
        "title": "TiME: Tiny Monolingual Encoders for Efficient NLP Pipelines",
        "abstract": "Today, a lot of research on language models is focused on large, general-purpose models. However, many NLP pipelines only require models with a well-defined, small set of capabilities. While large models are capable of performing the tasks of those smaller models, they are simply not fast enough to process large amounts of data or offer real-time responses. Furthermore, they often use unnecessarily large amounts of energy, leading to sustainability concerns and problems when deploying them on battery-powered devices. In our work, we show how to train small models for such efficiency-critical applications. As opposed to many off-the-shelf NLP pipelines, our models use modern training techniques such as distillation, and offer support for low-resource languages. We call our models TiME (Tiny Monolingual Encoders) and comprehensively evaluate them on a range of common NLP tasks, observing an improved trade-off between benchmark performance on one hand, and throughput, latency and energy consumption on the other. Along the way, we show that distilling monolingual models from multilingual teachers is possible, and likewise distilling models with absolute positional embeddings from teachers with relative positional embeddings.",
        "url": "http://arxiv.org/abs/2512.14645v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14645v1",
        "arxiv_id": "2512.14645v1",
        "authors": [
            "David Schulmeister",
            "Valentin Hartmann",
            "Lars Klein",
            "Robert West"
        ],
        "submitted": "2025-12-16 18:02:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Incentives or Ontology? A Structural Rebuttal to OpenAI's Hallucination Thesis",
        "abstract": "OpenAI has recently argued that hallucinations in large language models result primarily from misaligned evaluation incentives that reward confident guessing rather than epistemic humility. On this view, hallucination is a contingent behavioral artifact, remediable through improved benchmarks and reward structures. In this paper, we challenge that interpretation. Drawing on previous work on structural hallucination and empirical experiments using a Licensing Oracle, we argue that hallucination is not an optimization failure but an architectural inevitability of the transformer model.\n  Transformers do not represent the world; they model statistical associations among tokens. Their embedding spaces form a pseudo-ontology derived from linguistic co-occurrence rather than world-referential structure. At ontological boundary conditions - regions where training data is sparse or incoherent - the model necessarily interpolates fictional continuations in order to preserve coherence. No incentive mechanism can modify this structural dependence on pattern completion.\n  Our empirical results demonstrate that hallucination can only be eliminated through external truth-validation and abstention modules, not through changes to incentives, prompting, or fine-tuning. The Licensing Oracle achieves perfect abstention precision across domains precisely because it supplies grounding that the transformer lacks.\n  We conclude that hallucination is a structural property of generative architectures and that reliable AI requires hybrid systems that distinguish linguistic fluency from epistemic responsibility.",
        "url": "http://arxiv.org/abs/2512.14801v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14801v1",
        "arxiv_id": "2512.14801v1",
        "authors": [
            "Richard Ackermann",
            "Simeon Emanuilov"
        ],
        "submitted": "2025-12-16 17:39:45",
        "source": "arxiv",
        "comment": "17 pages, references to prior work arXiv:2509.16297 and arXiv:2511.06073"
    },
    {
        "title": "JMMMU-Pro: Image-based Japanese Multi-discipline Multimodal Understanding Benchmark via Vibe Benchmark Construction",
        "abstract": "This paper introduces JMMMU-Pro, an image-based Japanese Multi-discipline Multimodal Understanding Benchmark, and Vibe Benchmark Construction, a scalable construction method. Following the evolution from MMMU to MMMU-Pro, JMMMU-Pro extends JMMMU by composing the question image and question text into a single image, thereby creating a benchmark that requires integrated visual-textual understanding through visual perception. To build JMMMU-Pro, we propose Vibe Benchmark Construction, a methodology in which an image generative model (e.g., Nano Banana Pro) produces candidate visual questions, and humans verify the outputs and, when necessary, regenerate with adjusted prompts to ensure quality. By leveraging Nano Banana Pro's highly realistic image generation capabilities and its ability to embed clean Japanese text, we construct a high-quality benchmark at low cost, covering a wide range of background and layout designs. Experimental results show that all open-source LMMs struggle substantially with JMMMU-Pro, underscoring JMMMU-Pro as an important benchmark for guiding future efforts in the open-source community. We believe that JMMMU-Pro provides a more rigorous evaluation tool for assessing the Japanese capabilities of LMMs and that our Vibe Benchmark Construction also offers an efficient guideline for future development of image-based VQA benchmarks.",
        "url": "http://arxiv.org/abs/2512.14620v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14620v1",
        "arxiv_id": "2512.14620v1",
        "authors": [
            "Atsuyuki Miyai",
            "Shota Onohara",
            "Jeonghun Baek",
            "Kiyoharu Aizawa"
        ],
        "submitted": "2025-12-16 17:33:00",
        "source": "arxiv",
        "comment": "Project page: https://mmmu-japanese-benchmark.github.io/JMMMU_Pro/"
    },
    {
        "title": "Towards Nepali-language LLMs: Efficient GPT training with a Nepali BPE tokenizer",
        "abstract": "Nepali, a low-resource language spoken by over 32 million people, continues to face challenges in natural language processing (NLP) due to its complex grammar, agglutinative morphology, and limited availability of high-quality corpora. Most efforts to date have centered on basic encoder architectures; they remain insufficient for Nepali-specific text generation. This study presents a GPT-2-based Nepali language model trained using several training strategies inspired by GPT-3, including optimized learning rate schedules, batch scaling, and architectural refinements. A custom 16k Byte-Pair Encoding (BPE) tokenizer was trained exclusively on Nepali text to ensure more consistent segmentation and improved input representation. The model was pretrained on a combined dataset comprising a 10.75GB cleaned NepBERTa corpus and additional web-scraped Nepali news articles. FlashAttention was integrated to reduce memory usage and stabilize training. After two epochs, the model achieved a training loss of 3.168177, a validation loss of 3.081982, and a final perplexity of 21.80, demonstrating its capability to generate coherent Nepali news-style text.",
        "url": "http://arxiv.org/abs/2512.14585v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14585v1",
        "arxiv_id": "2512.14585v1",
        "authors": [
            "Adarsha Shrestha",
            "Basanta Pokharel",
            "Binit Shrestha",
            "Smriti Adhikari",
            "Dinesh Gothe"
        ],
        "submitted": "2025-12-16 16:53:11",
        "source": "arxiv",
        "comment": "Work in progress"
    },
    {
        "title": "Low-Resource, High-Impact: Building Corpora for Inclusive Language Technologies",
        "abstract": "This tutorial (https://tum-nlp.github.io/low-resource-tutorial) is designed for NLP practitioners, researchers, and developers working with multilingual and low-resource languages who seek to create more equitable and socially impactful language technologies. Participants will walk away with a practical toolkit for building end-to-end NLP pipelines for underrepresented languages -- from data collection and web crawling to parallel sentence mining, machine translation, and downstream applications such as text classification and multimodal reasoning. The tutorial presents strategies for tackling the challenges of data scarcity and cultural variance, offering hands-on methods and modeling frameworks. We will focus on fair, reproducible, and community-informed development approaches, grounded in real-world scenarios. We will showcase a diverse set of use cases covering over 10 languages from different language families and geopolitical contexts, including both digitally resource-rich and severely underrepresented languages.",
        "url": "http://arxiv.org/abs/2512.14576v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14576v1",
        "arxiv_id": "2512.14576v1",
        "authors": [
            "Ekaterina Artemova",
            "Laurie Burchell",
            "Daryna Dementieva",
            "Shu Okabe",
            "Mariya Shmatova",
            "Pedro Ortiz Suarez"
        ],
        "submitted": "2025-12-16 16:44:17",
        "source": "arxiv",
        "comment": "Tutorial is accepted to LREC2026"
    },
    {
        "title": "Pairwise Comparison for Bias Identification and Quantification",
        "abstract": "Linguistic bias in online news and social media is widespread but difficult to measure. Yet, its identification and quantification remain difficult due to subjectivity, context dependence, and the scarcity of high-quality gold-label datasets. We aim to reduce annotation effort by leveraging pairwise comparison for bias annotation. To overcome the costliness of the approach, we evaluate more efficient implementations of pairwise comparison-based rating. We achieve this by investigating the effects of various rating techniques and the parameters of three cost-aware alternatives in a simulation environment. Since the approach can in principle be applied to both human and large language model annotation, our work provides a basis for creating high-quality benchmark datasets and for quantifying biases and other subjective linguistic aspects.\n  The controlled simulations include latent severity distributions, distance-calibrated noise, and synthetic annotator bias to probe robustness and cost-quality trade-offs. In applying the approach to human-labeled bias benchmark datasets, we then evaluate the most promising setups and compare them to direct assessment by large language models and unmodified pairwise comparison labels as baselines. Our findings support the use of pairwise comparison as a practical foundation for quantifying subjective linguistic aspects, enabling reproducible bias analysis. We contribute an optimization of comparison and matchmaking components, an end-to-end evaluation including simulation and real-data application, and an implementation blueprint for cost-aware large-scale annotation",
        "url": "http://arxiv.org/abs/2512.14565v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14565v1",
        "arxiv_id": "2512.14565v1",
        "authors": [
            "Fabian Haak",
            "Philipp Schaer"
        ],
        "submitted": "2025-12-16 16:36:55",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Polypersona: Persona-Grounded LLM for Synthetic Survey Responses",
        "abstract": "This paper introduces PolyPersona, a generative framework for synthesizing persona-conditioned survey responses across multiple domains. The framework instruction-tunes compact chat models using parameter-efficient LoRA adapters with 4-bit quantization under a resource-adaptive training setup. A dialogue-based data pipeline explicitly preserves persona cues, ensuring consistent behavioral alignment across generated responses. Using this pipeline, we construct a dataset of 3,568 synthetic survey responses spanning ten domains and 433 distinct personas, enabling controlled instruction tuning and systematic multi-domain evaluation. We evaluate the generated responses using a multi-metric evaluation suite that combines standard text generation metrics, including BLEU, ROUGE, and BERTScore, with survey-specific metrics designed to assess structural coherence, stylistic consistency, and sentiment alignment.Experimental results show that compact models such as TinyLlama 1.1B and Phi-2 achieve performance comparable to larger 7B to 8B baselines, with a highest BLEU score of 0.090 and ROUGE-1 of 0.429. These findings demonstrate that persona-conditioned fine-tuning enables small language models to generate reliable and coherent synthetic survey data. The proposed framework provides an efficient and reproducible approach for survey data generation, supporting scalable evaluation while facilitating bias analysis through transparent and open protocols.",
        "url": "http://arxiv.org/abs/2512.14562v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14562v1",
        "arxiv_id": "2512.14562v1",
        "authors": [
            "Tejaswani Dash",
            "Dinesh Karri",
            "Anudeep Vurity",
            "Gautam Datla",
            "Tazeem Ahmad",
            "Saima Rafi",
            "Rohith Tangudu"
        ],
        "submitted": "2025-12-16 16:33:23",
        "source": "arxiv",
        "comment": "Accepted in IEEE Bigdata 2025- LLMs4ALL"
    },
    {
        "title": "Agreement Between Large Language Models and Human Raters in Essay Scoring: A Research Synthesis",
        "abstract": "Despite the growing promise of large language models (LLMs) in automatic essay scoring (AES), empirical findings regarding their reliability compared to human raters remain mixed. Following the PRISMA 2020 guidelines, we synthesized 65 published and unpublished studies from January 2022 to August 2025 that examined agreement between LLMs and human raters in AES. Across studies, reported LLM-human agreement was generally moderate to good, with agreement indices (e.g., Quadratic Weighted Kappa, Pearson correlation, and Spearman's rho) mostly ranging between 0.30 and 0.80. Substantial variability in agreement levels was observed across studies, reflecting differences in study-specific factors as well as the lack of standardized reporting practices. Implications and directions for future research are discussed.",
        "url": "http://arxiv.org/abs/2512.14561v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14561v1",
        "arxiv_id": "2512.14561v1",
        "authors": [
            "Hongli Li",
            "Che Han Chen",
            "Kevin Fan",
            "Chiho Young-Johnson",
            "Soyoung Lim",
            "Yali Feng"
        ],
        "submitted": "2025-12-16 16:33:07",
        "source": "arxiv",
        "comment": "This manuscript is under review as a book chapter"
    },
    {
        "title": "VLegal-Bench: Cognitively Grounded Benchmark for Vietnamese Legal Reasoning of Large Language Models",
        "abstract": "The rapid advancement of large language models (LLMs) has enabled new possibilities for applying artificial intelligence within the legal domain. Nonetheless, the complexity, hierarchical organization, and frequent revisions of Vietnamese legislation pose considerable challenges for evaluating how well these models interpret and utilize legal knowledge. To address this gap, Vietnamese Legal Benchmark (VLegal-Bench) is introduced, the first comprehensive benchmark designed to systematically assess LLMs on Vietnamese legal tasks. Informed by Bloom's cognitive taxonomy, VLegal-Bench encompasses multiple levels of legal understanding through tasks designed to reflect practical usage scenarios. The benchmark comprises 10,450 samples generated through a rigorous annotation pipeline, where legal experts label and cross-validate each instance using our annotation system to ensure every sample is grounded in authoritative legal documents and mirrors real-world legal assistant workflows, including general legal questions and answers, retrieval-augmented generation, multi-step reasoning, and scenario-based problem solving tailored to Vietnamese law. By providing a standardized, transparent, and cognitively informed evaluation framework, VLegal-Bench establishes a solid foundation for assessing LLM performance in Vietnamese legal contexts and supports the development of more reliable, interpretable, and ethically aligned AI-assisted legal systems.",
        "url": "http://arxiv.org/abs/2512.14554v2",
        "pdf_url": "https://arxiv.org/pdf/2512.14554v2",
        "arxiv_id": "2512.14554v2",
        "authors": [
            "Nguyen Tien Dong",
            "Minh-Anh Nguyen",
            "Thanh Dat Hoang",
            "Nguyen Tuan Ngoc",
            "Dao Xuan Quang Minh",
            "Phan Phi Hai",
            "Nguyen Thi Ngoc Anh",
            "Dang Van Tu",
            "Binh Vu"
        ],
        "submitted": "2025-12-16 16:28:32",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Dual Language Models: Balancing Training Efficiency and Overfitting Resilience",
        "abstract": "This paper combines autoregressive and masked-diffusion training objectives without any architectural modifications, resulting in flexible language models that outperform single-objective models. Autoregressive modeling has been a popular approach, partly because of its training efficiency; however, that comes at the cost of sensitivity to overfitting. On the other hand, masked-diffusion models are less efficient to train while being more resilient to overfitting. In this work, we demonstrate that dual-objective training achieves the best of both worlds. To derive the optimal ratio between both objectives, we train and evaluate 50 language models under varying levels of data repetition. We show that it is optimal to combine both objectives under all evaluated settings and that the optimal ratio is similar whether targeting autoregressive or masked-diffusion downstream performance.",
        "url": "http://arxiv.org/abs/2512.14549v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14549v1",
        "arxiv_id": "2512.14549v1",
        "authors": [
            "David Samuel",
            "Lucas Georges Gabriel Charpentier"
        ],
        "submitted": "2025-12-16 16:25:33",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "VersatileFFN: Achieving Parameter Efficiency in LLMs via Adaptive Wide-and-Deep Reuse",
        "abstract": "The rapid scaling of Large Language Models (LLMs) has achieved remarkable performance, but it also leads to prohibitive memory costs. Existing parameter-efficient approaches such as pruning and quantization mainly compress pretrained models without enhancing architectural capacity, thereby hitting the representational ceiling of the base model. In this work, we propose VersatileFFN, a novel feed-forward network (FFN) that enables flexible reuse of parameters in both width and depth dimensions within a fixed parameter budget. Inspired by the dual-process theory of cognition, VersatileFFN comprises two adaptive pathways: a width-versatile path that generates a mixture of sub-experts from a single shared FFN, mimicking sparse expert routing without increasing parameters, and a depth-versatile path that recursively applies the same FFN to emulate deeper processing for complex tokens. A difficulty-aware gating dynamically balances the two pathways, steering \"easy\" tokens through the efficient width-wise route and allocating deeper iterative refinement to \"hard\" tokens. Crucially, both pathways reuse the same parameters, so all additional capacity comes from computation rather than memory. Experiments across diverse benchmarks and model scales demonstrate the effectiveness of the method. The code will be available at https://github.com/huawei-noah/noah-research/tree/master/VersatileFFN.",
        "url": "http://arxiv.org/abs/2512.14531v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14531v1",
        "arxiv_id": "2512.14531v1",
        "authors": [
            "Ying Nie",
            "Kai Han",
            "Hongguang Li",
            "Hang Zhou",
            "Tianyu Guo",
            "Enhua Wu",
            "Xinghao Chen",
            "Yunhe Wang"
        ],
        "submitted": "2025-12-16 16:08:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Linguists should learn to love speech-based deep learning models",
        "abstract": "Futrell and Mahowald present a useful framework bridging technology-oriented deep learning systems and explanation-oriented linguistic theories. Unfortunately, the target article's focus on generative text-based LLMs fundamentally limits fruitful interactions with linguistics, as many interesting questions on human language fall outside what is captured by written text. We argue that audio-based deep learning models can and should play a crucial role.",
        "url": "http://arxiv.org/abs/2512.14506v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14506v1",
        "arxiv_id": "2512.14506v1",
        "authors": [
            "Marianne de Heer Kloots",
            "Paul Boersma",
            "Willem Zuidema"
        ],
        "submitted": "2025-12-16 15:42:22",
        "source": "arxiv",
        "comment": "Commentary on Futrell, R., & Mahowald, K. arXiv:2501.17047 (in press). How Linguistics Learned to Stop Worrying and Love the Language Models. Behavioural and Brain Sciences"
    },
    {
        "title": "RecGPT-V2 Technical Report",
        "abstract": "Large language models (LLMs) have demonstrated remarkable potential in transforming recommender systems from implicit behavioral pattern matching to explicit intent reasoning. While RecGPT-V1 successfully pioneered this paradigm by integrating LLM-based reasoning into user interest mining and item tag prediction, it suffers from four fundamental limitations: (1) computational inefficiency and cognitive redundancy across multiple reasoning routes; (2) insufficient explanation diversity in fixed-template generation; (3) limited generalization under supervised learning paradigms; and (4) simplistic outcome-focused evaluation that fails to match human standards.\n  To address these challenges, we present RecGPT-V2 with four key innovations. First, a Hierarchical Multi-Agent System restructures intent reasoning through coordinated collaboration, eliminating cognitive duplication while enabling diverse intent coverage. Combined with Hybrid Representation Inference that compresses user-behavior contexts, our framework reduces GPU consumption by 60% and improves exclusive recall from 9.39% to 10.99%. Second, a Meta-Prompting framework dynamically generates contextually adaptive prompts, improving explanation diversity by +7.3%. Third, constrained reinforcement learning mitigates multi-reward conflicts, achieving +24.1% improvement in tag prediction and +13.0% in explanation acceptance. Fourth, an Agent-as-a-Judge framework decomposes assessment into multi-step reasoning, improving human preference alignment. Online A/B tests on Taobao demonstrate significant improvements: +2.98% CTR, +3.71% IPV, +2.19% TV, and +11.46% NER. RecGPT-V2 establishes both the technical feasibility and commercial viability of deploying LLM-powered intent reasoning at scale, bridging the gap between cognitive exploration and industrial utility.",
        "url": "http://arxiv.org/abs/2512.14503v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14503v1",
        "arxiv_id": "2512.14503v1",
        "authors": [
            "Chao Yi",
            "Dian Chen",
            "Gaoyang Guo",
            "Jiakai Tang",
            "Jian Wu",
            "Jing Yu",
            "Mao Zhang",
            "Wen Chen",
            "Wenjun Yang",
            "Yujie Luo",
            "Yuning Jiang",
            "Zhujin Gao",
            "Bo Zheng",
            "Binbin Cao",
            "Changfa Wu",
            "Dixuan Wang",
            "Han Wu",
            "Haoyi Hu",
            "Kewei Zhu",
            "Lang Tian",
            "Lin Yang",
            "Qiqi Huang",
            "Siqi Yang",
            "Wenbo Su",
            "Xiaoxiao He",
            "Xin Tong",
            "Xu Chen",
            "Xunke Xi",
            "Xiaowei Huang",
            "Yaxuan Wu",
            "Yeqiu Yang",
            "Yi Hu",
            "Yujin Yuan",
            "Yuliang Yan",
            "Zile Zhou"
        ],
        "submitted": "2025-12-16 15:40:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "C-ing Clearly: Enhanced Binary Code Explanations using C code",
        "abstract": "Large Language Models (LLMs) typically excel at coding tasks involving high-level programming languages, as opposed to lower-level programming languages, such as assembly. We propose a synthetic data generation method named C-ing Clearly, which leverages the corresponding C code to enhance an LLM's understanding of assembly. By fine-tuning on data generated through our method, we demonstrate improved LLM performance for binary code summarization and vulnerability detection. Our approach demonstrates consistent gains across different LLM families and model sizes.",
        "url": "http://arxiv.org/abs/2512.14500v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14500v1",
        "arxiv_id": "2512.14500v1",
        "authors": [
            "Teodor Poncu",
            "Ioana Pintilie",
            "Marius Dragoi",
            "Dragos Tantaru",
            "Florin Brad"
        ],
        "submitted": "2025-12-16 15:36:29",
        "source": "arxiv",
        "comment": "18 pages, 5 figures"
    },
    {
        "title": "PushGen: Push Notifications Generation with LLM",
        "abstract": "We present PushGen, an automated framework for generating high-quality push notifications comparable to human-crafted content. With the rise of generative models, there is growing interest in leveraging LLMs for push content generation. Although LLMs make content generation straightforward and cost-effective, maintaining stylistic control and reliable quality assessment remains challenging, as both directly impact user engagement. To address these issues, PushGen combines two key components: (1) a controllable category prompt technique to guide LLM outputs toward desired styles, and (2) a reward model that ranks and selects generated candidates. Extensive offline and online experiments demonstrate its effectiveness, which has been deployed in large-scale industrial applications, serving hundreds of millions of users daily.",
        "url": "http://arxiv.org/abs/2512.14490v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14490v1",
        "arxiv_id": "2512.14490v1",
        "authors": [
            "Shifu Bie",
            "Jiangxia Cao",
            "Zixiao Luo",
            "Yichuan Zou",
            "Lei Liang",
            "Lu Zhang",
            "Linxun Chen",
            "Zhaojie Liu",
            "Xuanping Li",
            "Guorui Zhou",
            "Kaiqiao Zhan",
            "Kun Gai"
        ],
        "submitted": "2025-12-16 15:23:28",
        "source": "arxiv",
        "comment": "Accepted by WSDM 2026"
    },
    {
        "title": "SASQ: Static Activation Scaling for Quantization-Aware Training in Large Language Models",
        "abstract": "Large language models (LLMs) excel at natural language tasks but face deployment challenges due to their growing size outpacing GPU memory advancements. Model quantization mitigates this issue by lowering weight and activation precision, but existing solutions face fundamental trade-offs: dynamic quantization incurs high computational overhead and poses deployment challenges on edge devices, while static quantization sacrifices accuracy. Existing approaches of quantization-aware training (QAT) further suffer from weight training costs. We propose SASQ: a lightweight QAT framework specifically tailored for activation quantization factors. SASQ exclusively optimizes only the quantization factors (without changing pre-trained weights), enabling static inference with high accuracy while maintaining deployment efficiency. SASQ adaptively truncates some outliers, thereby reducing the difficulty of quantization while preserving the distributional characteristics of the activations. SASQ not only surpasses existing SOTA quantization schemes but also outperforms the corresponding FP16 models. On LLaMA2-7B, it achieves 5.2% lower perplexity than QuaRot and 4.7% lower perplexity than the FP16 model on WikiText2.",
        "url": "http://arxiv.org/abs/2512.14481v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14481v1",
        "arxiv_id": "2512.14481v1",
        "authors": [
            "Shizhuo Mao",
            "Song Chen",
            "Yi Kang"
        ],
        "submitted": "2025-12-16 15:12:34",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Effect of Document Packing on the Latent Multi-Hop Reasoning Capabilities of Large Language Models",
        "abstract": "The standard practice for training large language models involves packing multiple documents together to optimize computational efficiency. However, the impact of this process on the models' capabilities remains largely unexplored. To address this gap, we investigate how different document-packing strategies influence the latent multi-hop reasoning abilities of LLMs. Our findings indicate that packing can improve model performance compared to training on individual documents, at the expense of more compute. To further understand the underlying mechanisms, we conduct an ablation study, identifying key factors that explain the advantages of packing. Ultimately, our research deepens the understanding of LLM training dynamics and provides practical insights for optimizing model development.",
        "url": "http://arxiv.org/abs/2512.14427v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14427v1",
        "arxiv_id": "2512.14427v1",
        "authors": [
            "Gabriele Prato",
            "Shagun Sodhani",
            "Alessandro Sordoni",
            "Sarath Chandar"
        ],
        "submitted": "2025-12-16 14:16:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "RePo: Language Models with Context Re-Positioning",
        "abstract": "In-context learning is fundamental to modern Large Language Models (LLMs); however, prevailing architectures impose a rigid and fixed contextual structure by assigning linear or constant positional indices. Drawing on Cognitive Load Theory (CLT), we argue that this uninformative structure increases extraneous cognitive load, consuming finite working memory capacity that should be allocated to deep reasoning and attention allocation. To address this, we propose RePo, a novel mechanism that reduces extraneous load via context re-positioning. Unlike standard approaches, RePo utilizes a differentiable module, $f_φ$, to assign token positions that capture contextual dependencies, rather than replying on pre-defined integer range. By continually pre-training on the OLMo-2 1B backbone, we demonstrate that RePo significantly enhances performance on tasks involving noisy contexts, structured data, and longer context length, while maintaining competitive performance on general short-context tasks. Detailed analysis reveals that RePo successfully allocate higher attention to distant but relevant information, assign positions in dense and non-linear space, and capture the intrinsic structure of the input context. Our code is available at https://github.com/SakanaAI/repo.",
        "url": "http://arxiv.org/abs/2512.14391v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14391v1",
        "arxiv_id": "2512.14391v1",
        "authors": [
            "Huayang Li",
            "Tianyu Zhao",
            "Richard Sproat"
        ],
        "submitted": "2025-12-16 13:30:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Step-Tagging: Toward controlling the generation of Language Reasoning Models through step monitoring",
        "abstract": "The field of Language Reasoning Models (LRMs) has been very active over the past few years with advances in training and inference techniques enabling LRMs to reason longer, and more accurately. However, a growing body of studies show that LRMs are still inefficient, over-generating verification and reflection steps. To address this challenge, we introduce the Step-Tagging framework, a lightweight sentence-classifier enabling real-time annotation of the type of reasoning steps that an LRM is generating. To monitor reasoning behaviors, we introduced ReasonType: a novel taxonomy of reasoning steps. Building on this framework, we demonstrated that online monitoring of the count of specific steps can produce effective interpretable early stopping criteria of LRM inferences. We evaluate the Step-tagging framework on three open-source reasoning models across standard benchmark datasets: MATH500, GSM8K, AIME and non-mathematical tasks (GPQA and MMLU-Pro). We achieve 20 to 50\\% token reduction while maintaining comparable accuracy to standard generation, with largest gains observed on more computation-heavy tasks. This work offers a novel way to increase control over the generation of LRMs, and a new tool to study behaviors of LRMs.",
        "url": "http://arxiv.org/abs/2512.14332v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14332v1",
        "arxiv_id": "2512.14332v1",
        "authors": [
            "Yannis Belkhiter",
            "Seshu Tirupathi",
            "Giulio Zizzo",
            "John D. Kelleher"
        ],
        "submitted": "2025-12-16 12:01:16",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Dynamic Context Selection for Retrieval-Augmented Generation: Mitigating Distractors and Positional Bias",
        "abstract": "Retrieval Augmented Generation (RAG) enhances language model performance by incorporating external knowledge retrieved from large corpora, which makes it highly suitable for tasks such as open domain question answering. Standard RAG systems typically rely on a fixed top k retrieval strategy, which can either miss relevant information or introduce semantically irrelevant passages, known as distractors, that degrade output quality. Additionally, the positioning of retrieved passages within the input context can influence the model attention and generation outcomes. Context placed in the middle tends to be overlooked, which is an issue known as the \"lost in the middle\" phenomenon. In this work, we systematically analyze the impact of distractors on generation quality, and quantify their effects under varying conditions. We also investigate how the position of relevant passages within the context window affects their influence on generation. Building on these insights, we propose a context-size classifier that dynamically predicts the optimal number of documents to retrieve based on query-specific informational needs. We integrate this approach into a full RAG pipeline, and demonstrate improved performance over fixed k baselines.",
        "url": "http://arxiv.org/abs/2512.14313v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14313v1",
        "arxiv_id": "2512.14313v1",
        "authors": [
            "Malika Iratni",
            "Mohand Boughanem",
            "Taoufiq Dkaki"
        ],
        "submitted": "2025-12-16 11:30:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Inflation Attitudes of Large Language Models",
        "abstract": "This paper investigates the ability of Large Language Models (LLMs), specifically GPT-3.5-turbo (GPT), to form inflation perceptions and expectations based on macroeconomic price signals. We compare the LLM's output to household survey data and official statistics, mimicking the information set and demographic characteristics of the Bank of England's Inflation Attitudes Survey (IAS). Our quasi-experimental design exploits the timing of GPT's training cut-off in September 2021 which means it has no knowledge of the subsequent UK inflation surge. We find that GPT tracks aggregate survey projections and official statistics at short horizons. At a disaggregated level, GPT replicates key empirical regularities of households' inflation perceptions, particularly for income, housing tenure, and social class. A novel Shapley value decomposition of LLM outputs suited for the synthetic survey setting provides well-defined insights into the drivers of model outputs linked to prompt content. We find that GPT demonstrates a heightened sensitivity to food inflation information similar to that of human respondents. However, we also find that it lacks a consistent model of consumer price inflation. More generally, our approach could be used to evaluate the behaviour of LLMs for use in the social sciences, to compare different models, or to assist in survey design.",
        "url": "http://arxiv.org/abs/2512.14306v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14306v1",
        "arxiv_id": "2512.14306v1",
        "authors": [
            "Nikoleta Anesti",
            "Edward Hill",
            "Andreas Joseph"
        ],
        "submitted": "2025-12-16 11:21:46",
        "source": "arxiv",
        "comment": "41 pages, 11 figures"
    },
    {
        "title": "SPARQL-LLM: Real-Time SPARQL Query Generation from Natural Language Questions",
        "abstract": "The advent of large language models is contributing to the emergence of novel approaches that promise to better tackle the challenge of generating structured queries, such as SPARQL queries, from natural language. However, these new approaches mostly focus on response accuracy over a single source while ignoring other evaluation criteria, such as federated query capability over distributed data stores, as well as runtime and cost to generate SPARQL queries. Consequently, they are often not production-ready or easy to deploy over (potentially federated) knowledge graphs with good accuracy. To mitigate these issues, in this paper, we extend our previous work and describe and systematically evaluate SPARQL-LLM, an open-source and triplestore-agnostic approach, powered by lightweight metadata, that generates SPARQL queries from natural language text. First, we describe its architecture, which consists of dedicated components for metadata indexing, prompt building, and query generation and execution. Then, we evaluate it based on a state-of-the-art challenge with multilingual questions, and a collection of questions from three of the most prevalent knowledge graphs within the field of bioinformatics. Our results demonstrate a substantial increase of 24% in the F1 Score on the state-of-the-art challenge, adaptability to high-resource languages such as English and Spanish, as well as ability to form complex and federated bioinformatics queries. Furthermore, we show that SPARQL-LLM is up to 36x faster than other systems participating in the challenge, while costing a maximum of $0.01 per question, making it suitable for real-time, low-cost text-to-SPARQL applications. One such application deployed over real-world decentralized knowledge graphs can be found at https://www.expasy.org/chat.",
        "url": "http://arxiv.org/abs/2512.14277v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14277v1",
        "arxiv_id": "2512.14277v1",
        "authors": [
            "Panayiotis Smeros",
            "Vincent Emonet",
            "Ruijie Wang",
            "Ana-Claudia Sima",
            "Tarcisio Mendes de Farias"
        ],
        "submitted": "2025-12-16 10:39:46",
        "source": "arxiv",
        "comment": "17 pages, 8 figures, 1 table. Under Review"
    },
    {
        "title": "From Context to EDUs: Faithful and Structured Context Compression via Elementary Discourse Unit Decomposition",
        "abstract": "Managing extensive context remains a critical bottleneck for Large Language Models (LLMs), particularly in applications like long-document question answering and autonomous agents where lengthy inputs incur high computational costs and introduce noise. Existing compression techniques often disrupt local coherence through discrete token removal or rely on implicit latent encoding that suffers from positional bias and incompatibility with closed-source APIs. To address these limitations, we introduce the EDU-based Context Compressor, a novel explicit compression framework designed to preserve both global structure and fine-grained details. Our approach reformulates context compression as a structure-then-select process. First, our LingoEDU transforms linear text into a structural relation tree of Elementary Discourse Units (EDUs) which are anchored strictly to source indices to eliminate hallucination. Second, a lightweight ranking module selects query-relevant sub-trees for linearization. To rigorously evaluate structural understanding, we release StructBench, a manually annotated dataset of 248 diverse documents. Empirical results demonstrate that our method achieves state-of-the-art structural prediction accuracy and significantly outperforms frontier LLMs while reducing costs. Furthermore, our structure-aware compression substantially enhances performance across downstream tasks ranging from long-context tasks to complex Deep Search scenarios.",
        "url": "http://arxiv.org/abs/2512.14244v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14244v1",
        "arxiv_id": "2512.14244v1",
        "authors": [
            "Yiqing Zhou",
            "Yu Lei",
            "Shuzheng Si",
            "Qingyan Sun",
            "Wei Wang",
            "Yifei Wu",
            "Hao Wen",
            "Gang Chen",
            "Fanchao Qi",
            "Maosong Sun"
        ],
        "submitted": "2025-12-16 09:52:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Two CFG Nahuatl for automatic corpora expansion",
        "abstract": "The aim of this article is to introduce two Context-Free Grammars (CFG) for Nawatl Corpora expansion. Nawatl is an Amerindian language (it is a National Language of Mexico) of the $π$-language type, i.e. a language with few digital resources. For this reason the corpora available for the learning of Large Language Models (LLMs) are virtually non-existent, posing a significant challenge. The goal is to produce a substantial number of syntactically valid artificial Nawatl sentences and thereby to expand the corpora for the purpose of learning non contextual embeddings. For this objective, we introduce two new Nawatl CFGs and use them in generative mode. Using these grammars, it is possible to expand Nawatl corpus significantly and subsequently to use it to learn embeddings and to evaluate their relevance in a sentences semantic similarity task. The results show an improvement compared to the results obtained using only the original corpus without artificial expansion, and also demonstrate that economic embeddings often perform better than some LLMs.",
        "url": "http://arxiv.org/abs/2512.14239v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14239v1",
        "arxiv_id": "2512.14239v1",
        "authors": [
            "Juan-José Guzmán-Landa",
            "Juan-Manuel Torres-Moreno",
            "Miguel Figueroa-Saavedra",
            "Ligia Quintana-Torres",
            "Graham Ranger Martha-Lorena Avendaño-Garrido"
        ],
        "submitted": "2025-12-16 09:49:31",
        "source": "arxiv",
        "comment": "15 pages, 5 figures, 8 tables"
    },
    {
        "title": "Ladder Up, Memory Down: Low-Cost Fine-Tuning With Side Nets",
        "abstract": "Fine-tuning large language models (LLMs) is often limited by the memory available on commodity GPUs. Parameter-efficient fine-tuning (PEFT) methods such as QLoRA reduce the number of trainable parameters, yet still incur high memory usage induced by the backward pass in the full model. We revisit Ladder Side Tuning (LST), a rarely explored PEFT technique that adds a lightweight side network, and show that it matches QLoRA's compute scaling slope while cutting peak memory by 50\\%. Across different downstream benchmarks spanning natural language understanding, mathematical and LLM-critic tasks, LST has competitive performance with QLoRA's accuracy on average while being much more memory-efficient. This efficiency enables fine-tuning of 7B-parameter models on a single 12 GB consumer GPU with 2k-token contexts, requiring no gradient checkpointing\\textemdash conditions under which QLoRA exhausts memory. Beyond memory efficiency, we also establish scaling laws showing that LST scales similarly to QLoRA. We exploit Ladder's architectural flexibility by introducing xLadder, a depth-extended variant that increases effective depth via cross-connections and shortens chain-of-thought (CoT) at fixed parameter count. Ladder is strong when memory is the bottleneck; xLadder builds on this by enabling deeper reasoning without additional memory overhead.",
        "url": "http://arxiv.org/abs/2512.14237v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14237v1",
        "arxiv_id": "2512.14237v1",
        "authors": [
            "Estelle Zheng",
            "Nathan Cerisara",
            "Sébastien Warichet",
            "Emmanuel Helbert",
            "Christophe Cerisara"
        ],
        "submitted": "2025-12-16 09:47:34",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "A Comparative Analysis of Retrieval-Augmented Generation Techniques for Bengali Standard-to-Dialect Machine Translation Using LLMs",
        "abstract": "Translating from a standard language to its regional dialects is a significant NLP challenge due to scarce data and linguistic variation, a problem prominent in the Bengali language. This paper proposes and compares two novel RAG pipelines for standard-to-dialectal Bengali translation. The first, a Transcript-Based Pipeline, uses large dialect sentence contexts from audio transcripts. The second, a more effective Standardized Sentence-Pairs Pipeline, utilizes structured local\\_dialect:standard\\_bengali sentence pairs. We evaluated both pipelines across six Bengali dialects and multiple LLMs using BLEU, ChrF, WER, and BERTScore. Our findings show that the sentence-pair pipeline consistently outperforms the transcript-based one, reducing Word Error Rate (WER) from 76\\% to 55\\% for the Chittagong dialect. Critically, this RAG approach enables smaller models (e.g., Llama-3.1-8B) to outperform much larger models (e.g., GPT-OSS-120B), demonstrating that a well-designed retrieval strategy can be more crucial than model size. This work contributes an effective, fine-tuning-free solution for low-resource dialect translation, offering a practical blueprint for preserving linguistic diversity.",
        "url": "http://arxiv.org/abs/2512.14179v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14179v1",
        "arxiv_id": "2512.14179v1",
        "authors": [
            "K. M. Jubair Sami",
            "Dipto Sumit",
            "Ariyan Hossain",
            "Farig Sadeque"
        ],
        "submitted": "2025-12-16 08:18:18",
        "source": "arxiv",
        "comment": "Accepted to the Second Workshop on Bangla Language Processing (BLP) at IJCNLP-AACL 2025. 14 pages, 9 figures, 6 tables"
    },
    {
        "title": "Astraea: A State-Aware Scheduling Engine for LLM-Powered Agents",
        "abstract": "Large Language Models (LLMs) are increasingly being deployed as intelligent agents. Their multi-stage workflows, which alternate between local computation and calls to external network services like Web APIs, introduce a mismatch in their execution pattern and the scheduling granularity of existing inference systems such as vLLM. Existing systems typically focus on per-segment optimization which prevents them from minimizing the end-to-end latency of the complete agentic workflow, i.e., the global Job Completion Time (JCT) over the entire request lifecycle. To address this limitation, we propose Astraea, a service engine designed to shift the optimization from local segments to the global request lifecycle. Astraea employs a state-aware, hierarchical scheduling algorithm that integrates a request's historical state with future predictions. It dynamically classifies requests by their I/O and compute intensive nature and uses an enhanced HRRN policy to balance efficiency and fairness. Astraea also implements an adaptive KV cache manager that intelligently handles the agent state during I/O waits based on the system memory pressure. Extensive experiments show that Astraea reduces average JCT by up to 25.5\\% compared to baseline methods. Moreover, our approach demonstrates strong robustness and stability under high load across various model scales.",
        "url": "http://arxiv.org/abs/2512.14142v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14142v1",
        "arxiv_id": "2512.14142v1",
        "authors": [
            "Hongqiu Ni",
            "Jiabao Zhang",
            "Guopeng Li",
            "Zilong Wang",
            "Ruiqi Wu",
            "Chi Zhang",
            "Haisheng Tan"
        ],
        "submitted": "2025-12-16 06:55:10",
        "source": "arxiv",
        "comment": "12 pages, 8 figures"
    },
    {
        "title": "CogMem: A Cognitive Memory Architecture for Sustained Multi-Turn Reasoning in Large Language Models",
        "abstract": "Large language models (LLMs) excel at single-turn reasoning but often lose accuracy and coherence over extended, multi-turn interactions. Recent evaluations such as TurnBench highlight recurring failure modes-reasoning bias, task drift, hallucination, overconfidence, and memory decay. Current approaches typically append full conversational histories, causing unbounded context growth, higher computational costs, and degraded reasoning efficiency. We introduce CogMem, a cognitively inspired, memory-augmented LLM architecture that supports sustained iterative reasoning through structured, persistent memory. CogMem incorporates three layers: a Long-Term Memory (LTM) that consolidates cross-session reasoning strategies; a Direct Access (DA) memory that maintains session-level notes and retrieves relevant long-term memories; and a Focus of Attention (FoA) mechanism that dynamically reconstructs concise, task-relevant context at each turn. Experiments on TurnBench show that this layered design mitigates reasoning failures, controls context growth, and improves consistency across extended reasoning chains, moving toward more reliable, human-like reasoning in LLMs.",
        "url": "http://arxiv.org/abs/2512.14118v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14118v1",
        "arxiv_id": "2512.14118v1",
        "authors": [
            "Yiran Zhang",
            "Jincheng Hu",
            "Mark Dras",
            "Usman Naseem"
        ],
        "submitted": "2025-12-16 06:01:08",
        "source": "arxiv",
        "comment": "underreview"
    },
    {
        "title": "Neurosymbolic Inference On Foundation Models For Remote Sensing Text-to-image Retrieval With Complex Queries",
        "abstract": "Text-to-image retrieval in remote sensing (RS) has advanced rapidly with the rise of large vision-language models (LVLMs) tailored for aerial and satellite imagery, culminating in remote sensing large vision-language models (RS-LVLMS). However, limited explainability and poor handling of complex spatial relations remain key challenges for real-world use. To address these issues, we introduce RUNE (Reasoning Using Neurosymbolic Entities), an approach that combines Large Language Models (LLMs) with neurosymbolic AI to retrieve images by reasoning over the compatibility between detected entities and First-Order Logic (FOL) expressions derived from text queries. Unlike RS-LVLMs that rely on implicit joint embeddings, RUNE performs explicit reasoning, enhancing performance and interpretability. For scalability, we propose a logic decomposition strategy that operates on conditioned subsets of detected entities, guaranteeing shorter execution time compared to neural approaches. Rather than using foundation models for end-to-end retrieval, we leverage them only to generate FOL expressions, delegating reasoning to a neurosymbolic inference module. For evaluation we repurpose the DOTA dataset, originally designed for object detection, by augmenting it with more complex queries than in existing benchmarks. We show the LLM's effectiveness in text-to-logic translation and compare RUNE with state-of-the-art RS-LVLMs, demonstrating superior performance. We introduce two metrics, Retrieval Robustness to Query Complexity (RRQC) and Retrieval Robustness to Image Uncertainty (RRIU), which evaluate performance relative to query complexity and image uncertainty. RUNE outperforms joint-embedding models in complex RS retrieval tasks, offering gains in performance, robustness, and explainability. We show RUNE's potential for real-world RS applications through a use case on post-flood satellite image retrieval.",
        "url": "http://arxiv.org/abs/2512.14102v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14102v1",
        "arxiv_id": "2512.14102v1",
        "authors": [
            "Emanuele Mezzi",
            "Gertjan Burghouts",
            "Maarten Kruithof"
        ],
        "submitted": "2025-12-16 05:33:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Multilingual and Continuous Backchannel Prediction: A Cross-lingual Study",
        "abstract": "We present a multilingual, continuous backchannel prediction model for Japanese, English, and Chinese, and use it to investigate cross-linguistic timing behavior. The model is Transformer-based and operates at the frame level, jointly trained with auxiliary tasks on approximately 300 hours of dyadic conversations. Across all three languages, the multilingual model matches or surpasses monolingual baselines, indicating that it learns both language-universal cues and language-specific timing patterns. Zero-shot transfer with two-language training remains limited, underscoring substantive cross-lingual differences. Perturbation analyses reveal distinct cue usage: Japanese relies more on short-term linguistic information, whereas English and Chinese are more sensitive to silence duration and prosodic variation; multilingual training encourages shared yet adaptable representations and reduces overreliance on pitch in Chinese. A context-length study further shows that Japanese is relatively robust to shorter contexts, while Chinese benefits markedly from longer contexts. Finally, we integrate the trained model into a real-time processing software, demonstrating CPU-only inference. Together, these findings provide a unified model and empirical evidence for how backchannel timing differs across languages, informing the design of more natural, culturally-aware spoken dialogue systems.",
        "url": "http://arxiv.org/abs/2512.14085v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14085v1",
        "arxiv_id": "2512.14085v1",
        "authors": [
            "Koji Inoue",
            "Mikey Elmers",
            "Yahui Fu",
            "Zi Haur Pang",
            "Taiga Mori",
            "Divesh Lala",
            "Keiko Ochi",
            "Tatsuya Kawahara"
        ],
        "submitted": "2025-12-16 04:50:22",
        "source": "arxiv",
        "comment": "This paper has been accepted for presentation at International Workshop on Spoken Dialogue Systems Technology 2026 (IWSDS 2026) and represents the author's version of the work"
    },
    {
        "title": "Scalable Frameworks for Real-World Audio-Visual Speech Recognition",
        "abstract": "The practical deployment of Audio-Visual Speech Recognition (AVSR) systems is fundamentally challenged by significant performance degradation in real-world environments, characterized by unpredictable acoustic noise and visual interference. This dissertation posits that a systematic, hierarchical approach is essential to overcome these challenges, achieving the robust scalability at the representation, architecture, and system levels. At the representation level, we investigate methods for building a unified model that learns audio-visual features inherently robust to diverse real-world corruptions, thereby enabling generalization to new environments without specialized modules. To address architectural scalability, we explore how to efficiently expand model capacity while ensuring the adaptive and reliable use of multimodal inputs, developing a framework that intelligently allocates computational resources based on the input characteristics. Finally, at the system level, we present methods to expand the system's functionality through modular integration with large-scale foundation models, leveraging their powerful cognitive and generative capabilities to maximize final recognition accuracy. By systematically providing solutions at each of these three levels, this dissertation aims to build a next-generation, robust, and scalable AVSR system with high reliability in real-world applications.",
        "url": "http://arxiv.org/abs/2512.14083v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14083v1",
        "arxiv_id": "2512.14083v1",
        "authors": [
            "Sungnyun Kim"
        ],
        "submitted": "2025-12-16 04:50:13",
        "source": "arxiv",
        "comment": "PhD Dissertation"
    },
    {
        "title": "A Unified Sparse Attention via Multi-Granularity Compression",
        "abstract": "Efficient long-context understanding and reasoning are increasingly vital for large language model (LLM) applications such as multi-turn dialogue and program analysis. However, the core self-attention mechanism scales quadratically with sequence length, creating a fundamental computational bottleneck. Existing sparse attention methods alleviate this issue but face trade-offs: training-based methods are costly and cannot be directly applied as acceleration plugins for other models, while inference-time methods often compromise efficiency or cross-modal generality. To address these limitations, we present UniSparse, a unified mechanism that introduces the notion of composite tokens--compact representations that aggregate multi-granularity contextual information. Building on this abstraction, UniSparse dynamically constructs sparse attention through multi-granularity compression and block-level selection, enabling efficient and hardware-friendly execution on GPU. Across multiple modalities and tasks ranging from synthetic benchmarks to real-world applications, UniSparse consistently surpasses state-of-the-art sparse attention methods (e.g., MInference, XAttention, FlexPrefill) in both accuracy and efficiency, achieving $\\ge$ 99% of full-attention accuracy and up to 2.61$\\times$ faster attention computation than FlashAttention.",
        "url": "http://arxiv.org/abs/2512.14082v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14082v1",
        "arxiv_id": "2512.14082v1",
        "authors": [
            "Siran Liu",
            "Zane Cao",
            "Yongchao He"
        ],
        "submitted": "2025-12-16 04:42:31",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Grammar Search for Multi-Agent Systems",
        "abstract": "Automatic search for Multi-Agent Systems has recently emerged as a key focus in agentic AI research. Several prior approaches have relied on LLM-based free-form search over the code space. In this work, we propose a more structured framework that explores the same space through a fixed set of simple, composable components. We show that, despite lacking the generative flexibility of LLMs during the candidate generation stage, our method outperforms prior approaches on four out of five benchmarks across two domains: mathematics and question answering. Furthermore, our method offers additional advantages, including a more cost-efficient search process and the generation of modular, interpretable multi-agent systems with simpler logic.",
        "url": "http://arxiv.org/abs/2512.14079v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14079v1",
        "arxiv_id": "2512.14079v1",
        "authors": [
            "Mayank Singh",
            "Vikas Yadav",
            "Shiva Krishna Reddy Malay",
            "Shravan Nayak",
            "Sai Rajeswar",
            "Sathwik Tejaswi Madhusudhan",
            "Eduardo Blanco"
        ],
        "submitted": "2025-12-16 04:37:07",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Efficient-DLM: From Autoregressive to Diffusion Language Models, and Beyond in Speed",
        "abstract": "Diffusion language models (dLMs) have emerged as a promising paradigm that enables parallel, non-autoregressive generation, but their learning efficiency lags behind that of autoregressive (AR) language models when trained from scratch. To this end, we study AR-to-dLM conversion to transform pretrained AR models into efficient dLMs that excel in speed while preserving AR models' task accuracy. We achieve this by identifying limitations in the attention patterns and objectives of existing AR-to-dLM methods and then proposing principles and methodologies for more effective AR-to-dLM conversion. Specifically, we first systematically compare different attention patterns and find that maintaining pretrained AR weight distributions is critical for effective AR-to-dLM conversion. As such, we introduce a continuous pretraining scheme with a block-wise attention pattern, which remains causal across blocks while enabling bidirectional modeling within each block. We find that this approach can better preserve pretrained AR models' weight distributions than fully bidirectional modeling, in addition to its known benefit of enabling KV caching, and leads to a win-win in accuracy and efficiency. Second, to mitigate the training-test gap in mask token distributions (uniform vs. highly left-to-right), we propose a position-dependent token masking strategy that assigns higher masking probabilities to later tokens during training to better mimic test-time behavior. Leveraging this framework, we conduct extensive studies of dLMs' attention patterns, training dynamics, and other design choices, providing actionable insights into scalable AR-to-dLM conversion. These studies lead to the Efficient-DLM family, which outperforms state-of-the-art AR models and dLMs, e.g., our Efficient-DLM 8B achieves +5.4%/+2.7% higher accuracy with 4.5x/2.7x higher throughput compared to Dream 7B and Qwen3 4B, respectively.",
        "url": "http://arxiv.org/abs/2512.14067v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14067v1",
        "arxiv_id": "2512.14067v1",
        "authors": [
            "Yonggan Fu",
            "Lexington Whalen",
            "Zhifan Ye",
            "Xin Dong",
            "Shizhe Diao",
            "Jingyu Liu",
            "Chengyue Wu",
            "Hao Zhang",
            "Enze Xie",
            "Song Han",
            "Maksim Khadkevich",
            "Jan Kautz",
            "Yingyan Celine Lin",
            "Pavlo Molchanov"
        ],
        "submitted": "2025-12-16 04:12:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "What Affects the Effective Depth of Large Language Models?",
        "abstract": "The scaling of large language models (LLMs) emphasizes increasing depth, yet performance gains diminish with added layers. Prior work introduces the concept of \"effective depth\", arguing that deeper models fail to fully utilize their layers for meaningful computation. Building on this, we systematically study how effective depth varies with model scale, training type, and task difficulty. First, we analyze the model behavior of Qwen-2.5 family (1.5B-32B) and find that while the number of effective layers grows with model size, the effective depth ratio remains stable. Besides, comparisons between base and corresponding long-CoT models show no increase in effective depth, suggesting that improved reasoning stems from longer context rather than deeper per-token computation. Furthermore, evaluations across tasks of varying difficulty indicate that models do not dynamically use more layers for harder problems. Our results suggest that current LLMs underuse available depth across scales, training paradigms and tasks of varying difficulties, pointing out research opportunities on increasing the layer utilization rate of LLMs, model pruning, and early exiting. Our code is released at https://github.com/AheadOFpotato/what_affects_effective_depth.",
        "url": "http://arxiv.org/abs/2512.14064v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14064v1",
        "arxiv_id": "2512.14064v1",
        "authors": [
            "Yi Hu",
            "Cai Zhou",
            "Muhan Zhang"
        ],
        "submitted": "2025-12-16 04:07:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "HyperVL: An Efficient and Dynamic Multimodal Large Language Model for Edge Devices",
        "abstract": "Current multimodal large lanauge models possess strong perceptual and reasoning capabilities, however high computational and memory requirements make them difficult to deploy directly on on-device environments. While small-parameter models are progressively endowed with strong general capabilities, standard Vision Transformer (ViT) encoders remain a critical bottleneck, suffering from excessive latency and memory consumption when processing high-resolution inputs.To address these challenges, we introduce HyperVL, an efficient multimodal large language model tailored for on-device inference. HyperVL adopts an image-tiling strategy to cap peak memory usage and incorporates two novel techniques: (1) a Visual Resolution Compressor (VRC) that adaptively predicts optimal encoding resolutions to eliminate redundant computation, and (2) Dual Consistency Learning (DCL), which aligns multi-scale ViT encoders within a unified framework, enabling dynamic switching between visual branches under a shared LLM. Extensive experiments demonstrate that HyperVL achieves state-of-the-art performance among models of comparable size across multiple benchmarks. Furthermore, it significantly significantly reduces latency and power consumption on real mobile devices, demonstrating its practicality for on-device multimodal inference.",
        "url": "http://arxiv.org/abs/2512.14052v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14052v1",
        "arxiv_id": "2512.14052v1",
        "authors": [
            "HyperAI Team",
            "Yuchen Liu",
            "Kaiyang Han",
            "Zhiqiang Xia",
            "Yuhang Dong",
            "Chen Song",
            "Kangyu Tang",
            "Jiaming Xu",
            "Xiushi Feng",
            "WenXuan Yu",
            "Li Peng",
            "Mingyang Wang",
            "Kai Wang",
            "Changpeng Yang",
            "Yang Li",
            "Haoyu Lu",
            "Hao Wang",
            "Bingna Xu",
            "Guangyao Liu",
            "Long Huang",
            "Kaibin Guo",
            "Jinyang Wu",
            "Dan Wu",
            "Hongzhen Wang",
            "Peng Zhou",
            "Shuai Nie",
            "Shande Wang",
            "Runyu Shi",
            "Ying Huang"
        ],
        "submitted": "2025-12-16 03:36:41",
        "source": "arxiv",
        "comment": "Technical report of Xiaomi HyperAI Team"
    },
    {
        "title": "AsarRec: Adaptive Sequential Augmentation for Robust Self-supervised Sequential Recommendation",
        "abstract": "Sequential recommender systems have demonstrated strong capabilities in modeling users' dynamic preferences and capturing item transition patterns. However, real-world user behaviors are often noisy due to factors such as human errors, uncertainty, and behavioral ambiguity, which can lead to degraded recommendation performance. To address this issue, recent approaches widely adopt self-supervised learning (SSL), particularly contrastive learning, by generating perturbed views of user interaction sequences and maximizing their mutual information to improve model robustness. However, these methods heavily rely on their pre-defined static augmentation strategies~(where the augmentation type remains fixed once chosen) to construct augmented views, leading to two critical challenges: (1) the optimal augmentation type can vary significantly across different scenarios; (2) inappropriate augmentations may even degrade recommendation performance, limiting the effectiveness of SSL. To overcome these limitations, we propose an adaptive augmentation framework. We first unify existing basic augmentation operations into a unified formulation via structured transformation matrices. Building on this, we introduce AsarRec (Adaptive Sequential Augmentation for Robust Sequential Recommendation), which learns to generate transformation matrices by encoding user sequences into probabilistic transition matrices and projecting them into hard semi-doubly stochastic matrices via a differentiable Semi-Sinkhorn algorithm. To ensure that the learned augmentations benefit downstream performance, we jointly optimize three objectives: diversity, semantic invariance, and informativeness. Extensive experiments on three benchmark datasets under varying noise levels validate the effectiveness of AsarRec, demonstrating its superior robustness and consistent improvements.",
        "url": "http://arxiv.org/abs/2512.14047v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14047v1",
        "arxiv_id": "2512.14047v1",
        "authors": [
            "Kaike Zhang",
            "Qi Cao",
            "Fei Sun",
            "Xinran Liu"
        ],
        "submitted": "2025-12-16 03:29:11",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "From Feature Interaction to Feature Generation: A Generative Paradigm of CTR Prediction Models",
        "abstract": "Click-Through Rate (CTR) prediction, a core task in recommendation systems, aims to estimate the probability of users clicking on items. Existing models predominantly follow a discriminative paradigm, which relies heavily on explicit interactions between raw ID embeddings. However, this paradigm inherently renders them susceptible to two critical issues: embedding dimensional collapse and information redundancy, stemming from the over-reliance on feature interactions \\emph{over raw ID embeddings}. To address these limitations, we propose a novel \\emph{Supervised Feature Generation (SFG)} framework, \\emph{shifting the paradigm from discriminative ``feature interaction\" to generative ``feature generation\"}. Specifically, SFG comprises two key components: an \\emph{Encoder} that constructs hidden embeddings for each feature, and a \\emph{Decoder} tasked with regenerating the feature embeddings of all features from these hidden representations. Unlike existing generative approaches that adopt self-supervised losses, we introduce a supervised loss to utilize the supervised signal, \\ie, click or not, in the CTR prediction task. This framework exhibits strong generalizability: it can be seamlessly integrated with most existing CTR models, reformulating them under the generative paradigm. Extensive experiments demonstrate that SFG consistently mitigates embedding collapse and reduces information redundancy, while yielding substantial performance gains across various datasets and base models. The code is available at https://github.com/USTC-StarTeam/GE4Rec.",
        "url": "http://arxiv.org/abs/2512.14041v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14041v1",
        "arxiv_id": "2512.14041v1",
        "authors": [
            "Mingjia Yin",
            "Junwei Pan",
            "Hao Wang",
            "Ximei Wang",
            "Shangyu Zhang",
            "Jie Jiang",
            "Defu Lian",
            "Enhong Chen"
        ],
        "submitted": "2025-12-16 03:17:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DTRec: Learning Dynamic Reasoning Trajectories for Sequential Recommendation",
        "abstract": "Inspired by advances in LLMs, reasoning-enhanced sequential recommendation performs multi-step deliberation before making final predictions, unlocking greater potential for capturing user preferences. However, current methods are constrained by static reasoning trajectories that are ill-suited for the diverse complexity of user behaviors. They suffer from two key limitations: (1) a static reasoning direction, which uses flat supervision signals misaligned with human-like hierarchical reasoning, and (2) a fixed reasoning depth, which inefficiently applies the same computational effort to all users, regardless of pattern complexity. These rigidity lead to suboptimal performance and significant computational waste. To overcome these challenges, we propose DTRec, a novel and effective framework that explores the Dynamic reasoning Trajectory for Sequential Recommendation along both direction and depth. To guide the direction, we develop Hierarchical Process Supervision (HPS), which provides coarse-to-fine supervisory signals to emulate the natural, progressive refinement of human cognitive processes. To optimize the depth, we introduce the Adaptive Reasoning Halting (ARH) mechanism that dynamically adjusts the number of reasoning steps by jointly monitoring three indicators. Extensive experiments on three real-world datasets demonstrate the superiority of our approach, achieving up to a 24.5% performance improvement over strong baselines while simultaneously reducing computational cost by up to 41.6%.",
        "url": "http://arxiv.org/abs/2512.14036v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14036v1",
        "arxiv_id": "2512.14036v1",
        "authors": [
            "Yifan Shao",
            "Peilin Zhou",
            "Shoujin Wang",
            "Weizhi Zhang",
            "Xu Cai",
            "Sunghun Kim"
        ],
        "submitted": "2025-12-16 03:04:43",
        "source": "arxiv",
        "comment": "Under Review"
    },
    {
        "title": "Intent-Guided Reasoning for Sequential Recommendation",
        "abstract": "Sequential recommendation systems aim to capture users' evolving preferences from their interaction histories. Recent reasoningenhanced methods have shown promise by introducing deliberate, chain-of-thought-like processes with intermediate reasoning steps. However, these methods rely solely on the next target item as supervision, leading to two critical issues: (1) reasoning instability--the process becomes overly sensitive to recent behaviors and spurious interactions like accidental clicks, and (2) surface-level reasoning--the model memorizes item-to-item transitions rather than understanding intrinsic behavior patterns. To address these challenges, we propose IGR-SR, an Intent-Guided Reasoning framework for Sequential Recommendation that anchors the reasoning process to explicitly extracted high-level intents. Our framework comprises three key components: (1) a Latent Intent Distiller (LID) that efficiently extracts multi-faceted intents using a frozen encoder with learnable tokens, (2) an Intent-aware Deliberative Reasoner (IDR) that decouples reasoning into intent deliberation and decision-making via a dual-attention architecture, and (3) an Intent Consistency Regularization (ICR) that ensures robustness by enforcing consistent representations across different intent views. Extensive experiments on three public datasets demonstrate that IGR-SR achieves an average 7.13% improvement over state-of-the-art baselines. Critically, under 20% behavioral noise, IGR-SR degrades only 10.4% compared to 16.2% and 18.6% for competing methods, validating the effectiveness and robustness of intent-guided reasoning.",
        "url": "http://arxiv.org/abs/2512.14034v1",
        "pdf_url": "https://arxiv.org/pdf/2512.14034v1",
        "arxiv_id": "2512.14034v1",
        "authors": [
            "Yifan Shao",
            "Peilin Zhou"
        ],
        "submitted": "2025-12-16 03:00:32",
        "source": "arxiv",
        "comment": "Under Review"
    },
    {
        "title": "Structure-Aware Decoding Mechanisms for Complex Entity Extraction with Large-Scale Language Models",
        "abstract": "This paper proposes a structure-aware decoding method based on large language models to address the difficulty of traditional approaches in maintaining both semantic integrity and structural consistency in nested and overlapping entity extraction tasks. The method introduces a candidate span generation mechanism and structured attention modeling to achieve unified modeling of entity boundaries, hierarchical relationships, and cross-dependencies. The model first uses a pretrained language model to obtain context-aware semantic representations, then captures multi-granular entity span features through candidate representation combinations, and introduces hierarchical structural constraints during decoding to ensure consistency between semantics and structure. To enhance stability in complex scenarios, the model jointly optimizes classification loss and structural consistency loss, maintaining high recognition accuracy under multi-entity co-occurrence and long-sentence dependency conditions. Experiments conducted on the ACE 2005 dataset demonstrate significant improvements in Accuracy, Precision, Recall, and F1-Score, particularly in nested and overlapping entity recognition, where the model shows stronger boundary localization and structural modeling capability. This study verifies the effectiveness of structure-aware decoding in complex semantic extraction tasks, provides a new perspective for developing language models with hierarchical understanding, and establishes a methodological foundation for high-precision information extraction.",
        "url": "http://arxiv.org/abs/2512.13980v1",
        "pdf_url": "https://arxiv.org/pdf/2512.13980v1",
        "arxiv_id": "2512.13980v1",
        "authors": [
            "Zhimin Qiu",
            "Di Wu",
            "Feng Liu",
            "Chenrui Hu",
            "Yuxiao Wang"
        ],
        "submitted": "2025-12-16 00:40:06",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Olmo 3",
        "abstract": "We introduce Olmo 3, a family of state-of-the-art, fully-open language models at the 7B and 32B parameter scales. Olmo 3 model construction targets long-context reasoning, function calling, coding, instruction following, general chat, and knowledge recall. This release includes the entire model flow, i.e., the full lifecycle of the family of models, including every stage, checkpoint, data point, and dependency used to build it. Our flagship model, Olmo 3 Think 32B, is the strongest fully-open thinking model released to-date.",
        "url": "http://arxiv.org/abs/2512.13961v1",
        "pdf_url": "https://arxiv.org/pdf/2512.13961v1",
        "arxiv_id": "2512.13961v1",
        "authors": [
            "Team Olmo",
            ":",
            "Allyson Ettinger",
            "Amanda Bertsch",
            "Bailey Kuehl",
            "David Graham",
            "David Heineman",
            "Dirk Groeneveld",
            "Faeze Brahman",
            "Finbarr Timbers",
            "Hamish Ivison",
            "Jacob Morrison",
            "Jake Poznanski",
            "Kyle Lo",
            "Luca Soldaini",
            "Matt Jordan",
            "Mayee Chen",
            "Michael Noukhovitch",
            "Nathan Lambert",
            "Pete Walsh",
            "Pradeep Dasigi",
            "Robert Berry",
            "Saumya Malik",
            "Saurabh Shah",
            "Scott Geng",
            "Shane Arora",
            "Shashank Gupta",
            "Taira Anderson",
            "Teng Xiao",
            "Tyler Murray",
            "Tyler Romero",
            "Victoria Graf",
            "Akari Asai",
            "Akshita Bhagia",
            "Alexander Wettig",
            "Alisa Liu",
            "Aman Rangapur",
            "Chloe Anastasiades",
            "Costa Huang",
            "Dustin Schwenk",
            "Harsh Trivedi",
            "Ian Magnusson",
            "Jaron Lochner",
            "Jiacheng Liu",
            "Lester James V. Miranda",
            "Maarten Sap",
            "Malia Morgan",
            "Michael Schmitz",
            "Michal Guerquin",
            "Michael Wilson",
            "Regan Huff",
            "Ronan Le Bras",
            "Rui Xin",
            "Rulin Shao",
            "Sam Skjonsberg",
            "Shannon Zejiang Shen",
            "Shuyue Stella Li",
            "Tucker Wilde",
            "Valentina Pyatkin",
            "Will Merrill",
            "Yapei Chang",
            "Yuling Gu",
            "Zhiyuan Zeng",
            "Ashish Sabharwal",
            "Luke Zettlemoyer",
            "Pang Wei Koh",
            "Ali Farhadi",
            "Noah A. Smith",
            "Hannaneh Hajishirzi"
        ],
        "submitted": "2025-12-15 23:41:48",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Hierarchical Multi-agent Large Language Model Reasoning for Autonomous Functional Materials Discovery",
        "abstract": "Artificial intelligence is reshaping scientific exploration, but most methods automate procedural tasks without engaging in scientific reasoning, limiting autonomy in discovery. We introduce Materials Agents for Simulation and Theory in Electronic-structure Reasoning (MASTER), an active learning framework where large language models autonomously design, execute, and interpret atomistic simulations. In MASTER, a multimodal system translates natural language into density functional theory workflows, while higher-level reasoning agents guide discovery through a hierarchy of strategies, including a single agent baseline and three multi-agent approaches: peer review, triage-ranking, and triage-forms. Across two chemical applications, CO adsorption on Cu-surface transition metal (M) adatoms and on M-N-C catalysts, reasoning-driven exploration reduces required atomistic simulations by up to 90% relative to trial-and-error selection. Reasoning trajectories reveal chemically grounded decisions that cannot be explained by stochastic sampling or semantic bias. Altogether, multi-agent collaboration accelerates materials discovery and marks a new paradigm for autonomous scientific exploration.",
        "url": "http://arxiv.org/abs/2512.13930v1",
        "pdf_url": "https://arxiv.org/pdf/2512.13930v1",
        "arxiv_id": "2512.13930v1",
        "authors": [
            "Samuel Rothfarb",
            "Megan C. Davis",
            "Ivana Matanovic",
            "Baikun Li",
            "Edward F. Holby",
            "Wilton J. M. Kort-Kamp"
        ],
        "submitted": "2025-12-15 22:08:18",
        "source": "arxiv",
        "comment": "Keywords: Multi-agent reasoning; Large language models; Active learning; AI-driven simulation; Materials discovery; Density functional theory; Surface chemistry"
    },
    {
        "title": "Generative AI for Video Translation: A Scalable Architecture for Multilingual Video Conferencing",
        "abstract": "The real-time deployment of cascaded generative AI pipelines for applications like video translation is constrained by significant system-level challenges. These include the cumulative latency of sequential model inference and the quadratic ($\\mathcal{O}(N^2)$) computational complexity that renders multi-user video conferencing applications unscalable. This paper proposes and evaluates a practical system-level framework designed to mitigate these critical bottlenecks. The proposed architecture incorporates a turn-taking mechanism to reduce computational complexity from quadratic to linear in multi-user scenarios, and a segmented processing protocol to manage inference latency for a perceptually real-time experience. We implement a proof-of-concept pipeline and conduct a rigorous performance analysis across a multi-tiered hardware setup, including commodity (NVIDIA RTX 4060), cloud (NVIDIA T4), and enterprise (NVIDIA A100) GPUs. Our objective evaluation demonstrates that the system achieves real-time throughput ($τ< 1.0$) on modern hardware. A subjective user study further validates the approach, showing that a predictable, initial processing delay is highly acceptable to users in exchange for a smooth, uninterrupted playback experience. The work presents a validated, end-to-end system design that offers a practical roadmap for deploying scalable, real-time generative AI applications in multilingual communication platforms.",
        "url": "http://arxiv.org/abs/2512.13904v1",
        "pdf_url": "https://arxiv.org/pdf/2512.13904v1",
        "arxiv_id": "2512.13904v1",
        "authors": [
            "Amirkia Rafiei Oskooei",
            "Eren Caglar",
            "Ibrahim Sahin",
            "Ayse Kayabay",
            "Mehmet S. Aktas"
        ],
        "submitted": "2025-12-15 21:21:09",
        "source": "arxiv",
        "comment": "Accepted manuscript. Published in Applied Sciences, 2025"
    },
    {
        "title": "Let's (not) just put things in Context: Test-Time Training for Long-Context LLMs",
        "abstract": "Progress on training and architecture strategies has enabled LLMs with millions of tokens in context length. However, empirical evidence suggests that such long-context LLMs can consume far more text than they can reliably use. On the other hand, it has been shown that inference-time compute can be used to scale performance of LLMs, often by generating thinking tokens, on challenging tasks involving multi-step reasoning. Through controlled experiments on sandbox long-context tasks, we find that such inference-time strategies show rapidly diminishing returns and fail at long context. We attribute these failures to score dilution, a phenomenon inherent to static self-attention. Further, we show that current inference-time strategies cannot retrieve relevant long-context signals under certain conditions. We propose a simple method that, through targeted gradient updates on the given context, provably overcomes limitations of static self-attention. We find that this shift in how inference-time compute is spent leads to consistently large performance improvements across models and long-context benchmarks. Our method leads to large 12.6 and 14.1 percentage point improvements for Qwen3-4B on average across subsets of LongBench-v2 and ZeroScrolls benchmarks. The takeaway is practical: for long context, a small amount of context-specific training is a better use of inference compute than current inference-time scaling strategies like producing more thinking tokens.",
        "url": "http://arxiv.org/abs/2512.13898v1",
        "pdf_url": "https://arxiv.org/pdf/2512.13898v1",
        "arxiv_id": "2512.13898v1",
        "authors": [
            "Rachit Bansal",
            "Aston Zhang",
            "Rishabh Tiwari",
            "Lovish Madaan",
            "Sai Surya Duvvuri",
            "Devvrit Khatri",
            "David Brandfonbrener",
            "David Alvarez-Melis",
            "Prajjwal Bhargava",
            "Mihir Sanjay Kale",
            "Samy Jelassi"
        ],
        "submitted": "2025-12-15 21:01:37",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "FiNERweb: Datasets and Artifacts for Scalable Multilingual Named Entity Recognition",
        "abstract": "Recent multilingual named entity recognition (NER) work has shown that large language models (LLMs) can provide effective synthetic supervision, yet such datasets have mostly appeared as by-products of broader experiments rather than as systematic, reusable resources. We introduce FiNERweb, a dataset-creation pipeline that scales the teacher-student paradigm to 91 languages and 25 scripts. Building on FineWeb-Edu, our approach trains regression models to identify NER-relevant passages and annotates them with multilingual LLMs, resulting in about 225k passages with 235k distinct entity labels. Our experiments show that the regression model achieves more than 84 F1, and that models trained on FiNERweb obtain comparable or improved performance in zero shot transfer settings on English, Thai, and Swahili, despite being trained on 19x less data than strong baselines. In addition, we assess annotation quality using LLM-as-a-judge and observe consistently high scores for both faithfulness (3.99 out of 5) and completeness (4.05 out of 5), indicating reliable and informative annotations. Further, we release the dataset with both English labels and translated label sets in the respective target languages because we observe that the performance of current state-of-the-art models drops by 0.02 to 0.09 F1 when evaluated using target language labels instead of English ones. We release FiNERweb together with all accompanying artifacts to the research community in order to facilitate more effective student-teacher training for multilingual named entity recognition.",
        "url": "http://arxiv.org/abs/2512.13884v1",
        "pdf_url": "https://arxiv.org/pdf/2512.13884v1",
        "arxiv_id": "2512.13884v1",
        "authors": [
            "Jonas Golde",
            "Patrick Haller",
            "Alan Akbik"
        ],
        "submitted": "2025-12-15 20:36:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "EvoLattice: Persistent Internal-Population Evolution through Multi-Alternative Quality-Diversity Graph Representations for LLM-Guided Program Discovery",
        "abstract": "Large language models (LLMs) are increasingly used to evolve programs and multi-agent systems, yet most existing approaches rely on overwrite-based mutations that maintain only a single candidate at a time. Such methods discard useful variants, suffer from destructive edits, and explore a brittle search space prone to structural failure. We introduce EvoLattice, a framework that represents an entire population of candidate programs or agent behaviors within a single directed acyclic graph. Each node stores multiple persistent alternatives, and every valid path through the graph defines a distinct executable candidate, yielding a large combinatorial search space without duplicating structure. EvoLattice enables fine-grained alternative-level evaluation by scoring each alternative across all paths in which it appears, producing statistics that reveal how local design choices affect global performance. These statistics provide a dense, data-driven feedback signal for LLM-guided mutation, recombination, and pruning, while preserving successful components. Structural correctness is guaranteed by a deterministic self-repair mechanism that enforces acyclicity and dependency consistency independently of the LLM. EvoLattice naturally extends to agent evolution by interpreting alternatives as prompt fragments or sub-agent behaviors. Across program synthesis (proxy and optimizer meta-learning), EvoLattice yields more stable evolution, greater expressivity, and stronger improvement trajectories than prior LLM-guided methods. The resulting dynamics resemble quality-diversity optimization, emerging implicitly from EvoLattice's internal multi-alternative representation rather than an explicit external archive.",
        "url": "http://arxiv.org/abs/2512.13857v2",
        "pdf_url": "https://arxiv.org/pdf/2512.13857v2",
        "arxiv_id": "2512.13857v2",
        "authors": [
            "Kamer Ali Yuksel"
        ],
        "submitted": "2025-12-15 19:43:06",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "BiCoRec: Bias-Mitigated Context-Aware Sequential Recommendation Model",
        "abstract": "Sequential recommendation models aim to learn from users evolving preferences. However, current state-of-the-art models suffer from an inherent popularity bias. This study developed a novel framework, BiCoRec, that adaptively accommodates users changing preferences for popular and niche items. Our approach leverages a co-attention mechanism to obtain a popularity-weighted user sequence representation, facilitating more accurate predictions. We then present a new training scheme that learns from future preferences using a consistency loss function. BiCoRec aimed to improve the recommendation performance of users who preferred niche items. For these users, BiCoRec achieves a 26.00% average improvement in NDCG@10 over state-of-the-art baselines. When ranking the relevant item against the entire collection, BiCoRec achieves NDCG@10 scores of 0.0102, 0.0047, 0.0021, and 0.0005 for the Movies, Fashion, Games and Music datasets.",
        "url": "http://arxiv.org/abs/2512.13848v1",
        "pdf_url": "https://arxiv.org/pdf/2512.13848v1",
        "arxiv_id": "2512.13848v1",
        "authors": [
            "Mufhumudzi Muthivhi",
            "Terence L van Zyl",
            "Hairong Wang"
        ],
        "submitted": "2025-12-15 19:34:23",
        "source": "arxiv",
        "comment": null
    }
]