[
    {
        "title": "NeuralOS: Towards Simulating Operating Systems via Neural Generative Models",
        "abstract": "We introduce NeuralOS, a neural framework that simulates graphical user\ninterfaces (GUIs) of operating systems by directly predicting screen frames in\nresponse to user inputs such as mouse movements, clicks, and keyboard events.\nNeuralOS combines a recurrent neural network (RNN), which tracks computer\nstate, with a diffusion-based neural renderer that generates screen images. The\nmodel is trained on a large-scale dataset of Ubuntu XFCE recordings, which\ninclude both randomly generated interactions and realistic interactions\nproduced by AI agents. Experiments show that NeuralOS successfully renders\nrealistic GUI sequences, accurately captures mouse interactions, and reliably\npredicts state transitions like application launches. Although modeling\nfine-grained keyboard interactions precisely remains challenging, NeuralOS\noffers a step toward creating fully adaptive, generative neural interfaces for\nfuture human-computer interaction systems.",
        "url": "http://arxiv.org/abs/2507.08800v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08800v1",
        "arxiv_id": "2507.08800v1",
        "authors": [
            "Luke Rivard",
            "Sun Sun",
            "Hongyu Guo",
            "Wenhu Chen",
            "Yuntian Deng"
        ],
        "submitted": "2025-07-11 17:59:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "KV Cache Steering for Inducing Reasoning in Small Language Models",
        "abstract": "We propose cache steering, a lightweight method for implicit steering of\nlanguage models via a one-shot intervention applied directly to the key-value\ncache. To validate its effectiveness, we apply cache steering to induce\nchain-of-thought reasoning in small language models. Our approach leverages\nGPT-4o-generated reasoning traces to construct steering vectors that shift\nmodel behavior toward more explicit, multi-step reasoning without fine-tuning\nor prompt modifications. Experimental evaluations on diverse reasoning\nbenchmarks demonstrate that cache steering improves both the qualitative\nstructure of model reasoning and quantitative task performance. Compared to\nprior activation steering techniques that require continuous interventions, our\none-shot cache steering offers substantial advantages in terms of\nhyperparameter stability, inference-time efficiency, and ease of integration,\nmaking it a more robust and practical solution for controlled generation.",
        "url": "http://arxiv.org/abs/2507.08799v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08799v1",
        "arxiv_id": "2507.08799v1",
        "authors": [
            "Max Belitsky",
            "Dawid J. Kopiczko",
            "Michael Dorkenwald",
            "M. Jehanzeb Mirza",
            "Cees G. M. Snoek",
            "Yuki M. Asano"
        ],
        "submitted": "2025-07-11 17:59:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "One Token to Fool LLM-as-a-Judge",
        "abstract": "Generative reward models (also known as LLMs-as-judges), which use large\nlanguage models (LLMs) to evaluate answer quality, are increasingly adopted in\nreinforcement learning with verifiable rewards (RLVR). They are often preferred\nover rigid rule-based metrics, especially for complex reasoning tasks involving\nfree-form outputs. In this paradigm, an LLM is typically prompted to compare a\ncandidate answer against a ground-truth reference and assign a binary reward\nindicating correctness. Despite the seeming simplicity of this comparison task,\nwe find that generative reward models exhibit surprising vulnerabilities to\nsuperficial manipulations: non-word symbols (e.g., \":\" or \".\") or reasoning\nopeners like \"Thought process:\" and \"Let's solve this problem step by step.\"\ncan often lead to false positive rewards. We demonstrate that this weakness is\nwidespread across LLMs, datasets, and prompt formats, posing a serious threat\nfor core algorithmic paradigms that rely on generative reward models, such as\nrejection sampling, preference optimization, and RLVR. To mitigate this issue,\nwe introduce a simple yet effective data augmentation strategy and train a new\ngenerative reward model with substantially improved robustness. Our findings\nhighlight the urgent need for more reliable LLM-based evaluation methods. We\nrelease our robust, general-domain reward model and its synthetic training data\nat https://huggingface.co/sarosavo/Master-RM and\nhttps://huggingface.co/datasets/sarosavo/Master-RM.",
        "url": "http://arxiv.org/abs/2507.08794v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08794v1",
        "arxiv_id": "2507.08794v1",
        "authors": [
            "Yulai Zhao",
            "Haolin Liu",
            "Dian Yu",
            "S. Y. Kung",
            "Haitao Mi",
            "Dong Yu"
        ],
        "submitted": "2025-07-11 17:55:22",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "BlockFFN: Towards End-Side Acceleration-Friendly Mixture-of-Experts with Chunk-Level Activation Sparsity",
        "abstract": "To alleviate the computational burden of large language models (LLMs),\narchitectures with activation sparsity, represented by mixture-of-experts\n(MoE), have attracted increasing attention. However, the non-differentiable and\ninflexible routing of vanilla MoE hurts model performance. Moreover, while each\ntoken activates only a few parameters, these sparsely-activated architectures\nexhibit low chunk-level sparsity, indicating that the union of multiple\nconsecutive tokens activates a large ratio of parameters. Such a sparsity\npattern is unfriendly for acceleration under low-resource conditions (e.g.,\nend-side devices) and incompatible with mainstream acceleration techniques\n(e.g., speculative decoding). To address these challenges, we introduce a novel\nMoE architecture, BlockFFN, as well as its efficient training and deployment\ntechniques. Specifically, we use a router integrating ReLU activation and\nRMSNorm for differentiable and flexible routing. Next, to promote both\ntoken-level sparsity (TLS) and chunk-level sparsity (CLS), CLS-aware training\nobjectives are designed, making BlockFFN more acceleration-friendly. Finally,\nwe implement efficient acceleration kernels, combining activation sparsity and\nspeculative decoding for the first time. The experimental results demonstrate\nthe superior performance of BlockFFN over other MoE baselines, achieving over\n80% TLS and 70% 8-token CLS. Our kernels achieve up to 3.67$\\times$ speedup on\nreal end-side devices than dense models. All codes and checkpoints are\navailable publicly (https://github.com/thunlp/BlockFFN).",
        "url": "http://arxiv.org/abs/2507.08771v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08771v1",
        "arxiv_id": "2507.08771v1",
        "authors": [
            "Chenyang Song",
            "Weilin Zhao",
            "Xu Han",
            "Chaojun Xiao",
            "Yingfa Chen",
            "Yuxuan Li",
            "Zhiyuan Liu",
            "Maosong Sun"
        ],
        "submitted": "2025-07-11 17:28:56",
        "source": "arxiv",
        "comment": "21 pages, 7 figures, 15 tables"
    },
    {
        "title": "On Barriers to Archival Audio Processing",
        "abstract": "In this study, we leverage a unique UNESCO collection of mid-20th century\nradio recordings to probe the robustness of modern off-the-shelf language\nidentification (LID) and speaker recognition (SR) methods, especially with\nrespect to the impact of multilingual speakers and cross-age recordings. Our\nfindings suggest that LID systems, such as Whisper, are increasingly adept at\nhandling second-language and accented speech. However, speaker embeddings\nremain a fragile component of speech processing pipelines that is prone to\nbiases related to the channel, age, and language. Issues which will need to be\novercome should archives aim to employ SR methods for speaker indexing.",
        "url": "http://arxiv.org/abs/2507.08768v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08768v1",
        "arxiv_id": "2507.08768v1",
        "authors": [
            "Peter Sullivan",
            "Muhammad Abdul-Mageed"
        ],
        "submitted": "2025-07-11 17:27:11",
        "source": "arxiv",
        "comment": "Update with Acknowledgements of ICNSLP 2025 paper"
    },
    {
        "title": "Multilingual Multimodal Software Developer for Code Generation",
        "abstract": "The rapid advancement of Large Language Models (LLMs) has significantly\nimproved code generation, yet most models remain text-only, neglecting crucial\nvisual aids like diagrams and flowcharts used in real-world software\ndevelopment. To bridge this gap, we introduce MM-Coder, a Multilingual\nMultimodal software developer. MM-Coder integrates visual design inputs-Unified\nModeling Language (UML) diagrams and flowcharts (termed Visual Workflow)-with\ntextual instructions to enhance code generation accuracy and architectural\nalignment. To enable this, we developed MMc-Instruct, a diverse multimodal\ninstruction-tuning dataset including visual-workflow-based code generation,\nallowing MM-Coder to synthesize textual and graphical information like human\ndevelopers, distinct from prior work on narrow tasks. Furthermore, we introduce\nMMEval, a new benchmark for evaluating multimodal code generation, addressing\nexisting text-only limitations. Our evaluations using MMEval highlight\nsignificant remaining challenges for models in precise visual information\ncapture, instruction following, and advanced programming knowledge. Our work\naims to revolutionize industrial programming by enabling LLMs to interpret and\nimplement complex specifications conveyed through both text and visual designs.",
        "url": "http://arxiv.org/abs/2507.08719v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08719v1",
        "arxiv_id": "2507.08719v1",
        "authors": [
            "Linzheng Chai",
            "Jian Yang",
            "Shukai Liu",
            "Wei Zhang",
            "Liran Wang",
            "Ke Jin",
            "Tao Sun",
            "Congnan Liu",
            "Chenchen Zhang",
            "Hualei Zhu",
            "Jiaheng Liu",
            "Xianjie Wu",
            "Ge Zhang",
            "Tianyu Liu",
            "Zhoujun Li"
        ],
        "submitted": "2025-07-11 16:19:53",
        "source": "arxiv",
        "comment": "Preprint"
    },
    {
        "title": "KG-Attention: Knowledge Graph-Guided Attention at Test-Time via Bidirectional Information Aggregation",
        "abstract": "Knowledge graphs (KGs) play a critical role in enhancing large language\nmodels (LLMs) by introducing structured and grounded knowledge into the\nlearning process. However, most existing KG-enhanced approaches rely on\nparameter-intensive fine-tuning, which risks catastrophic forgetting and\ndegrades the pretrained model's generalization. Moreover, they exhibit limited\nadaptability to real-time knowledge updates due to their static integration\nframeworks. To address these issues, we introduce the first test-time\nKG-augmented framework for LLMs, built around a dedicated knowledge\ngraph-guided attention (KGA) module that enables dynamic knowledge fusion\nwithout any parameter updates. The proposed KGA module augments the standard\nself-attention mechanism with two synergistic pathways: outward and inward\naggregation. Specifically, the outward pathway dynamically integrates external\nknowledge into input representations via input-driven KG fusion. This inward\naggregation complements the outward pathway by refining input representations\nthrough KG-guided filtering, suppressing task-irrelevant signals and amplifying\nknowledge-relevant patterns. Importantly, while the outward pathway handles\nknowledge fusion, the inward path selects the most relevant triples and feeds\nthem back into the fusion process, forming a closed-loop enhancement mechanism.\nBy synergistically combining these two pathways, the proposed method supports\nreal-time knowledge fusion exclusively at test-time, without any parameter\nmodification. Extensive experiments on five benchmarks verify the comparable\nknowledge fusion performance of KGA.",
        "url": "http://arxiv.org/abs/2507.08704v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08704v1",
        "arxiv_id": "2507.08704v1",
        "authors": [
            "Songlin Zhai",
            "Guilin Qi",
            "Yuan Meng"
        ],
        "submitted": "2025-07-11 15:57:37",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "KELPS: A Framework for Verified Multi-Language Autoformalization via Semantic-Syntactic Alignment",
        "abstract": "Modern large language models (LLMs) show promising progress in formalizing\ninformal mathematics into machine-verifiable theorems. However, these methods\nstill face bottlenecks due to the limited quantity and quality of multilingual\nparallel corpora. In this paper, we propose a novel neuro-symbolic framework\nKELPS (Knowledge-Equation based Logical Processing System) to address these\nproblems. KELPS is an iterative framework for translating, synthesizing, and\nfiltering informal data into multiple formal languages (Lean, Coq, and\nIsabelle). First, we translate natural language into Knowledge Equations (KEs),\na novel language that we designed, theoretically grounded in assertional logic.\nNext, we convert them to target languages through rigorously defined rules that\npreserve both syntactic structure and semantic meaning. This process yielded a\nparallel corpus of over 60,000 problems. Our framework achieves 88.9% syntactic\naccuracy (pass@1) on MiniF2F, outperforming SOTA models such as Deepseek-V3\n(81%) and Herald (81.3%) across multiple datasets. All datasets and codes are\navailable in the supplementary materials.",
        "url": "http://arxiv.org/abs/2507.08665v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08665v1",
        "arxiv_id": "2507.08665v1",
        "authors": [
            "Jiyao Zhang",
            "Chengli Zhong",
            "Hui Xu",
            "Qige Li",
            "Yi Zhou"
        ],
        "submitted": "2025-07-11 15:05:06",
        "source": "arxiv",
        "comment": "Accepted by the ICML 2025 AI4MATH Workshop. 22 pages, 16 figures, 2\n  tables"
    },
    {
        "title": "The Impact of Automatic Speech Transcription on Speaker Attribution",
        "abstract": "Speaker attribution from speech transcripts is the task of identifying a\nspeaker from the transcript of their speech based on patterns in their language\nuse. This task is especially useful when the audio is unavailable (e.g.\ndeleted) or unreliable (e.g. anonymized speech). Prior work in this area has\nprimarily focused on the feasibility of attributing speakers using transcripts\nproduced by human annotators. However, in real-world settings, one often only\nhas more errorful transcripts produced by automatic speech recognition (ASR)\nsystems. In this paper, we conduct what is, to our knowledge, the first\ncomprehensive study of the impact of automatic transcription on speaker\nattribution performance. In particular, we study the extent to which speaker\nattribution performance degrades in the face of transcription errors, as well\nas how properties of the ASR system impact attribution. We find that\nattribution is surprisingly resilient to word-level transcription errors and\nthat the objective of recovering the true transcript is minimally correlated\nwith attribution performance. Overall, our findings suggest that speaker\nattribution on more errorful transcripts produced by ASR is as good, if not\nbetter, than attribution based on human-transcribed data, possibly because ASR\ntranscription errors can capture speaker-specific features revealing of speaker\nidentity.",
        "url": "http://arxiv.org/abs/2507.08660v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08660v1",
        "arxiv_id": "2507.08660v1",
        "authors": [
            "Cristina Aggazzotti",
            "Matthew Wiesner",
            "Elizabeth Allyn Smith",
            "Nicholas Andrews"
        ],
        "submitted": "2025-07-11 15:00:32",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Scaling Attention to Very Long Sequences in Linear Time with Wavelet-Enhanced Random Spectral Attention (WERSA)",
        "abstract": "Transformer models are computationally costly on long sequences since regular\nattention has quadratic $O(n^2)$ time complexity. We introduce Wavelet-Enhanced\nRandom Spectral Attention (WERSA), a novel mechanism of linear $O(n)$ time\ncomplexity that is pivotal to enable successful long-sequence processing\nwithout the performance trade-off. WERSA merges content-adaptive random\nspectral features together with multi-resolution Haar wavelets and learnable\nparameters to selectively attend to informative scales of data while preserving\nlinear efficiency.\n  Large-scale comparisons \\textbf{on single GPU} and across various benchmarks\n(vision, NLP, hierarchical reasoning) and various attention mechanisms (like\nMultiheaded Attention, Flash-Attention-2, FNet, Linformer, Performer,\nWaveformer), reveal uniform advantages of WERSA. It achieves best accuracy in\nall tests. On ArXiv classification, WERSA improves accuracy over vanilla\nattention by 1.2\\% (86.2\\% vs 85.0\\%) while cutting training time by 81\\% (296s\nvs 1554s) and FLOPS by 73.4\\% (26.2G vs 98.4G). Significantly, WERSA excels\nwhere vanilla and FlashAttention-2 fail: on ArXiv-128k's extremely lengthy\nsequences, it achieves best accuracy (79.1\\%) and AUC (0.979) among viable\nmethods, operating on data that gives Out-Of-Memory errors to quadratic methods\nwhile being \\textbf{twice as fast} as Waveformer, its next-best competitor.\n  By significantly reducing computational loads without compromising accuracy,\nWERSA makes possible more practical, more affordable, long-context models, in\nparticular on low-resource hardware, for more sustainable and more scalable AI\ndevelopment.",
        "url": "http://arxiv.org/abs/2507.08637v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08637v1",
        "arxiv_id": "2507.08637v1",
        "authors": [
            "Vincenzo Dentamaro"
        ],
        "submitted": "2025-07-11 14:40:40",
        "source": "arxiv",
        "comment": "10 pages, 1 figure"
    },
    {
        "title": "A comprehensive study of LLM-based argument classification: from LLAMA through GPT-4o to Deepseek-R1",
        "abstract": "Argument mining (AM) is an interdisciplinary research field that integrates\ninsights from logic, philosophy, linguistics, rhetoric, law, psychology, and\ncomputer science. It involves the automatic identification and extraction of\nargumentative components, such as premises and claims, and the detection of\nrelationships between them, such as support, attack, or neutrality. Recently,\nthe field has advanced significantly, especially with the advent of large\nlanguage models (LLMs), which have enhanced the efficiency of analyzing and\nextracting argument semantics compared to traditional methods and other deep\nlearning models. There are many benchmarks for testing and verifying the\nquality of LLM, but there is still a lack of research and results on the\noperation of these models in publicly available argument classification\ndatabases. This paper presents a study of a selection of LLM's, using diverse\ndatasets such as Args.me and UKP. The models tested include versions of GPT,\nLlama, and DeepSeek, along with reasoning-enhanced variants incorporating the\nChain-of-Thoughts algorithm. The results indicate that ChatGPT-4o outperforms\nthe others in the argument classification benchmarks. In case of models\nincorporated with reasoning capabilities, the Deepseek-R1 shows its\nsuperiority. However, despite their superiority, GPT-4o and Deepseek-R1 still\nmake errors. The most common errors are discussed for all models. To our\nknowledge, the presented work is the first broader analysis of the mentioned\ndatasets using LLM and prompt algorithms. The work also shows some weaknesses\nof known prompt algorithms in argument analysis, while indicating directions\nfor their improvement. The added value of the work is the in-depth analysis of\nthe available argument datasets and the demonstration of their shortcomings.",
        "url": "http://arxiv.org/abs/2507.08621v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08621v1",
        "arxiv_id": "2507.08621v1",
        "authors": [
            "Marcin Pietroń",
            "Rafał Olszowski",
            "Jakub Gomułka",
            "Filip Gampel",
            "Andrzej Tomski"
        ],
        "submitted": "2025-07-11 14:23:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DocPolarBERT: A Pre-trained Model for Document Understanding with Relative Polar Coordinate Encoding of Layout Structures",
        "abstract": "We introduce DocPolarBERT, a layout-aware BERT model for document\nunderstanding that eliminates the need for absolute 2D positional embeddings.\nWe extend self-attention to take into account text block positions in relative\npolar coordinate system rather than the Cartesian one. Despite being\npre-trained on a dataset more than six times smaller than the widely used\nIIT-CDIP corpus, DocPolarBERT achieves state-of-the-art results. These results\ndemonstrate that a carefully designed attention mechanism can compensate for\nreduced pre-training data, offering an efficient and effective alternative for\ndocument understanding.",
        "url": "http://arxiv.org/abs/2507.08606v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08606v1",
        "arxiv_id": "2507.08606v1",
        "authors": [
            "Benno Uthayasooriyar",
            "Antoine Ly",
            "Franck Vermet",
            "Caio Corro"
        ],
        "submitted": "2025-07-11 14:00:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Large Multi-modal Model Cartographic Map Comprehension for Textual Locality Georeferencing",
        "abstract": "Millions of biological sample records collected in the last few centuries\narchived in natural history collections are un-georeferenced. Georeferencing\ncomplex locality descriptions associated with these collection samples is a\nhighly labour-intensive task collection agencies struggle with. None of the\nexisting automated methods exploit maps that are an essential tool for\ngeoreferencing complex relations. We present preliminary experiments and\nresults of a novel method that exploits multi-modal capabilities of recent\nLarge Multi-Modal Models (LMM). This method enables the model to visually\ncontextualize spatial relations it reads in the locality description. We use a\ngrid-based approach to adapt these auto-regressive models for this task in a\nzero-shot setting. Our experiments conducted on a small manually annotated\ndataset show impressive results for our approach ($\\sim$1 km Average distance\nerror) compared to uni-modal georeferencing with Large Language Models and\nexisting georeferencing tools. The paper also discusses the findings of the\nexperiments in light of an LMM's ability to comprehend fine-grained maps.\nMotivated by these results, a practical framework is proposed to integrate this\nmethod into a georeferencing workflow.",
        "url": "http://arxiv.org/abs/2507.08575v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08575v1",
        "arxiv_id": "2507.08575v1",
        "authors": [
            "Kalana Wijegunarathna",
            "Kristin Stock",
            "Christopher B. Jones"
        ],
        "submitted": "2025-07-11 13:23:25",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Digital gazetteers: review and prospects for place name knowledge bases",
        "abstract": "Gazetteers typically store data on place names, place types and the\nassociated coordinates. They play an essential role in disambiguating place\nnames in online geographical information retrieval systems for navigation and\nmapping, detecting and disambiguating place names in text, and providing\ncoordinates. Currently there are many gazetteers in use derived from many\nsources, with no commonly accepted standard for encoding the data. Most\ngazetteers are also very limited in the extent to which they represent the\nmultiple facets of the named places yet they have potential to assist user\nsearch for locations with specific physical, commercial, social or cultural\ncharacteristics. With a view to understanding digital gazetteer technologies\nand advancing their future effectiveness for information retrieval, we provide\na review of data sources, components, software and data management\ntechnologies, data quality and volunteered data, and methods for matching\nsources that refer to the same real-world places. We highlight the need for\nfuture work on richer representation of named places, the temporal evolution of\nplace identity and location, and the development of more effective methods for\ndata integration.",
        "url": "http://arxiv.org/abs/2507.08553v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08553v1",
        "arxiv_id": "2507.08553v1",
        "authors": [
            "Kalana Wijegunarathna",
            "Kristin Stock",
            "Christopher B. Jones"
        ],
        "submitted": "2025-07-11 12:56:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The AI Language Proficiency Monitor -- Tracking the Progress of LLMs on Multilingual Benchmarks",
        "abstract": "To ensure equitable access to the benefits of large language models (LLMs),\nit is essential to evaluate their capabilities across the world's languages. We\nintroduce the AI Language Proficiency Monitor, a comprehensive multilingual\nbenchmark that systematically assesses LLM performance across up to 200\nlanguages, with a particular focus on low-resource languages. Our benchmark\naggregates diverse tasks including translation, question answering, math, and\nreasoning, using datasets such as FLORES+, MMLU, GSM8K, TruthfulQA, and ARC. We\nprovide an open-source, auto-updating leaderboard and dashboard that supports\nresearchers, developers, and policymakers in identifying strengths and gaps in\nmodel performance. In addition to ranking models, the platform offers\ndescriptive insights such as a global proficiency map and trends over time. By\ncomplementing and extending prior multilingual benchmarks, our work aims to\nfoster transparency, inclusivity, and progress in multilingual AI. The system\nis available at\nhttps://huggingface.co/spaces/fair-forward/evals-for-every-language.",
        "url": "http://arxiv.org/abs/2507.08538v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08538v1",
        "arxiv_id": "2507.08538v1",
        "authors": [
            "David Pomerenke",
            "Jonas Nothnagel",
            "Simon Ostermann"
        ],
        "submitted": "2025-07-11 12:38:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "A Multi-granularity Concept Sparse Activation and Hierarchical Knowledge Graph Fusion Framework for Rare Disease Diagnosis",
        "abstract": "Despite advances from medical large language models in healthcare,\nrare-disease diagnosis remains hampered by insufficient\nknowledge-representation depth, limited concept understanding, and constrained\nclinical reasoning. We propose a framework that couples multi-granularity\nsparse activation of medical concepts with a hierarchical knowledge graph. Four\ncomplementary matching algorithms, diversity control, and a five-level fallback\nstrategy enable precise concept activation, while a three-layer knowledge graph\n(taxonomy, clinical features, instances) provides structured, up-to-date\ncontext. Experiments on the BioASQ rare-disease QA set show BLEU gains of 0.09,\nROUGE gains of 0.05, and accuracy gains of 0.12, with peak accuracy of 0.89\napproaching the 0.90 clinical threshold. Expert evaluation confirms\nimprovements in information quality, reasoning, and professional expression,\nsuggesting our approach shortens the \"diagnostic odyssey\" for rare-disease\npatients.",
        "url": "http://arxiv.org/abs/2507.08529v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08529v1",
        "arxiv_id": "2507.08529v1",
        "authors": [
            "Mingda Zhang",
            "Na Zhao",
            "Jianglong Qin",
            "Guoyu Ye",
            "Ruixiang Tang"
        ],
        "submitted": "2025-07-11 12:26:19",
        "source": "arxiv",
        "comment": "10 pages,3 figures"
    },
    {
        "title": "PromotionGo at SemEval-2025 Task 11: A Feature-Centric Framework for Cross-Lingual Multi-Emotion Detection in Short Texts",
        "abstract": "This paper presents our system for SemEval 2025 Task 11: Bridging the Gap in\nText-Based Emotion Detection (Track A), which focuses on multi-label emotion\ndetection in short texts. We propose a feature-centric framework that\ndynamically adapts document representations and learning algorithms to optimize\nlanguage-specific performance. Our study evaluates three key components:\ndocument representation, dimensionality reduction, and model training in 28\nlanguages, highlighting five for detailed analysis. The results show that\nTF-IDF remains highly effective for low-resource languages, while contextual\nembeddings like FastText and transformer-based document representations, such\nas those produced by Sentence-BERT, exhibit language-specific strengths.\nPrincipal Component Analysis (PCA) reduces training time without compromising\nperformance, particularly benefiting FastText and neural models such as\nMulti-Layer Perceptrons (MLP). Computational efficiency analysis underscores\nthe trade-off between model complexity and processing cost. Our framework\nprovides a scalable solution for multilingual emotion detection, addressing the\nchallenges of linguistic diversity and resource constraints.",
        "url": "http://arxiv.org/abs/2507.08499v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08499v1",
        "arxiv_id": "2507.08499v1",
        "authors": [
            "Ziyi Huang",
            "Xia Cui"
        ],
        "submitted": "2025-07-11 11:21:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Semantic-Augmented Latent Topic Modeling with LLM-in-the-Loop",
        "abstract": "Latent Dirichlet Allocation (LDA) is a prominent generative probabilistic\nmodel used for uncovering abstract topics within document collections. In this\npaper, we explore the effectiveness of augmenting topic models with Large\nLanguage Models (LLMs) through integration into two key phases: Initialization\nand Post-Correction. Since the LDA is highly dependent on the quality of its\ninitialization, we conduct extensive experiments on the LLM-guided topic\nclustering for initializing the Gibbs sampling algorithm. Interestingly, the\nexperimental results reveal that while the proposed initialization strategy\nimproves the early iterations of LDA, it has no effect on the convergence and\nyields the worst performance compared to the baselines. The LLM-enabled\npost-correction, on the other hand, achieved a promising improvement of 5.86%\nin the coherence evaluation. These results highlight the practical benefits of\nthe LLM-in-the-loop approach and challenge the belief that LLMs are always the\nsuperior text mining alternative.",
        "url": "http://arxiv.org/abs/2507.08498v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08498v1",
        "arxiv_id": "2507.08498v1",
        "authors": [
            "Mengze Hong",
            "Chen Jason Zhang",
            "Di Jiang"
        ],
        "submitted": "2025-07-11 11:20:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LLaPa: A Vision-Language Model Framework for Counterfactual-Aware Procedural Planning",
        "abstract": "While large language models (LLMs) have advanced procedural planning for\nembodied AI systems through strong reasoning abilities, the integration of\nmultimodal inputs and counterfactual reasoning remains underexplored. To tackle\nthese challenges, we introduce LLaPa, a vision-language model framework\ndesigned for multimodal procedural planning. LLaPa generates executable action\nsequences from textual task descriptions and visual environmental images using\nvision-language models (VLMs). Furthermore, we enhance LLaPa with two auxiliary\nmodules to improve procedural planning. The first module, the Task-Environment\nReranker (TER), leverages task-oriented segmentation to create a task-sensitive\nfeature space, aligning textual descriptions with visual environments and\nemphasizing critical regions for procedural execution. The second module, the\nCounterfactual Activities Retriever (CAR), identifies and emphasizes potential\ncounterfactual conditions, enhancing the model's reasoning capability in\ncounterfactual scenarios. Extensive experiments on ActPlan-1K and ALFRED\nbenchmarks demonstrate that LLaPa generates higher-quality plans with superior\nLCS and correctness, outperforming advanced models. The code and models are\navailable https://github.com/sunshibo1234/LLaPa.",
        "url": "http://arxiv.org/abs/2507.08496v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08496v1",
        "arxiv_id": "2507.08496v1",
        "authors": [
            "Shibo Sun",
            "Xue Li",
            "Donglin Di",
            "Mingjie Wei",
            "Lanshun Nie",
            "Wei-Nan Zhang",
            "Dechen Zhan",
            "Yang Song",
            "Lei Fan"
        ],
        "submitted": "2025-07-11 11:18:49",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "A Third Paradigm for LLM Evaluation: Dialogue Game-Based Evaluation using clembench",
        "abstract": "There are currently two main paradigms for evaluating large language models\n(LLMs), reference-based evaluation and preference-based evaluation. The first,\ncarried over from the evaluation of machine learning models in general, relies\non pre-defined task instances, for which reference task executions are\navailable. The second, best exemplified by the LM-arena, relies on (often\nself-selected) users bringing their own intents to a site that routes these to\nseveral models in parallel, among whose responses the user then selects their\nmost preferred one. The former paradigm hence excels at control over what is\ntested, while the latter comes with higher ecological validity, testing actual\nuse cases interactively. Recently, a third complementary paradigm has emerged\nthat combines some of the strengths of these approaches, offering control over\nmulti-turn, reference-free, repeatable interactions, while stressing\ngoal-directedness: dialogue game based evaluation. While the utility of this\napproach has been shown by several projects, its adoption has been held back by\nthe lack of a mature, easily re-usable implementation. In this paper, we\npresent clembench, which has been in continuous development since 2023 and has\nin its latest release been optimized for ease of general use. We describe how\nit can be used to benchmark one's own models (using a provided set of benchmark\ngame instances in English), as well as how easily the benchmark itself can be\nextended with new, tailor-made targeted tests.",
        "url": "http://arxiv.org/abs/2507.08491v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08491v1",
        "arxiv_id": "2507.08491v1",
        "authors": [
            "David Schlangen",
            "Sherzod Hakimov",
            "Jonathan Jordan",
            "Philipp Sadler"
        ],
        "submitted": "2025-07-11 11:16:01",
        "source": "arxiv",
        "comment": "All code required to run the benchmark, as well as extensive\n  documentation, is available at https://github.com/clembench/clembench"
    },
    {
        "title": "Enhancing Essay Cohesion Assessment: A Novel Item Response Theory Approach",
        "abstract": "Essays are considered a valuable mechanism for evaluating learning outcomes\nin writing. Textual cohesion is an essential characteristic of a text, as it\nfacilitates the establishment of meaning between its parts. Automatically\nscoring cohesion in essays presents a challenge in the field of educational\nartificial intelligence. The machine learning algorithms used to evaluate texts\ngenerally do not consider the individual characteristics of the instances that\ncomprise the analysed corpus. In this meaning, item response theory can be\nadapted to the context of machine learning, characterising the ability,\ndifficulty and discrimination of the models used. This work proposes and\nanalyses the performance of a cohesion score prediction approach based on item\nresponse theory to adjust the scores generated by machine learning models. In\nthis study, the corpus selected for the experiments consisted of the extended\nEssay-BR, which includes 6,563 essays in the style of the National High School\nExam (ENEM), and the Brazilian Portuguese Narrative Essays, comprising 1,235\nessays written by 5th to 9th grade students from public schools. We extracted\n325 linguistic features and treated the problem as a machine learning\nregression task. The experimental results indicate that the proposed approach\noutperforms conventional machine learning models and ensemble methods in\nseveral evaluation metrics. This research explores a potential approach for\nimproving the automatic evaluation of cohesion in educational essays.",
        "url": "http://arxiv.org/abs/2507.08487v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08487v1",
        "arxiv_id": "2507.08487v1",
        "authors": [
            "Bruno Alexandre Rosa",
            "Hilário Oliveira",
            "Luiz Rodrigues",
            "Eduardo Araujo Oliveira",
            "Rafael Ferreira Mello"
        ],
        "submitted": "2025-07-11 11:05:27",
        "source": "arxiv",
        "comment": "24 pages, 4 tables"
    },
    {
        "title": "Improving Korean-English Cross-Lingual Retrieval: A Data-Centric Study of Language Composition and Model Merging",
        "abstract": "With the increasing utilization of multilingual text information,\nCross-Lingual Information Retrieval (CLIR) has become a crucial research area.\nHowever, the impact of training data composition on both CLIR and Mono-Lingual\nInformation Retrieval (IR) performance remains under-explored. To\nsystematically investigate this data-centric aspect, we construct\nlinguistically parallel Korean-English datasets and train retrieval models with\nvarious language combinations. Our experiments reveal that the language\ncomposition of training data significantly influences IR performance,\nexhibiting important inter-lingual correlations: CLIR performance improves with\nspecific language pairs, while Mono-Lingual IR performance declines. Our work\ndemonstrates that Model Merging can effectively mitigate this trade-off,\nachieving strong CLIR results while preserving Mono-Lingual IR capabilities.\nOur findings underscore the effects of linguistic configuration of training\ndata on both CLIR and Mono-Lingual IR, and present Model Merging as a viable\nstrategy to optimize performance across these tasks.",
        "url": "http://arxiv.org/abs/2507.08480v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08480v1",
        "arxiv_id": "2507.08480v1",
        "authors": [
            "Youngjoon Jang",
            "Junyoung Son",
            "Taemin Lee",
            "Seongtae Hong",
            "Heuiseok Lim"
        ],
        "submitted": "2025-07-11 10:44:09",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ILT-Iterative LoRA Training through Focus-Feedback-Fix for Multilingual Speech Recognition",
        "abstract": "The deep integration of large language models and automatic speech\nrecognition systems has become a promising research direction with high\npractical value. To address the overfitting issue commonly observed in Low-Rank\nAdaptation (LoRA) during the supervised fine-tuning (SFT) stage, this work\nproposes an innovative training paradigm Iterative LoRA Training (ILT) in\ncombination with an Iterative Pseudo Labeling strategy, effectively enhancing\nthe theoretical upper bound of model performance. Based on Whisper-large-v3 and\nQwen2-Audio, we conduct systematic experiments using a three-stage training\nprocess: Focus Training, Feed Back Training, and Fix Training. Experimental\nresults demonstrate the effectiveness of the proposed method. Furthermore, the\nMegaAIS research team applied this technique in the Interspeech 2025\nMultilingual Conversational Speech Language Modeling Challenge (MLC-SLM),\nachieving 4th in Track 1 (Multilingual ASR Task) and 1st place in Track 2\n(Speech Separation and Recognition Task), showcasing the practical feasibility\nand strong application potential of our approach.",
        "url": "http://arxiv.org/abs/2507.08477v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08477v1",
        "arxiv_id": "2507.08477v1",
        "authors": [
            "Qingliang Meng",
            "Hao Wu",
            "Wei Liang",
            "Wei Xu",
            "Qing Zhao"
        ],
        "submitted": "2025-07-11 10:38:51",
        "source": "arxiv",
        "comment": "Accepted By Interspeech 2025 MLC-SLM workshop as a Research Paper"
    },
    {
        "title": "Using Large Language Models for Legal Decision-Making in Austrian Value-Added Tax Law: An Experimental Study",
        "abstract": "This paper provides an experimental evaluation of the capability of large\nlanguage models (LLMs) to assist in legal decision-making within the framework\nof Austrian and European Union value-added tax (VAT) law. In tax consulting\npractice, clients often describe cases in natural language, making LLMs a prime\ncandidate for supporting automated decision-making and reducing the workload of\ntax professionals. Given the requirement for legally grounded and\nwell-justified analyses, the propensity of LLMs to hallucinate presents a\nconsiderable challenge. The experiments focus on two common methods for\nenhancing LLM performance: fine-tuning and retrieval-augmented generation\n(RAG). In this study, these methods are applied on both textbook cases and\nreal-world cases from a tax consulting firm to systematically determine the\nbest configurations of LLM-based systems and assess the legal-reasoning\ncapabilities of LLMs. The findings highlight the potential of using LLMs to\nsupport tax consultants by automating routine tasks and providing initial\nanalyses, although current prototypes are not ready for full automation due to\nthe sensitivity of the legal domain. The findings indicate that LLMs, when\nproperly configured, can effectively support tax professionals in VAT tasks and\nprovide legally grounded justifications for decisions. However, limitations\nremain regarding the handling of implicit client knowledge and context-specific\ndocumentation, underscoring the need for future integration of structured\nbackground information.",
        "url": "http://arxiv.org/abs/2507.08468v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08468v1",
        "arxiv_id": "2507.08468v1",
        "authors": [
            "Marina Luketina",
            "Andrea Benkel",
            "Christoph G. Schuetz"
        ],
        "submitted": "2025-07-11 10:19:56",
        "source": "arxiv",
        "comment": "26 pages, 5 figures, 6 tables"
    },
    {
        "title": "Diagnosing Failures in Large Language Models' Answers: Integrating Error Attribution into Evaluation Framework",
        "abstract": "With the widespread application of Large Language Models (LLMs) in various\ntasks, the mainstream LLM platforms generate massive user-model interactions\ndaily. In order to efficiently analyze the performance of models and diagnose\nfailures in their answers, it is essential to develop an automated framework to\nsystematically categorize and attribute errors. However, existing evaluation\nmodels lack error attribution capability. In this work, we establish a\ncomprehensive Misattribution Framework with 6 primary and 15 secondary\ncategories to facilitate in-depth analysis. Based on this framework, we present\nAttriData, a dataset specifically designed for error attribution, encompassing\nmisattribution, along with the corresponding scores and feedback. We also\npropose MisAttributionLLM, a fine-tuned model on AttriData, which is the first\ngeneral-purpose judge model capable of simultaneously generating score,\nmisattribution, and feedback. Extensive experiments and analyses are conducted\nto confirm the effectiveness and robustness of our proposed method.",
        "url": "http://arxiv.org/abs/2507.08459v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08459v1",
        "arxiv_id": "2507.08459v1",
        "authors": [
            "Zishan Xu",
            "Shuyi Xie",
            "Qingsong Lv",
            "Shupei Xiao",
            "Linlin Song",
            "Sui Wenjuan",
            "Fan Lin"
        ],
        "submitted": "2025-07-11 10:02:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CUE-RAG: Towards Accurate and Cost-Efficient Graph-Based RAG via Multi-Partite Graph and Query-Driven Iterative Retrieval",
        "abstract": "Despite the remarkable progress of Large Language Models (LLMs), their\nperformance in question answering (QA) remains limited by the lack of\ndomain-specific and up-to-date knowledge. Retrieval-Augmented Generation (RAG)\naddresses this limitation by incorporating external information, often from\ngraph-structured data. However, existing graph-based RAG methods suffer from\npoor graph quality due to incomplete extraction and insufficient utilization of\nquery information during retrieval. To overcome these limitations, we propose\nCUE-RAG, a novel approach that introduces (1) a multi-partite graph index\nincorporates text Chunks, knowledge Units, and Entities to capture semantic\ncontent at multiple levels of granularity, (2) a hybrid extraction strategy\nthat reduces LLM token usage while still producing accurate and disambiguated\nknowledge units, and (3) Q-Iter, a query-driven iterative retrieval strategy\nthat enhances relevance through semantic search and constrained graph\ntraversal. Experiments on three QA benchmarks show that CUE-RAG significantly\noutperforms state-of-the-art baselines, achieving up to 99.33% higher Accuracy\nand 113.51% higher F1 score while reducing indexing costs by 72.58%.\nRemarkably, CUE-RAG matches or outperforms baselines even without using an LLM\nfor indexing. These results demonstrate the effectiveness and cost-efficiency\nof CUE-RAG in advancing graph-based RAG systems.",
        "url": "http://arxiv.org/abs/2507.08445v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08445v1",
        "arxiv_id": "2507.08445v1",
        "authors": [
            "Yaodong Su",
            "Yixiang Fang",
            "Yingli Zhou",
            "Quanqing Xu",
            "Chuanhui Yang"
        ],
        "submitted": "2025-07-11 09:36:45",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Finding Common Ground: Using Large Language Models to Detect Agreement in Multi-Agent Decision Conferences",
        "abstract": "Decision conferences are structured, collaborative meetings that bring\ntogether experts from various fields to address complex issues and reach a\nconsensus on recommendations for future actions or policies. These conferences\noften rely on facilitated discussions to ensure productive dialogue and\ncollective agreement. Recently, Large Language Models (LLMs) have shown\nsignificant promise in simulating real-world scenarios, particularly through\ncollaborative multi-agent systems that mimic group interactions. In this work,\nwe present a novel LLM-based multi-agent system designed to simulate decision\nconferences, specifically focusing on detecting agreement among the participant\nagents. To achieve this, we evaluate six distinct LLMs on two tasks: stance\ndetection, which identifies the position an agent takes on a given issue, and\nstance polarity detection, which identifies the sentiment as positive,\nnegative, or neutral. These models are further assessed within the multi-agent\nsystem to determine their effectiveness in complex simulations. Our results\nindicate that LLMs can reliably detect agreement even in dynamic and nuanced\ndebates. Incorporating an agreement-detection agent within the system can also\nimprove the efficiency of group debates and enhance the overall quality and\ncoherence of deliberations, making them comparable to real-world decision\nconferences regarding outcome and decision-making. These findings demonstrate\nthe potential for LLM-based multi-agent systems to simulate group\ndecision-making processes. They also highlight that such systems could be\ninstrumental in supporting decision-making with expert elicitation workshops\nacross various domains.",
        "url": "http://arxiv.org/abs/2507.08440v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08440v1",
        "arxiv_id": "2507.08440v1",
        "authors": [
            "Selina Heller",
            "Mohamed Ibrahim",
            "David Antony Selby",
            "Sebastian Vollmer"
        ],
        "submitted": "2025-07-11 09:31:10",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "xpSHACL: Explainable SHACL Validation using Retrieval-Augmented Generation and Large Language Models",
        "abstract": "Shapes Constraint Language (SHACL) is a powerful language for validating RDF\ndata. Given the recent industry attention to Knowledge Graphs (KGs), more users\nneed to validate linked data properly. However, traditional SHACL validation\nengines often provide terse reports in English that are difficult for\nnon-technical users to interpret and act upon. This paper presents xpSHACL, an\nexplainable SHACL validation system that addresses this issue by combining\nrule-based justification trees with retrieval-augmented generation (RAG) and\nlarge language models (LLMs) to produce detailed, multilanguage, human-readable\nexplanations for constraint violations. A key feature of xpSHACL is its usage\nof a Violation KG to cache and reuse explanations, improving efficiency and\nconsistency.",
        "url": "http://arxiv.org/abs/2507.08432v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08432v1",
        "arxiv_id": "2507.08432v1",
        "authors": [
            "Gustavo Correa Publio",
            "José Emilio Labra Gayo"
        ],
        "submitted": "2025-07-11 09:18:41",
        "source": "arxiv",
        "comment": "Accepted for publication in the 2nd LLM+Graph Workshop, colocated at\n  VLDB'25"
    },
    {
        "title": "ChainEdit: Propagating Ripple Effects in LLM Knowledge Editing through Logical Rule-Guided Chains",
        "abstract": "Current knowledge editing methods for large language models (LLMs) struggle\nto maintain logical consistency when propagating ripple effects to associated\nfacts. We propose ChainEdit, a framework that synergizes knowledge\ngraph-derived logical rules with LLM logical reasoning capabilities to enable\nsystematic chain updates. By automatically extracting logical patterns from\nstructured knowledge bases and aligning them with LLMs' internal logics,\nChainEdit dynamically generates and edits logically connected knowledge\nclusters. Experiments demonstrate an improvement of more than 30% in logical\ngeneralization over baselines while preserving editing reliability and\nspecificity. We further address evaluation biases in existing benchmarks\nthrough knowledge-aware protocols that disentangle external dependencies. This\nwork establishes new state-of-the-art performance on ripple effect while\nensuring internal logical consistency after knowledge editing.",
        "url": "http://arxiv.org/abs/2507.08427v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08427v1",
        "arxiv_id": "2507.08427v1",
        "authors": [
            "Zilu Dong",
            "Xiangqing Shen",
            "Zinong Yang",
            "Rui Xia"
        ],
        "submitted": "2025-07-11 09:13:29",
        "source": "arxiv",
        "comment": "Accepted to ACL 2025 (main)"
    },
    {
        "title": "A Survey of Large Language Models in Discipline-specific Research: Challenges, Methods and Opportunities",
        "abstract": "Large Language Models (LLMs) have demonstrated their transformative potential\nacross numerous disciplinary studies, reshaping the existing research\nmethodologies and fostering interdisciplinary collaboration. However, a\nsystematic understanding of their integration into diverse disciplines remains\nunderexplored. This survey paper provides a comprehensive overview of the\napplication of LLMs in interdisciplinary studies, categorising research efforts\nfrom both a technical perspective and with regard to their applicability. From\na technical standpoint, key methodologies such as supervised fine-tuning,\nretrieval-augmented generation, agent-based approaches, and tool-use\nintegration are examined, which enhance the adaptability and effectiveness of\nLLMs in discipline-specific contexts. From the perspective of their\napplicability, this paper explores how LLMs are contributing to various\ndisciplines including mathematics, physics, chemistry, biology, and the\nhumanities and social sciences, demonstrating their role in discipline-specific\ntasks. The prevailing challenges are critically examined and the promising\nresearch directions are highlighted alongside the recent advances in LLMs. By\nproviding a comprehensive overview of the technical developments and\napplications in this field, this survey aims to serve as an invaluable resource\nfor the researchers who are navigating the complex landscape of LLMs in the\ncontext of interdisciplinary studies.",
        "url": "http://arxiv.org/abs/2507.08425v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08425v1",
        "arxiv_id": "2507.08425v1",
        "authors": [
            "Lu Xiang",
            "Yang Zhao",
            "Yaping Zhang",
            "Chengqing Zong"
        ],
        "submitted": "2025-07-11 09:11:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The Curious Case of Factuality Finetuning: Models' Internal Beliefs Can Improve Factuality",
        "abstract": "Language models are prone to hallucination - generating text that is\nfactually incorrect. Finetuning models on high-quality factual information can\npotentially reduce hallucination, but concerns remain; obtaining factual gold\ndata can be expensive and training on correct but unfamiliar data may\npotentially lead to even more downstream hallucination. What data should\npractitioners finetune on to mitigate hallucinations in language models? In\nthis work, we study the relationship between the factuality of finetuning data\nand the prevalence of hallucinations in long-form generation tasks.\nCounterintuitively, we find that finetuning on factual gold data is not as\nhelpful as finetuning on model-generated data that models believe to be\nfactual. Next, we evaluate filtering strategies applied on both factual gold\ndata and model-generated data, and find that finetuning on model-generated data\nthat is filtered by models' own internal judgments often leads to better\noverall factuality compared to other configurations: training on gold data\nfiltered by models' judgments, training on gold data alone, or training on\nmodel-generated data that is supported by gold data. These factuality\nimprovements transfer across three domains we study, suggesting that a models'\nown beliefs can provide a powerful signal for factuality.",
        "url": "http://arxiv.org/abs/2507.08371v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08371v1",
        "arxiv_id": "2507.08371v1",
        "authors": [
            "Benjamin Newman",
            "Abhilasha Ravichander",
            "Jaehun Jung",
            "Rui Xin",
            "Hamish Ivison",
            "Yegor Kuznetsov",
            "Pang Wei Koh",
            "Yejin Choi"
        ],
        "submitted": "2025-07-11 07:34:34",
        "source": "arxiv",
        "comment": "29 pages, 4 figures, 16 tables"
    },
    {
        "title": "DS@GT at LongEval: Evaluating Temporal Performance in Web Search Systems and Topics with Two-Stage Retrieval",
        "abstract": "Information Retrieval (IR) models are often trained on static datasets,\nmaking them vulnerable to performance degradation as web content evolves. The\nDS@GT competition team participated in the Longitudinal Evaluation of Model\nPerformance (LongEval) lab at CLEF 2025, which evaluates IR systems across\ntemporally distributed web snapshots. Our analysis of the Qwant web dataset\nincludes exploratory data analysis with topic modeling over time. The two-phase\nretrieval system employs sparse keyword searches, utilizing query expansion and\ndocument reranking. Our best system achieves an average NDCG@10 of 0.296 across\nthe entire training and test dataset, with an overall best score of 0.395 on\n2023-05. The accompanying source code for this paper is at\nhttps://github.com/dsgt-arc/longeval-2025",
        "url": "http://arxiv.org/abs/2507.08360v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08360v1",
        "arxiv_id": "2507.08360v1",
        "authors": [
            "Anthony Miyaguchi",
            "Imran Afrulbasha",
            "Aleksandar Pramov"
        ],
        "submitted": "2025-07-11 07:23:08",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Exploring Design of Multi-Agent LLM Dialogues for Research Ideation",
        "abstract": "Large language models (LLMs) are increasingly used to support creative tasks\nsuch as research idea generation. While recent work has shown that structured\ndialogues between LLMs can improve the novelty and feasibility of generated\nideas, the optimal design of such interactions remains unclear. In this study,\nwe conduct a comprehensive analysis of multi-agent LLM dialogues for scientific\nideation. We compare different configurations of agent roles, number of agents,\nand dialogue depth to understand how these factors influence the novelty and\nfeasibility of generated ideas. Our experimental setup includes settings where\none agent generates ideas and another critiques them, enabling iterative\nimprovement. Our results show that enlarging the agent cohort, deepening the\ninteraction depth, and broadening agent persona heterogeneity each enrich the\ndiversity of generated ideas. Moreover, specifically increasing critic-side\ndiversity within the ideation-critique-revision loop further boosts the\nfeasibility of the final proposals. Our findings offer practical guidelines for\nbuilding effective multi-agent LLM systems for scientific ideation. Our code is\navailable at https://github.com/g6000/MultiAgent-Research-Ideator.",
        "url": "http://arxiv.org/abs/2507.08350v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08350v1",
        "arxiv_id": "2507.08350v1",
        "authors": [
            "Keisuke Ueda",
            "Wataru Hirota",
            "Takuto Asakura",
            "Takahiro Omi",
            "Kosuke Takahashi",
            "Kosuke Arima",
            "Tatsuya Ishigaki"
        ],
        "submitted": "2025-07-11 06:53:46",
        "source": "arxiv",
        "comment": "16 pages, 1 figure, appendix. Accepted to SIGDIAL 2025"
    },
    {
        "title": "Beyond N-Grams: Rethinking Evaluation Metrics and Strategies for Multilingual Abstractive Summarization",
        "abstract": "Automatic n-gram based metrics such as ROUGE are widely used for evaluating\ngenerative tasks such as summarization. While these metrics are considered\nindicative (even if imperfect) of human evaluation for English, their\nsuitability for other languages remains unclear. To address this, we\nsystematically assess evaluation metrics for generation both n-gram-based and\nneural based to evaluate their effectiveness across languages and tasks.\nSpecifically, we design a large-scale evaluation suite across eight languages\nfrom four typological families: agglutinative, isolating, low-fusional, and\nhigh-fusional, spanning both low- and high-resource settings, to analyze their\ncorrelation with human judgments. Our findings highlight the sensitivity of\nevaluation metrics to the language type. For example, in fusional languages,\nn-gram-based metrics show lower correlation with human assessments compared to\nisolating and agglutinative languages. We also demonstrate that proper\ntokenization can significantly mitigate this issue for morphologically rich\nfusional languages, sometimes even reversing negative trends. Additionally, we\nshow that neural-based metrics specifically trained for evaluation, such as\nCOMET, consistently outperform other neural metrics and better correlate with\nhuman judgments in low-resource languages. Overall, our analysis highlights the\nlimitations of n-gram metrics for fusional languages and advocates for greater\ninvestment in neural-based metrics trained for evaluation tasks.",
        "url": "http://arxiv.org/abs/2507.08342v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08342v1",
        "arxiv_id": "2507.08342v1",
        "authors": [
            "Itai Mondshine",
            "Tzuf Paz-Argaman",
            "Reut Tsarfaty"
        ],
        "submitted": "2025-07-11 06:44:52",
        "source": "arxiv",
        "comment": "ACL 2025 Main"
    },
    {
        "title": "What Factors Affect LLMs and RLLMs in Financial Question Answering?",
        "abstract": "Recently, the development of large language models (LLMs) and reasoning large\nlanguage models (RLLMs) have gained considerable attention from many\nresearchers. RLLMs enhance the reasoning capabilities of LLMs through Long\nChain-of-Thought (Long CoT) processes, significantly improving the performance\nof LLMs in addressing complex problems. However, there are few works that\nsystematically explore what methods can fully unlock the performance of LLMs\nand RLLMs within the financial domain. To investigate the impact of various\nmethods on LLMs and RLLMs, we utilize five LLMs and three RLLMs to assess the\neffects of prompting methods, agentic frameworks, and multilingual alignment\nmethods on financial question-answering tasks. Our research findings indicate:\n(1) Current prompting methods and agent frameworks enhance the performance of\nLLMs in financial question answering by simulating Long CoT; (2) RLLMs possess\ninherent Long CoT capabilities, which limits the effectiveness of conventional\nmethods in further enhancing their performance; (3) Current advanced\nmultilingual alignment methods primarily improve the multilingual performance\nof LLMs by extending the reasoning length, which yields minimal benefits for\nRLLMs. We hope that this study can serve as an important reference for LLMs and\nRLLMs in the field of financial question answering.",
        "url": "http://arxiv.org/abs/2507.08339v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08339v1",
        "arxiv_id": "2507.08339v1",
        "authors": [
            "Peng Wang",
            "Xuesi Hu",
            "Jiageng Wu",
            "Yuntao Zou",
            "Qiancheng Zhang",
            "Dagang Li"
        ],
        "submitted": "2025-07-11 06:37:44",
        "source": "arxiv",
        "comment": "Preprint"
    },
    {
        "title": "Distillation versus Contrastive Learning: How to Train Your Rerankers",
        "abstract": "Training text rerankers is crucial for information retrieval. Two primary\nstrategies are widely used: contrastive learning (optimizing directly on\nground-truth labels) and knowledge distillation (transferring knowledge from a\nlarger reranker). While both have been studied in the literature, a clear\ncomparison of their effectiveness for training cross-encoder rerankers under\npractical conditions is needed.\n  This paper empirically compares these strategies by training rerankers of\ndifferent sizes and architectures using both methods on the same data, with a\nstrong contrastive learning model acting as the distillation teacher. Our\nresults show that knowledge distillation generally yields better in-domain and\nout-of-domain ranking performance than contrastive learning when distilling\nfrom a larger teacher model. This finding is consistent across student model\nsizes and architectures. However, distilling from a teacher of the same\ncapacity does not provide the same advantage, particularly for out-of-domain\ntasks. These findings offer practical guidance for choosing a training strategy\nbased on available teacher models. Therefore, we recommend using knowledge\ndistillation to train smaller rerankers if a larger, more powerful teacher is\naccessible; in its absence, contrastive learning provides a strong and more\nreliable alternative otherwise.",
        "url": "http://arxiv.org/abs/2507.08336v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08336v1",
        "arxiv_id": "2507.08336v1",
        "authors": [
            "Zhichao Xu",
            "Zhiqi Huang",
            "Shengyao Zhuang",
            "Ashim Gupta",
            "Vivek Srikumar"
        ],
        "submitted": "2025-07-11 06:28:35",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MK2 at PBIG Competition: A Prompt Generation Solution",
        "abstract": "The Patent-Based Idea Generation task asks systems to turn real patents into\nproduct ideas viable within three years. We propose MK2, a prompt-centric\npipeline: Gemini 2.5 drafts and iteratively edits a prompt, grafting useful\nfragments from weaker outputs; GPT-4.1 then uses this prompt to create one idea\nper patent, and an Elo loop judged by Qwen3-8B selects the best prompt-all\nwithout extra training data. Across three domains, two evaluator types, and six\ncriteria, MK2 topped the automatic leaderboard and won 25 of 36 tests. Only the\nmaterials-chemistry track lagged, indicating the need for deeper domain\ngrounding; yet, the results show that lightweight prompt engineering has\nalready delivered competitive, commercially relevant ideation from patents.",
        "url": "http://arxiv.org/abs/2507.08335v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08335v1",
        "arxiv_id": "2507.08335v1",
        "authors": [
            "Yuzheng Xu",
            "Tosho Hirasawa",
            "Seiya Kawano",
            "Shota Kato",
            "Tadashi Kozuno"
        ],
        "submitted": "2025-07-11 06:27:42",
        "source": "arxiv",
        "comment": "9 pages, to appear in the 2nd Workshop on Agent AI for Scenario\n  Planning (AGENTSCEN 2025)"
    },
    {
        "title": "CRMAgent: A Multi-Agent LLM System for E-Commerce CRM Message Template Generation",
        "abstract": "In e-commerce private-domain channels such as instant messaging and e-mail,\nmerchants engage customers directly as part of their Customer Relationship\nManagement (CRM) programmes to drive retention and conversion. While a few top\nperformers excel at crafting outbound messages, most merchants struggle to\nwrite persuasive copy because they lack both expertise and scalable tools. We\nintroduce CRMAgent, a multi-agent system built on large language models (LLMs)\nthat generates high-quality message templates and actionable writing guidance\nthrough three complementary modes. First, group-based learning enables the\nagent to learn from a merchant's own top-performing messages within the same\naudience segment and rewrite low-performing ones. Second,\nretrieval-and-adaptation fetches templates that share the same audience segment\nand exhibit high similarity in voucher type and product category, learns their\nsuccessful patterns, and adapts them to the current campaign. Third, a\nrule-based fallback provides a lightweight zero-shot rewrite when no suitable\nreferences are available. Extensive experiments show that CRMAgent consistently\noutperforms merchants' original templates, delivering significant gains in both\naudience-match and marketing-effectiveness metrics.",
        "url": "http://arxiv.org/abs/2507.08325v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08325v1",
        "arxiv_id": "2507.08325v1",
        "authors": [
            "Yinzhu Quan",
            "Xinrui Li",
            "Ying Chen"
        ],
        "submitted": "2025-07-11 05:31:35",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Towards Efficient Quantity Retrieval from Text:an Approach via Description Parsing and Weak Supervision",
        "abstract": "Quantitative facts are continually generated by companies and governments,\nsupporting data-driven decision-making. While common facts are structured, many\nlong-tail quantitative facts remain buried in unstructured documents, making\nthem difficult to access. We propose the task of Quantity Retrieval: given a\ndescription of a quantitative fact, the system returns the relevant value and\nsupporting evidence. Understanding quantity semantics in context is essential\nfor this task. We introduce a framework based on description parsing that\nconverts text into structured (description, quantity) pairs for effective\nretrieval. To improve learning, we construct a large paraphrase dataset using\nweak supervision based on quantity co-occurrence. We evaluate our approach on a\nlarge corpus of financial annual reports and a newly annotated quantity\ndescription dataset. Our method significantly improves top-1 retrieval accuracy\nfrom 30.98 percent to 64.66 percent.",
        "url": "http://arxiv.org/abs/2507.08322v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08322v1",
        "arxiv_id": "2507.08322v1",
        "authors": [
            "Yixuan Cao",
            "Zhengrong Chen",
            "Chengxuan Xia",
            "Kun Wu",
            "Ping Luo"
        ],
        "submitted": "2025-07-11 05:25:09",
        "source": "arxiv",
        "comment": "Extended version of the paper accepted in DEXA 2025"
    },
    {
        "title": "Improving MLLM's Document Image Machine Translation via Synchronously Self-reviewing Its OCR Proficiency",
        "abstract": "Multimodal Large Language Models (MLLMs) have shown strong performance in\ndocument image tasks, especially Optical Character Recognition (OCR). However,\nthey struggle with Document Image Machine Translation (DIMT), which requires\nhandling both cross-modal and cross-lingual challenges. Previous efforts to\nenhance DIMT capability through Supervised Fine-Tuning (SFT) on the DIMT\ndataset often result in the forgetting of the model's existing monolingual\nabilities, such as OCR. To address these challenges, we introduce a novel\nfine-tuning paradigm, named Synchronously Self-Reviewing (SSR) its OCR\nproficiency, inspired by the concept \"Bilingual Cognitive Advantage\".\nSpecifically, SSR prompts the model to generate OCR text before producing\ntranslation text, which allows the model to leverage its strong monolingual OCR\nability while learning to translate text across languages. Comprehensive\nexperiments demonstrate the proposed SSR learning helps mitigate catastrophic\nforgetting, improving the generalization ability of MLLMs on both OCR and DIMT\ntasks.",
        "url": "http://arxiv.org/abs/2507.08309v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08309v1",
        "arxiv_id": "2507.08309v1",
        "authors": [
            "Yupu Liang",
            "Yaping Zhang",
            "Zhiyang Zhang",
            "Zhiyuan Chen",
            "Yang Zhao",
            "Lu Xiang",
            "Chengqing Zong",
            "Yu Zhou"
        ],
        "submitted": "2025-07-11 05:02:06",
        "source": "arxiv",
        "comment": "Accepted by ACL 2025 Findings"
    },
    {
        "title": "M2-Reasoning: Empowering MLLMs with Unified General and Spatial Reasoning",
        "abstract": "Recent advancements in Multimodal Large Language Models (MLLMs), particularly\nthrough Reinforcement Learning with Verifiable Rewards (RLVR), have\nsignificantly enhanced their reasoning abilities. However, a critical gap\npersists: these models struggle with dynamic spatial interactions, a capability\nessential for real-world applications. To bridge this gap, we introduce\nM2-Reasoning-7B, a model designed to excel in both general and spatial\nreasoning. Our approach integrates two key innovations: (1) a novel data\npipeline that generates 294.2K high-quality data samples (168K for cold-start\nfine-tuning and 126.2K for RLVR), which feature logically coherent reasoning\ntrajectories and have undergone comprehensive assessment; and (2) a dynamic\nmulti-task training strategy with step-wise optimization to mitigate conflicts\nbetween data, and task-specific rewards for delivering tailored incentive\nsignals. This combination of curated data and advanced training allows\nM2-Reasoning-7B to set a new state-of-the-art (SOTA) across 8 benchmarks,\nshowcasing superior performance in both general and spatial reasoning domains.",
        "url": "http://arxiv.org/abs/2507.08306v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08306v1",
        "arxiv_id": "2507.08306v1",
        "authors": [
            "Inclusion AI",
            ":",
            "Fudong Wang",
            "Jiajia Liu",
            "Jingdong Chen",
            "Jun Zhou",
            "Kaixiang Ji",
            "Lixiang Ru",
            "Qingpei Guo",
            "Ruobing Zheng",
            "Tianqi Li",
            "Yi Yuan",
            "Yifan Mao",
            "Yuting Xiao",
            "Ziping Ma"
        ],
        "submitted": "2025-07-11 04:44:07",
        "source": "arxiv",
        "comment": "31pages, 14 figures"
    },
    {
        "title": "KAT-V1: Kwai-AutoThink Technical Report",
        "abstract": "We present Kwaipilot-AutoThink (KAT), an open-source 40B large language model\ndeveloped to address the overthinking problem in reasoning-intensive tasks,\nwhere an automatic thinking training paradigm is proposed to dynamically switch\nbetween reasoning and non-reasoning modes based on task complexity.\nSpecifically, first, we construct the dual-regime dataset based on a novel\ntagging pipeline and a multi-agent synthesis strategy, and then we apply\nMulti-Token Prediction (MTP)-enhanced knowledge distillation, enabling\nefficient and fine-grained reasoning transfer with minimal pretraining cost.\nBesides, we implement a cold-start initialization strategy that introduces\nmode-selection priors using majority-vote signals and intent-aware prompting.\nFinally, we propose Step-SRPO, a reinforcement learning algorithm that\nincorporates intermediate supervision into the GRPO framework, offering\nstructured guidance over both reasoning-mode selection and response accuracy.\nExtensive experiments across multiple benchmarks demonstrate that KAT\nconsistently matches or even outperforms current state-of-the-art models,\nincluding DeepSeek-R1-0528 and Qwen3-235B-A22B, across a wide range of\nreasoning-intensive tasks while reducing token usage by up to approximately\n30\\%. Beyond academic evaluation, KAT has been successfully deployed in\nKwaipilot (i.e., Kuaishou's internal coding assistant), and improves real-world\ndevelopment workflows with high accuracy, efficiency, and controllable\nreasoning behaviors. Moreover, we are actively training a 200B\nMixture-of-Experts (MoE) with 40B activation parameters, where the early-stage\nresults already demonstrate promising improvements in performance and\nefficiency, further showing the scalability of the AutoThink paradigm.",
        "url": "http://arxiv.org/abs/2507.08297v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08297v1",
        "arxiv_id": "2507.08297v1",
        "authors": [
            "Zizheng Zhan",
            "Ken Deng",
            "Huaixi Tang",
            "Wen Xiang",
            "Kun Wu",
            "Weihao Li",
            "Wenqiang Zhu",
            "Jingxuan Xu",
            "Lecheng Huang",
            "Zongxian Feng",
            "Shaojie Wang",
            "Shangpeng Yan",
            "Jiaheng Liu",
            "Zhongyuan Peng",
            "Zuchen Gao",
            "Haoyang Huang",
            "Ziqi Zhan",
            "Yanan Wu",
            "Yuanxing Zhang",
            "Jian Yang",
            "Guang Chen",
            "Haotian Zhang",
            "Bin Chen",
            "Bing Yu"
        ],
        "submitted": "2025-07-11 04:07:10",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Lightweight Safety Guardrails via Synthetic Data and RL-guided Adversarial Training",
        "abstract": "We introduce a lightweight yet highly effective safety guardrail framework\nfor language models, demonstrating that small-scale language models can\nachieve, and even surpass, the performance of larger counterparts in content\nmoderation tasks. This is accomplished through high-fidelity synthetic data\ngeneration and adversarial training. The synthetic data generation process\nbegins with human-curated seed data, which undergoes query augmentation and\nparaphrasing to create diverse and contextually rich examples. This augmented\ndata is then subjected to multiple rounds of curation, ensuring high fidelity\nand relevance. Inspired by recent advances in the Generative Adversarial\nNetwork (GAN) architecture, our adversarial training employs reinforcement\nlearning to guide a generator that produces challenging synthetic examples.\nThese examples are used to fine-tune the safety classifier, enhancing its\nability to detect and mitigate harmful content. Additionally, we incorporate\nstrategies from recent research on efficient LLM training, leveraging the\ncapabilities of smaller models to improve the performance of larger generative\nmodels. With iterative adversarial training and the generation of diverse,\nhigh-quality synthetic data, our framework enables small language models (SLMs)\nto serve as robust safety guardrails. This approach not only reduces\ncomputational overhead but also enhances resilience against adversarial\nattacks, offering a scalable and efficient solution for content moderation in\nAI systems.",
        "url": "http://arxiv.org/abs/2507.08284v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08284v1",
        "arxiv_id": "2507.08284v1",
        "authors": [
            "Aleksei Ilin",
            "Gor Matevosyan",
            "Xueying Ma",
            "Vladimir Eremin",
            "Suhaa Dada",
            "Muqun Li",
            "Riyaaz Shaik",
            "Haluk Noyan Tokgozoglu"
        ],
        "submitted": "2025-07-11 03:17:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Transfer Learning and Mixup for Fine-Grained Few-Shot Fungi Classification",
        "abstract": "Accurate identification of fungi species presents a unique challenge in\ncomputer vision due to fine-grained inter-species variation and high\nintra-species variation. This paper presents our approach for the FungiCLEF\n2025 competition, which focuses on few-shot fine-grained visual categorization\n(FGVC) using the FungiTastic Few-Shot dataset. Our team (DS@GT) experimented\nwith multiple vision transformer models, data augmentation, weighted sampling,\nand incorporating textual information. We also explored generative AI models\nfor zero-shot classification using structured prompting but found them to\nsignificantly underperform relative to vision-based models. Our final model\noutperformed both competition baselines and highlighted the effectiveness of\ndomain specific pretraining and balanced sampling strategies. Our approach\nranked 35/74 on the private test set in post-completion evaluation, this\nsuggests additional work can be done on metadata selection and domain-adapted\nmulti-modal learning. Our code is available at\nhttps://github.com/dsgt-arc/fungiclef-2025.",
        "url": "http://arxiv.org/abs/2507.08248v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08248v1",
        "arxiv_id": "2507.08248v1",
        "authors": [
            "Jason Kahei Tam",
            "Murilo Gustineli",
            "Anthony Miyaguchi"
        ],
        "submitted": "2025-07-11 01:21:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Exploring Gender Differences in Chronic Pain Discussions on Reddit",
        "abstract": "Pain is an inherent part of human existence, manifesting as both physical and\nemotional experiences, and can be categorized as either acute or chronic. Over\nthe years, extensive research has been conducted to understand the causes of\npain and explore potential treatments, with contributions from various\nscientific disciplines. However, earlier studies often overlooked the role of\ngender in pain experiences. In this study, we utilized Natural Language\nProcessing (NLP) to analyze and gain deeper insights into individuals' pain\nexperiences, with a particular focus on gender differences. We successfully\nclassified posts into male and female corpora using the Hidden Attribute\nModel-Convolutional Neural Network (HAM-CNN), achieving an F1 score of 0.86 by\naggregating posts based on usernames. Our analysis revealed linguistic\ndifferences between genders, with female posts tending to be more emotionally\nfocused. Additionally, the study highlighted that conditions such as migraine\nand sinusitis are more prevalent among females and explored how pain medication\naffects individuals differently based on gender.",
        "url": "http://arxiv.org/abs/2507.08241v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08241v1",
        "arxiv_id": "2507.08241v1",
        "authors": [
            "Ancita Maria Andrade",
            "Tanvi Banerjee",
            "Ramakrishna Mundugar"
        ],
        "submitted": "2025-07-11 01:11:06",
        "source": "arxiv",
        "comment": "This is an extended version of the short paper accepted at ASONAM\n  2025"
    },
    {
        "title": "Can LLMs Reliably Simulate Real Students' Abilities in Mathematics and Reading Comprehension?",
        "abstract": "Large Language Models (LLMs) are increasingly used as proxy students in the\ndevelopment of Intelligent Tutoring Systems (ITSs) and in piloting test\nquestions. However, to what extent these proxy students accurately emulate the\nbehavior and characteristics of real students remains an open question. To\ninvestigate this, we collected a dataset of 489 items from the National\nAssessment of Educational Progress (NAEP), covering mathematics and reading\ncomprehension in grades 4, 8, and 12. We then apply an Item Response Theory\n(IRT) model to position 11 diverse and state-of-the-art LLMs on the same\nability scale as real student populations. Our findings reveal that, without\nguidance, strong general-purpose models consistently outperform the average\nstudent at every grade, while weaker or domain-mismatched models may align\nincidentally. Using grade-enforcement prompts changes models' performance, but\nwhether they align with the average grade-level student remains highly model-\nand prompt-specific: no evaluated model-prompt pair fits the bill across\nsubjects and grades, underscoring the need for new training and evaluation\nstrategies. We conclude by providing guidelines for the selection of viable\nproxies based on our findings.",
        "url": "http://arxiv.org/abs/2507.08232v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08232v1",
        "arxiv_id": "2507.08232v1",
        "authors": [
            "KV Aditya Srivatsa",
            "Kaushal Kumar Maurya",
            "Ekaterina Kochmar"
        ],
        "submitted": "2025-07-11 00:36:57",
        "source": "arxiv",
        "comment": "Accepted to the 20th Workshop on Innovative Use of NLP for Building\n  Educational Applications (BEA), co-located with ACL 2025"
    },
    {
        "title": "Simple Mechanistic Explanations for Out-Of-Context Reasoning",
        "abstract": "Out-of-context reasoning (OOCR) is a phenomenon in which fine-tuned LLMs\nexhibit surprisingly deep out-of-distribution generalization. Rather than\nlearning shallow heuristics, they implicitly internalize and act on the\nconsequences of observations scattered throughout the fine-tuning data. In this\nwork, we investigate this phenomenon mechanistically and find that many\ninstances of OOCR in the literature have a simple explanation: the LoRA\nfine-tuning essentially adds a constant steering vector, steering the model\ntowards a general concept. This improves performance on the fine-tuning task\nand in many other concept-related domains, causing the surprising\ngeneralization. Moreover, we can directly train steering vectors for these\ntasks from scratch, which also induces OOCR. We find that our results hold even\nfor a task that seems like it must involve conditional behavior (model\nbackdoors); it turns out that unconditionally adding a steering vector is\nsufficient. Overall, our work presents one explanation of what gets learned\nduring fine-tuning for OOCR tasks, contributing to the key question of why LLMs\ncan reason out of context, an advanced capability that is highly relevant to\ntheir safe and reliable deployment.",
        "url": "http://arxiv.org/abs/2507.08218v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08218v1",
        "arxiv_id": "2507.08218v1",
        "authors": [
            "Atticus Wang",
            "Joshua Engels",
            "Oliver Clive-Griffin"
        ],
        "submitted": "2025-07-10 23:47:05",
        "source": "arxiv",
        "comment": "ICML 2025 Workshop R2-FM"
    },
    {
        "title": "TruthTorchLM: A Comprehensive Library for Predicting Truthfulness in LLM Outputs",
        "abstract": "Generative Large Language Models (LLMs)inevitably produce untruthful\nresponses. Accurately predicting the truthfulness of these outputs is critical,\nespecially in high-stakes settings. To accelerate research in this domain and\nmake truthfulness prediction methods more accessible, we introduce TruthTorchLM\nan open-source, comprehensive Python library featuring over 30 truthfulness\nprediction methods, which we refer to as Truth Methods. Unlike existing\ntoolkits such as Guardrails, which focus solely on document-grounded\nverification, or LM-Polygraph, which is limited to uncertainty-based methods,\nTruthTorchLM offers a broad and extensible collection of techniques. These\nmethods span diverse tradeoffs in computational cost, access level (e.g.,\nblack-box vs white-box), grounding document requirements, and supervision type\n(self-supervised or supervised). TruthTorchLM is seamlessly compatible with\nboth HuggingFace and LiteLLM, enabling support for locally hosted and API-based\nmodels. It also provides a unified interface for generation, evaluation,\ncalibration, and long-form truthfulness prediction, along with a flexible\nframework for extending the library with new methods. We conduct an evaluation\nof representative truth methods on three datasets, TriviaQA, GSM8K, and\nFactScore-Bio. The code is available at https://github.com/Ybakman/TruthTorchLM",
        "url": "http://arxiv.org/abs/2507.08203v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08203v1",
        "arxiv_id": "2507.08203v1",
        "authors": [
            "Duygu Nur Yaldiz",
            "Yavuz Faruk Bakman",
            "Sungmin Kang",
            "Alperen Öziş",
            "Hayrettin Eren Yildiz",
            "Mitash Ashish Shah",
            "Zhiqi Huang",
            "Anoop Kumar",
            "Alfy Samuel",
            "Daben Liu",
            "Sai Praneeth Karimireddy",
            "Salman Avestimehr"
        ],
        "submitted": "2025-07-10 22:23:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Overview of the TREC 2021 deep learning track",
        "abstract": "This is the third year of the TREC Deep Learning track. As in previous years,\nwe leverage the MS MARCO datasets that made hundreds of thousands of human\nannotated training labels available for both passage and document ranking\ntasks. In addition, this year we refreshed both the document and the passage\ncollections which also led to a nearly four times increase in the document\ncollection size and nearly $16$ times increase in the size of the passage\ncollection. Deep neural ranking models that employ large scale pretraininig\ncontinued to outperform traditional retrieval methods this year. We also found\nthat single stage retrieval can achieve good performance on both tasks although\nthey still do not perform at par with multistage retrieval pipelines. Finally,\nthe increase in the collection size and the general data refresh raised some\nquestions about completeness of NIST judgments and the quality of the training\nlabels that were mapped to the new collections from the old ones which we\ndiscuss in this report.",
        "url": "http://arxiv.org/abs/2507.08191v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08191v1",
        "arxiv_id": "2507.08191v1",
        "authors": [
            "Nick Craswell",
            "Bhaskar Mitra",
            "Emine Yilmaz",
            "Daniel Campos",
            "Jimmy Lin"
        ],
        "submitted": "2025-07-10 21:58:41",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Distilling Empathy from Large Language Models",
        "abstract": "The distillation of knowledge from Large Language Models (LLMs) into Smaller\nLanguage Models (SLMs), preserving the capabilities and performance of LLMs\nwhile reducing model size, has played a key role in the proliferation of LLMs.\nBecause SLMs are considerably smaller than LLMs, they are often utilized in\ndomains where human interaction is frequent but resources are highly\nconstrained, e.g., smart phones. Therefore, it is crucial to ensure that\nempathy, a fundamental aspect of positive human interactions, already instilled\ninto LLMs, is retained by SLMs after distillation. In this paper, we develop a\ncomprehensive approach for effective empathy distillation from LLMs into SLMs.\nOur approach features a two-step fine-tuning process that fully leverages\ndatasets of empathetic dialogue responses distilled from LLMs. We explore\nseveral distillation methods beyond basic direct prompting and propose four\nunique sets of prompts for targeted empathy improvement to significantly\nenhance the empathy distillation process. Our evaluations demonstrate that SLMs\nfine-tuned through the two-step fine-tuning process with distillation datasets\nenhanced by the targeted empathy improvement prompts significantly outperform\nthe base SLM at generating empathetic responses with a win rate of 90%. Our\ntargeted empathy improvement prompts substantially outperform the basic direct\nprompting with a 10% improvement in win rate.",
        "url": "http://arxiv.org/abs/2507.08151v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08151v1",
        "arxiv_id": "2507.08151v1",
        "authors": [
            "Henry J. Xie",
            "Jinghan Zhang",
            "Xinhao Zhang",
            "Kunpeng Liu"
        ],
        "submitted": "2025-07-10 20:20:02",
        "source": "arxiv",
        "comment": "Accepted by SIGDIAL 2025"
    },
    {
        "title": "Compactor: Calibrated Query-Agnostic KV Cache Compression with Approximate Leverage Scores",
        "abstract": "Modern Large Language Models (LLMs) are increasingly trained to support very\nlarge context windows. Unfortunately the ability to use long contexts in\ngeneration is complicated by the large memory requirement of the KV cache,\nwhich scales linearly with the context length. This memory footprint is often\nthe dominant resource bottleneck in real-world deployments, limiting throughput\nand increasing serving cost. One way to address this is by compressing the KV\ncache, which can be done either with knowledge of the question being asked\n(query-aware) or without knowledge of the query (query-agnostic). We present\nCompactor, a parameter-free, query-agnostic KV compression strategy that uses\napproximate leverage scores to determine token importance. We show that\nCompactor can achieve the same performance as competing methods while retaining\n1/2 the tokens in both synthetic and real-world context tasks, with minimal\ncomputational overhead. We further introduce a procedure for context-calibrated\ncompression, which allows one to infer the maximum compression ratio a given\ncontext can support. Using context-calibrated compression, we show that\nCompactor achieves full KV performance on Longbench while reducing the KV\nmemory burden by 63%, on average. To demonstrate the efficacy and\ngeneralizability of our approach, we apply Compactor to 27 synthetic and\nreal-world tasks from RULER and Longbench, with models from both the Qwen 2.5\nand Llama 3.1 families.",
        "url": "http://arxiv.org/abs/2507.08143v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08143v1",
        "arxiv_id": "2507.08143v1",
        "authors": [
            "Vivek Chari",
            "Benjamin Van Durme"
        ],
        "submitted": "2025-07-10 20:03:35",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Audio Flamingo 3: Advancing Audio Intelligence with Fully Open Large Audio Language Models",
        "abstract": "We present Audio Flamingo 3 (AF3), a fully open state-of-the-art (SOTA) large\naudio-language model that advances reasoning and understanding across speech,\nsound, and music. AF3 introduces: (i) AF-Whisper, a unified audio encoder\ntrained using a novel strategy for joint representation learning across all 3\nmodalities of speech, sound, and music; (ii) flexible, on-demand thinking,\nallowing the model to do chain-of-thought-type reasoning before answering;\n(iii) multi-turn, multi-audio chat; (iv) long audio understanding and reasoning\n(including speech) up to 10 minutes; and (v) voice-to-voice interaction. To\nenable these capabilities, we propose several large-scale training datasets\ncurated using novel strategies, including AudioSkills-XL, LongAudio-XL,\nAF-Think, and AF-Chat, and train AF3 with a novel five-stage curriculum-based\ntraining strategy. Trained on only open-source audio data, AF3 achieves new\nSOTA results on over 20+ (long) audio understanding and reasoning benchmarks,\nsurpassing both open-weight and closed-source models trained on much larger\ndatasets.",
        "url": "http://arxiv.org/abs/2507.08128v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08128v1",
        "arxiv_id": "2507.08128v1",
        "authors": [
            "Arushi Goel",
            "Sreyan Ghosh",
            "Jaehyeon Kim",
            "Sonal Kumar",
            "Zhifeng Kong",
            "Sang-gil Lee",
            "Chao-Han Huck Yang",
            "Ramani Duraiswami",
            "Dinesh Manocha",
            "Rafael Valle",
            "Bryan Catanzaro"
        ],
        "submitted": "2025-07-10 19:40:21",
        "source": "arxiv",
        "comment": "Code, Datasets and Models: https://research.nvidia.com/labs/adlr/AF3/"
    },
    {
        "title": "Audit, Alignment, and Optimization of LM-Powered Subroutines with Application to Public Comment Processing",
        "abstract": "The advent of language models (LMs) has the potential to dramatically\naccelerate tasks that may be cast to text-processing; however, real-world\nadoption is hindered by concerns regarding safety, explainability, and bias.\nHow can we responsibly leverage LMs in a transparent, auditable manner --\nminimizing risk and allowing human experts to focus on informed decision-making\nrather than data-processing or prompt engineering? In this work, we propose a\nframework for declaring statically typed, LM-powered subroutines (i.e.,\ncallable, function-like procedures) for use within conventional asynchronous\ncode -- such that sparse feedback from human experts is used to improve the\nperformance of each subroutine online (i.e., during use). In our\nimplementation, all LM-produced artifacts (i.e., prompts, inputs, outputs, and\ndata-dependencies) are recorded and exposed to audit on demand. We package this\nframework as a library to support its adoption and continued development. While\nthis framework may be applicable across several real-world decision workflows\n(e.g., in healthcare and legal fields), we evaluate it in the context of public\ncomment processing as mandated by the 1969 National Environmental Protection\nAct (NEPA): Specifically, we use this framework to develop \"CommentNEPA,\" an\napplication that compiles, organizes, and summarizes a corpus of public\ncommentary submitted in response to a project requiring environmental review.\nWe quantitatively evaluate the application by comparing its outputs (when\noperating without human feedback) to historical ``ground-truth'' data as\nlabelled by human annotators during the preparation of official environmental\nimpact statements.",
        "url": "http://arxiv.org/abs/2507.08109v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08109v1",
        "arxiv_id": "2507.08109v1",
        "authors": [
            "Reilly Raab",
            "Mike Parker",
            "Dan Nally",
            "Sadie Montgomery",
            "Anastasia Bernat",
            "Sai Munikoti",
            "Sameera Horawalavithana"
        ],
        "submitted": "2025-07-10 18:52:09",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "GRASP: Generic Reasoning And SPARQL Generation across Knowledge Graphs",
        "abstract": "We propose a new approach for generating SPARQL queries on RDF knowledge\ngraphs from natural language questions or keyword queries, using a large\nlanguage model. Our approach does not require fine-tuning. Instead, it uses the\nlanguage model to explore the knowledge graph by strategically executing SPARQL\nqueries and searching for relevant IRIs and literals. We evaluate our approach\non a variety of benchmarks (for knowledge graphs of different kinds and sizes)\nand language models (of different scales and types, commercial as well as\nopen-source) and compare it with existing approaches. On Wikidata we reach\nstate-of-the-art results on multiple benchmarks, despite the zero-shot setting.\nOn Freebase we come close to the best few-shot methods. On other, less commonly\nevaluated knowledge graphs and benchmarks our approach also performs well\noverall. We conduct several additional studies, like comparing different ways\nof searching the graphs, incorporating a feedback mechanism, or making use of\nfew-shot examples.",
        "url": "http://arxiv.org/abs/2507.08107v1",
        "pdf_url": "http://arxiv.org/pdf/2507.08107v1",
        "arxiv_id": "2507.08107v1",
        "authors": [
            "Sebastian Walter",
            "Hannah Bast"
        ],
        "submitted": "2025-07-10 18:50:05",
        "source": "arxiv",
        "comment": null
    }
]