[
    {
        "title": "MIRAGE: Scaling Test-Time Inference with Parallel Graph-Retrieval-Augmented Reasoning Chains",
        "abstract": "Large reasoning models (LRMs) have shown significant progress in test-time\nscaling through chain-of-thought prompting. Current approaches like search-o1\nintegrate retrieval augmented generation (RAG) into multi-step reasoning\nprocesses but rely on a single, linear reasoning chain while incorporating\nunstructured textual information in a flat, context-agnostic manner. As a\nresult, these approaches can lead to error accumulation throughout the\nreasoning chain, which significantly limits its effectiveness in medical\nquestion-answering (QA) tasks where both accuracy and traceability are critical\nrequirements. To address these challenges, we propose MIRAGE (Multi-chain\nInference with Retrieval-Augmented Graph Exploration), a novel test-time\nscalable reasoning framework that performs dynamic multi-chain inference over\nstructured medical knowledge graphs. Specifically, MIRAGE 1) decomposes complex\nqueries into entity-grounded sub-questions, 2) executes parallel inference\nchains, 3) retrieves evidence adaptively via neighbor expansion and multi-hop\ntraversal, and 4) integrates answers using cross-chain verification to resolve\ncontradictions. Experiments on three medical QA benchmarks (GenMedGPT-5k,\nCMCQA, and ExplainCPE) show that MIRAGE consistently outperforms GPT-4o,\nTree-of-Thought variants, and other retrieval-augmented baselines in both\nautomatic and human evaluations. Additionally, MIRAGE improves interpretability\nby generating explicit reasoning chains that trace each factual claim to\nconcrete chains within the knowledge graph, making it well-suited for complex\nmedical reasoning scenarios. The code will be available for further research.",
        "url": "http://arxiv.org/abs/2508.18260v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18260v1",
        "arxiv_id": "2508.18260v1",
        "authors": [
            "Kaiwen Wei",
            "Rui Shan",
            "Dongsheng Zou",
            "Jianzhong Yang",
            "Bi Zhao",
            "Junnan Zhu",
            "Jiang Zhong"
        ],
        "submitted": "2025-08-25 17:53:22",
        "source": "arxiv",
        "comment": "10 pages, 8 figures (including tables), plus appendix. Submitted to\n  AAAI 2026"
    },
    {
        "title": "From BERT to LLMs: Comparing and Understanding Chinese Classifier Prediction in Language Models",
        "abstract": "Classifiers are an important and defining feature of the Chinese language,\nand their correct prediction is key to numerous educational applications. Yet,\nwhether the most popular Large Language Models (LLMs) possess proper knowledge\nthe Chinese classifiers is an issue that has largely remain unexplored in the\nNatural Language Processing (NLP) literature.\n  To address such a question, we employ various masking strategies to evaluate\nthe LLMs' intrinsic ability, the contribution of different sentence elements,\nand the working of the attention mechanisms during prediction. Besides, we\nexplore fine-tuning for LLMs to enhance the classifier performance.\n  Our findings reveal that LLMs perform worse than BERT, even with fine-tuning.\nThe prediction, as expected, greatly benefits from the information about the\nfollowing noun, which also explains the advantage of models with a\nbidirectional attention mechanism such as BERT.",
        "url": "http://arxiv.org/abs/2508.18253v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18253v1",
        "arxiv_id": "2508.18253v1",
        "authors": [
            "ZiqiZhang",
            "Jianfei Ma",
            "Emmanuele Chersoni",
            "Jieshun You",
            "Zhaoxin Feng"
        ],
        "submitted": "2025-08-25 17:41:46",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Demographic Biases and Gaps in the Perception of Sexism in Large Language Models",
        "abstract": "The use of Large Language Models (LLMs) has proven to be a tool that could\nhelp in the automatic detection of sexism. Previous studies have shown that\nthese models contain biases that do not accurately reflect reality, especially\nfor minority groups. Despite various efforts to improve the detection of sexist\ncontent, this task remains a significant challenge due to its subjective nature\nand the biases present in automated models. We explore the capabilities of\ndifferent LLMs to detect sexism in social media text using the EXIST 2024 tweet\ndataset. It includes annotations from six distinct profiles for each tweet,\nallowing us to evaluate to what extent LLMs can mimic these groups' perceptions\nin sexism detection. Additionally, we analyze the demographic biases present in\nthe models and conduct a statistical analysis to identify which demographic\ncharacteristics (age, gender) contribute most effectively to this task. Our\nresults show that, while LLMs can to some extent detect sexism when considering\nthe overall opinion of populations, they do not accurately replicate the\ndiversity of perceptions among different demographic groups. This highlights\nthe need for better-calibrated models that account for the diversity of\nperspectives across different populations.",
        "url": "http://arxiv.org/abs/2508.18245v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18245v1",
        "arxiv_id": "2508.18245v1",
        "authors": [
            "Judith Tavarez-Rodríguez",
            "Fernando Sánchez-Vega",
            "A. Pastor López-Monroy"
        ],
        "submitted": "2025-08-25 17:36:58",
        "source": "arxiv",
        "comment": "This work was presented as a poster at the Latin American Meeting in\n  Artificial Intelligence KHIPU 2025, Santiago, Chile, March 10th - 14th 2025,\n  https://khipu.ai/khipu2025/poster-sessions-2025/"
    },
    {
        "title": "Better Language Model-Based Judging Reward Modeling through Scaling Comprehension Boundaries",
        "abstract": "The emergence of LM-based judging reward modeling, represented by generative\nreward models, has successfully made reinforcement learning from AI feedback\n(RLAIF) efficient and scalable. To further advance this paradigm, we propose a\ncore insight: this form of reward modeling shares fundamental formal\nconsistency with natural language inference (NLI), a core task in natural\nlanguage understanding. This reframed perspective points to a key path for\nbuilding superior reward models: scaling the model's comprehension boundaries.\nPursuing this path, exploratory experiments on NLI tasks demonstrate that the\nslot prediction masked language models (MLMs) incorporating contextual\nexplanations achieve significantly better performance compared to mainstream\nautoregressive models. Based on this key finding, we propose ESFP-RM, a\ntwo-stage LM-based judging reward model that utilizes an explanation based slot\nframework for prediction to fully leverage the advantages of MLMs. Extensive\nexperiments demonstrate that in both reinforcement learning from human feedback\n(RLHF) and out-of-distribution (OOD) scenarios, the ESFP-RM framework delivers\nmore stable and generalizable reward signals compared to generative reward\nmodels.",
        "url": "http://arxiv.org/abs/2508.18212v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18212v1",
        "arxiv_id": "2508.18212v1",
        "authors": [
            "Meiling Ning",
            "Zhongbao Zhang",
            "Junda Ye",
            "Jiabao Guo",
            "Qingyuan Guan"
        ],
        "submitted": "2025-08-25 17:11:28",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Why Synthetic Isn't Real Yet: A Diagnostic Framework for Contact Center Dialogue Generation",
        "abstract": "Synthetic transcript generation is critical in contact center domains, where\nprivacy and data scarcity limit model training and evaluation. Unlike prior\nsynthetic dialogue generation work on open-domain or medical dialogues, contact\ncenter conversations are goal-oriented, role-asymmetric, and behaviorally\ncomplex, featuring disfluencies, ASR noise, and compliance-driven agent\nactions. In deployments where transcripts are unavailable, standard pipelines\nstill yield derived call attributes such as Intent Summaries, Topic Flow, and\nQA Evaluation Forms. We leverage these as supervision signals to guide\ngeneration. To assess the quality of such outputs, we introduce a diagnostic\nframework of 18 linguistically and behaviorally grounded metrics for comparing\nreal and synthetic transcripts. We benchmark four language-agnostic generation\nstrategies, from simple prompting to characteristic-aware multi-stage\napproaches, alongside reference-free baselines. Results reveal persistent\nchallenges: no method excels across all traits, with notable deficits in\ndisfluency, sentiment, and behavioral realism. Our diagnostic tool exposes\nthese gaps, enabling fine-grained evaluation and stress testing of synthetic\ndialogue across languages.",
        "url": "http://arxiv.org/abs/2508.18210v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18210v1",
        "arxiv_id": "2508.18210v1",
        "authors": [
            "Rishikesh Devanathan",
            "Varun Nathan",
            "Ayush Kumar"
        ],
        "submitted": "2025-08-25 17:10:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Exploring the Interplay between Musical Preferences and Personality through the Lens of Language",
        "abstract": "Music serves as a powerful reflection of individual identity, often aligning\nwith deeper psychological traits. Prior research has established correlations\nbetween musical preferences and personality traits, while separate studies have\ndemonstrated that personality is detectable through linguistic analysis. Our\nstudy bridges these two research domains by investigating whether individuals'\nmusical preferences are recognizable in their spontaneous language through the\nlens of the Big Five personality traits (Openness, Conscientiousness,\nExtroversion, Agreeableness, and Neuroticism). Using a carefully curated\ndataset of over 500,000 text samples from nearly 5,000 authors with reliably\nidentified musical preferences, we build advanced models to assess personality\ncharacteristics. Our results reveal significant personality differences across\nfans of five musical genres. We release resources for future research at the\nintersection of computational linguistics, music psychology and personality\nanalysis.",
        "url": "http://arxiv.org/abs/2508.18208v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18208v1",
        "arxiv_id": "2508.18208v1",
        "authors": [
            "Eliran Shem-Tov",
            "Ella Rabinovich"
        ],
        "submitted": "2025-08-25 17:10:08",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Unraveling the cognitive patterns of Large Language Models through module communities",
        "abstract": "Large Language Models (LLMs) have reshaped our world with significant\nadvancements in science, engineering, and society through applications ranging\nfrom scientific discoveries and medical diagnostics to Chatbots. Despite their\nubiquity and utility, the underlying mechanisms of LLM remain concealed within\nbillions of parameters and complex structures, making their inner architecture\nand cognitive processes challenging to comprehend. We address this gap by\nadopting approaches to understanding emerging cognition in biology and\ndeveloping a network-based framework that links cognitive skills, LLM\narchitectures, and datasets, ushering in a paradigm shift in foundation model\nanalysis. The skill distribution in the module communities demonstrates that\nwhile LLMs do not strictly parallel the focalized specialization observed in\nspecific biological systems, they exhibit unique communities of modules whose\nemergent skill patterns partially mirror the distributed yet interconnected\ncognitive organization seen in avian and small mammalian brains. Our numerical\nresults highlight a key divergence from biological systems to LLMs, where skill\nacquisition benefits substantially from dynamic, cross-regional interactions\nand neural plasticity. By integrating cognitive science principles with machine\nlearning, our framework provides new insights into LLM interpretability and\nsuggests that effective fine-tuning strategies should leverage distributed\nlearning dynamics rather than rigid modular interventions.",
        "url": "http://arxiv.org/abs/2508.18192v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18192v1",
        "arxiv_id": "2508.18192v1",
        "authors": [
            "Kushal Raj Bhandari",
            "Pin-Yu Chen",
            "Jianxi Gao"
        ],
        "submitted": "2025-08-25 16:49:38",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ST-Raptor: LLM-Powered Semi-Structured Table Question Answering",
        "abstract": "Semi-structured tables, widely used in real-world applications (e.g.,\nfinancial reports, medical records, transactional orders), often involve\nflexible and complex layouts (e.g., hierarchical headers and merged cells).\nThese tables generally rely on human analysts to interpret table layouts and\nanswer relevant natural language questions, which is costly and inefficient. To\nautomate the procedure, existing methods face significant challenges. First,\nmethods like NL2SQL require converting semi-structured tables into structured\nones, which often causes substantial information loss. Second, methods like\nNL2Code and multi-modal LLM QA struggle to understand the complex layouts of\nsemi-structured tables and cannot accurately answer corresponding questions. To\nthis end, we propose ST-Raptor, a tree-based framework for semi-structured\ntable question answering using large language models. First, we introduce the\nHierarchical Orthogonal Tree (HO-Tree), a structural model that captures\ncomplex semi-structured table layouts, along with an effective algorithm for\nconstructing the tree. Second, we define a set of basic tree operations to\nguide LLMs in executing common QA tasks. Given a user question, ST-Raptor\ndecomposes it into simpler sub-questions, generates corresponding tree\noperation pipelines, and conducts operation-table alignment for accurate\npipeline execution. Third, we incorporate a two-stage verification mechanism:\nforward validation checks the correctness of execution steps, while backward\nvalidation evaluates answer reliability by reconstructing queries from\npredicted answers. To benchmark the performance, we present SSTQA, a dataset of\n764 questions over 102 real-world semi-structured tables. Experiments show that\nST-Raptor outperforms nine baselines by up to 20% in answer accuracy. The code\nis available at https://github.com/weAIDB/ST-Raptor.",
        "url": "http://arxiv.org/abs/2508.18190v2",
        "pdf_url": "http://arxiv.org/pdf/2508.18190v2",
        "arxiv_id": "2508.18190v2",
        "authors": [
            "Zirui Tang",
            "Boyu Niu",
            "Xuanhe Zhou",
            "Boxiu Li",
            "Wei Zhou",
            "Jiannan Wang",
            "Guoliang Li",
            "Xinyi Zhang",
            "Fan Wu"
        ],
        "submitted": "2025-08-25 16:48:51",
        "source": "arxiv",
        "comment": "Extension of our SIGMOD 2026 paper. Please refer to source code\n  available at: https://github.com/weAIDB/ST-Raptor"
    },
    {
        "title": "Leveraging Large Language Models for Accurate Sign Language Translation in Low-Resource Scenarios",
        "abstract": "Translating natural languages into sign languages is a highly complex and\nunderexplored task. Despite growing interest in accessibility and inclusivity,\nthe development of robust translation systems remains hindered by the limited\navailability of parallel corpora which align natural language with sign\nlanguage data. Existing methods often struggle to generalize in these\ndata-scarce environments, as the few datasets available are typically\ndomain-specific, lack standardization, or fail to capture the full linguistic\nrichness of sign languages. To address this limitation, we propose Advanced Use\nof LLMs for Sign Language Translation (AulSign), a novel method that leverages\nLarge Language Models via dynamic prompting and in-context learning with sample\nselection and subsequent sign association. Despite their impressive abilities\nin processing text, LLMs lack intrinsic knowledge of sign languages; therefore,\nthey are unable to natively perform this kind of translation. To overcome this\nlimitation, we associate the signs with compact descriptions in natural\nlanguage and instruct the model to use them. We evaluate our method on both\nEnglish and Italian languages using SignBank+, a recognized benchmark in the\nfield, as well as the Italian LaCAM CNR-ISTC dataset. We demonstrate superior\nperformance compared to state-of-the-art models in low-data scenario. Our\nfindings demonstrate the effectiveness of AulSign, with the potential to\nenhance accessibility and inclusivity in communication technologies for\nunderrepresented linguistic communities.",
        "url": "http://arxiv.org/abs/2508.18183v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18183v1",
        "arxiv_id": "2508.18183v1",
        "authors": [
            "Luana Bulla",
            "Gabriele Tuccio",
            "Misael Mongiovì",
            "Aldo Gangemi"
        ],
        "submitted": "2025-08-25 16:36:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Improving End-to-End Training of Retrieval-Augmented Generation Models via Joint Stochastic Approximation",
        "abstract": "Retrieval-augmented generation (RAG) has become a widely recognized paradigm\nto combine parametric memory with non-parametric memories. An RAG model\nconsists of two serial connecting components (retriever and generator). A major\nchallenge in end-to-end optimization of the RAG model is that marginalization\nover relevant passages (modeled as discrete latent variables) from a knowledge\nbase is required. Traditional top-K marginalization and variational RAG (VRAG)\nsuffer from biased or high-variance gradient estimates. In this paper, we\npropose and develop joint stochastic approximation (JSA) based end-to-end\ntraining of RAG, which is referred to as JSA-RAG. The JSA algorithm is a\nstochastic extension of the EM (expectation-maximization) algorithm and is\nparticularly powerful in estimating discrete latent variable models. Extensive\nexperiments are conducted on five datasets for two tasks (open-domain question\nanswering, knowledge-grounded dialogs) and show that JSA-RAG significantly\noutperforms both vanilla RAG and VRAG. Further analysis shows the efficacy of\nJSA-RAG from the perspectives of generation, retrieval, and low-variance\ngradient estimate.",
        "url": "http://arxiv.org/abs/2508.18168v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18168v1",
        "arxiv_id": "2508.18168v1",
        "authors": [
            "Hongyu Cao",
            "Yuxuan Wu",
            "Yucheng Cai",
            "Xianyu Zhao",
            "Zhijian Ou"
        ],
        "submitted": "2025-08-25 16:17:16",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DiscussLLM: Teaching Large Language Models When to Speak",
        "abstract": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\nunderstanding and generating human-like text, yet they largely operate as\nreactive agents, responding only when directly prompted. This passivity creates\nan \"awareness gap,\" limiting their potential as truly collaborative partners in\ndynamic human discussions. We introduce $\\textit{DiscussLLM}$, a framework\ndesigned to bridge this gap by training models to proactively decide not just\n$\\textit{what}$ to say, but critically, $\\textit{when}$ to speak. Our primary\ncontribution is a scalable two-stage data generation pipeline that synthesizes\na large-scale dataset of realistic multi-turn human discussions. Each\ndiscussion is annotated with one of five intervention types (e.g., Factual\nCorrection, Concept Definition) and contains an explicit conversational trigger\nwhere an AI intervention adds value. By training models to predict a special\nsilent token when no intervention is needed, they learn to remain quiet until a\nhelpful contribution can be made. We explore two architectural baselines: an\nintegrated end-to-end model and a decoupled classifier-generator system\noptimized for low-latency inference. We evaluate these models on their ability\nto accurately time interventions and generate helpful responses, paving the way\nfor more situationally aware and proactive conversational AI.",
        "url": "http://arxiv.org/abs/2508.18167v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18167v1",
        "arxiv_id": "2508.18167v1",
        "authors": [
            "Deep Anil Patel",
            "Iain Melvin",
            "Christopher Malon",
            "Martin Renqiang Min"
        ],
        "submitted": "2025-08-25 16:16:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "PCR-CA: Parallel Codebook Representations with Contrastive Alignment for Multiple-Category App Recommendation",
        "abstract": "Modern app store recommender systems struggle with multiple-category apps, as\ntraditional taxonomies fail to capture overlapping semantics, leading to\nsuboptimal personalization. We propose PCR-CA (Parallel Codebook\nRepresentations with Contrastive Alignment), an end-to-end framework for\nimproved CTR prediction. PCR-CA first extracts compact multimodal embeddings\nfrom app text, then introduces a Parallel Codebook VQ-AE module that learns\ndiscrete semantic representations across multiple codebooks in parallel --\nunlike hierarchical residual quantization (RQ-VAE). This design enables\nindependent encoding of diverse aspects (e.g., gameplay, art style), better\nmodeling multiple-category semantics. To bridge semantic and collaborative\nsignals, we employ a contrastive alignment loss at both the user and item\nlevels, enhancing representation learning for long-tail items. Additionally, a\ndual-attention fusion mechanism combines ID-based and semantic features to\ncapture user interests, especially for long-tail apps. Experiments on a\nlarge-scale dataset show PCR-CA achieves a +0.76% AUC improvement over strong\nbaselines, with +2.15% AUC gains for long-tail apps. Online A/B testing further\nvalidates our approach, showing a +10.52% lift in CTR and a +16.30% improvement\nin CVR, demonstrating PCR-CA's effectiveness in real-world deployment. The new\nframework has now been fully deployed on the Microsoft Store.",
        "url": "http://arxiv.org/abs/2508.18166v2",
        "pdf_url": "http://arxiv.org/pdf/2508.18166v2",
        "arxiv_id": "2508.18166v2",
        "authors": [
            "Bin Tan",
            "Wangyao Ge",
            "Yidi Wang",
            "Xin Liu",
            "Jeff Burtoft",
            "Hao Fan",
            "Hui Wang"
        ],
        "submitted": "2025-08-25 16:16:06",
        "source": "arxiv",
        "comment": "9 pages, 4 figures, conference"
    },
    {
        "title": "S2Sent: Nested Selectivity Aware Sentence Representation Learning",
        "abstract": "The combination of Transformer-based encoders with contrastive learning\nrepresents the current mainstream paradigm for sentence representation\nlearning. This paradigm is typically based on the hidden states of the last\nTransformer block of the encoder. However, within Transformer-based encoders,\ndifferent blocks exhibit varying degrees of semantic perception ability. From\nthe perspective of interpretability, the semantic perception potential of\nknowledge neurons is modulated by stimuli, thus rational cross-block\nrepresentation fusion is a direction worth optimizing. To balance the semantic\nredundancy and loss across block fusion, we propose a sentence representation\nselection mechanism S\\textsuperscript{2}Sent, which integrates a parameterized\nnested selector downstream of the Transformer-based encoder. This selector\nperforms spatial selection (SS) and nested frequency selection (FS) from a\nmodular perspective. The SS innovatively employs a spatial squeeze based\nself-gating mechanism to obtain adaptive weights, which not only achieves\nfusion with low information redundancy but also captures the dependencies\nbetween embedding features. The nested FS replaces GAP with different DCT basis\nfunctions to achieve spatial squeeze with low semantic loss. Extensive\nexperiments have demonstrated that S\\textsuperscript{2}Sent achieves\nsignificant improvements over baseline methods with negligible additional\nparameters and inference latency, while highlighting high integrability and\nscalability.",
        "url": "http://arxiv.org/abs/2508.18164v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18164v1",
        "arxiv_id": "2508.18164v1",
        "authors": [
            "Jianxiang Zang",
            "Nijia Mo",
            "Yonda Wei",
            "Meiling Ning",
            "Hui Liu"
        ],
        "submitted": "2025-08-25 16:13:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Mirroring Users: Towards Building Preference-aligned User Simulator with User Feedback in Recommendation",
        "abstract": "User simulation is increasingly vital to develop and evaluate recommender\nsystems (RSs). While Large Language Models (LLMs) offer promising avenues to\nsimulate user behavior, they often struggle with the absence of specific domain\nalignment required for RSs and the efficiency demands of large-scale\nsimulation. A vast yet underutilized resource for enhancing this alignment is\nthe extensive user feedback inherent in RSs. However, directly leveraging such\nfeedback presents two significant challenges. First, user feedback in RSs is\noften ambiguous and noisy, which negatively impacts effective preference\nalignment. Second, the massive volume of feedback largely hinders the\nefficiency of preference alignment, necessitating an efficient filtering\nmechanism to identify more informative samples. To overcome these hurdles, we\nintroduce a novel data construction framework that leverages user feedback in\nRSs with advanced LLM capabilities to generate high-quality simulation data.\nOur framework unfolds in two key phases: (1) employing LLMs to generate\ncognitive decision-making processes on constructed simulation samples, reducing\nambiguity in raw user feedback; (2) data distillation based on uncertainty\nestimation and behavior sampling to filter challenging yet denoised simulation\nsamples. Accordingly, we fine-tune lightweight LLMs, as user simulators, using\nsuch high-quality dataset with corresponding decision-making processes.\nExtensive experiments verify that our framework significantly boosts the\nalignment with human preferences and in-domain reasoning capabilities of\nfine-tuned LLMs, and provides more insightful and interpretable signals when\ninteracting with RSs. We believe our work will advance the RS community and\noffer valuable insights for broader human-centric AI research.",
        "url": "http://arxiv.org/abs/2508.18142v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18142v1",
        "arxiv_id": "2508.18142v1",
        "authors": [
            "Tianjun Wei",
            "Huizhong Guo",
            "Yingpeng Du",
            "Zhu Sun",
            "Chen Huang",
            "Dongxia Wang",
            "Jie Zhang"
        ],
        "submitted": "2025-08-25 15:51:24",
        "source": "arxiv",
        "comment": "Github: https://github.com/UserMirrorer/UserMirrorer"
    },
    {
        "title": "Test-Time Scaling Strategies for Generative Retrieval in Multimodal Conversational Recommendations",
        "abstract": "The rapid evolution of e-commerce has exposed the limitations of traditional\nproduct retrieval systems in managing complex, multi-turn user interactions.\nRecent advances in multimodal generative retrieval -- particularly those\nleveraging multimodal large language models (MLLMs) as retrievers -- have shown\npromise. However, most existing methods are tailored to single-turn scenarios\nand struggle to model the evolving intent and iterative nature of multi-turn\ndialogues when applied naively. Concurrently, test-time scaling has emerged as\na powerful paradigm for improving large language model (LLM) performance\nthrough iterative inference-time refinement. Yet, its effectiveness typically\nrelies on two conditions: (1) a well-defined problem space (e.g., mathematical\nreasoning), and (2) the model's ability to self-correct -- conditions that are\nrarely met in conversational product search. In this setting, user queries are\noften ambiguous and evolving, and MLLMs alone have difficulty grounding\nresponses in a fixed product corpus. Motivated by these challenges, we propose\na novel framework that introduces test-time scaling into conversational\nmultimodal product retrieval. Our approach builds on a generative retriever,\nfurther augmented with a test-time reranking (TTR) mechanism that improves\nretrieval accuracy and better aligns results with evolving user intent\nthroughout the dialogue. Experiments across multiple benchmarks show consistent\nimprovements, with average gains of 14.5 points in MRR and 10.6 points in\nnDCG@1.",
        "url": "http://arxiv.org/abs/2508.18132v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18132v1",
        "arxiv_id": "2508.18132v1",
        "authors": [
            "Hung-Chun Hsu",
            "Yuan-Ching Kuo",
            "Chao-Han Huck Yang",
            "Szu-Wei Fu",
            "Hanrong Ye",
            "Hongxu Yin",
            "Yu-Chiang Frank Wang",
            "Ming-Feng Tsai",
            "Chuan-Ju Wang"
        ],
        "submitted": "2025-08-25 15:38:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "HLLM-Creator: Hierarchical LLM-based Personalized Creative Generation",
        "abstract": "AI-generated content technologies are widely used in content creation.\nHowever, current AIGC systems rely heavily on creators' inspiration, rarely\ngenerating truly user-personalized content. In real-world applications such as\nonline advertising, a single product may have multiple selling points, with\ndifferent users focusing on different features. This underscores the\nsignificant value of personalized, user-centric creative generation. Effective\npersonalized content generation faces two main challenges: (1) accurately\nmodeling user interests and integrating them into the content generation\nprocess while adhering to factual constraints, and (2) ensuring high efficiency\nand scalability to handle the massive user base in industrial scenarios.\nAdditionally, the scarcity of personalized creative data in practice\ncomplicates model training, making data construction another key hurdle. We\npropose HLLM-Creator, a hierarchical LLM framework for efficient user interest\nmodeling and personalized content generation. During inference, a combination\nof user clustering and a user-ad-matching-prediction based pruning strategy is\nemployed to significantly enhance generation efficiency and reduce\ncomputational overhead, making the approach suitable for large-scale\ndeployment. Moreover, we design a data construction pipeline based on\nchain-of-thought reasoning, which generates high-quality, user-specific\ncreative titles and ensures factual consistency despite limited personalized\ndata. This pipeline serves as a critical foundation for the effectiveness of\nour model. Extensive experiments on personalized title generation for Douyin\nSearch Ads show the effectiveness of HLLM-Creator. Online A/B test shows a\n0.476% increase on Adss, paving the way for more effective and efficient\npersonalized generation in industrial scenarios. Codes for academic dataset are\navailable at https://github.com/bytedance/HLLM.",
        "url": "http://arxiv.org/abs/2508.18118v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18118v1",
        "arxiv_id": "2508.18118v1",
        "authors": [
            "Junyi Chen",
            "Lu Chi",
            "Siliang Xu",
            "Shiwei Ran",
            "Bingyue Peng",
            "Zehuan Yuan"
        ],
        "submitted": "2025-08-25 15:23:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "The AI Data Scientist",
        "abstract": "Imagine decision-makers uploading data and, within minutes, receiving clear,\nactionable insights delivered straight to their fingertips. That is the promise\nof the AI Data Scientist, an autonomous Agent powered by large language models\n(LLMs) that closes the gap between evidence and action. Rather than simply\nwriting code or responding to prompts, it reasons through questions, tests\nideas, and delivers end-to-end insights at a pace far beyond traditional\nworkflows. Guided by the scientific tenet of the hypothesis, this Agent\nuncovers explanatory patterns in data, evaluates their statistical\nsignificance, and uses them to inform predictive modeling. It then translates\nthese results into recommendations that are both rigorous and accessible. At\nthe core of the AI Data Scientist is a team of specialized LLM Subagents, each\nresponsible for a distinct task such as data cleaning, statistical testing,\nvalidation, and plain-language communication. These Subagents write their own\ncode, reason about causality, and identify when additional data is needed to\nsupport sound conclusions. Together, they achieve in minutes what might\notherwise take days or weeks, enabling a new kind of interaction that makes\ndeep data science both accessible and actionable.",
        "url": "http://arxiv.org/abs/2508.18113v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18113v1",
        "arxiv_id": "2508.18113v1",
        "authors": [
            "Farkhad Akimov",
            "Munachiso Samuel Nwadike",
            "Zangir Iklassov",
            "Martin Takáč"
        ],
        "submitted": "2025-08-25 15:21:49",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SentiMM: A Multimodal Multi-Agent Framework for Sentiment Analysis in Social Media",
        "abstract": "With the increasing prevalence of multimodal content on social media,\nsentiment analysis faces significant challenges in effectively processing\nheterogeneous data and recognizing multi-label emotions. Existing methods often\nlack effective cross-modal fusion and external knowledge integration. We\npropose SentiMM, a novel multi-agent framework designed to systematically\naddress these challenges. SentiMM processes text and visual inputs through\nspecialized agents, fuses multimodal features, enriches context via knowledge\nretrieval, and aggregates results for final sentiment classification. We also\nintroduce SentiMMD, a large-scale multimodal dataset with seven fine-grained\nsentiment categories. Extensive experiments demonstrate that SentiMM achieves\nsuperior performance compared to state-of-the-art baselines, validating the\neffectiveness of our structured approach.",
        "url": "http://arxiv.org/abs/2508.18108v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18108v1",
        "arxiv_id": "2508.18108v1",
        "authors": [
            "Xilai Xu",
            "Zilin Zhao",
            "Chengye Song",
            "Zining Wang",
            "Jinhe Qiang",
            "Jiongrui Yan",
            "Yuhuai Lin"
        ],
        "submitted": "2025-08-25 15:17:53",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Detecting and Characterizing Planning in Language Models",
        "abstract": "Modern large language models (LLMs) have demonstrated impressive performance\nacross a wide range of multi-step reasoning tasks. Recent work suggests that\nLLMs may perform planning - selecting a future target token in advance and\ngenerating intermediate tokens that lead towards it - rather than merely\nimprovising one token at a time. However, existing studies assume fixed\nplanning horizons and often focus on single prompts or narrow domains. To\ndistinguish planning from improvisation across models and tasks, we present\nformal and causally grounded criteria for detecting planning and operationalize\nthem as a semi-automated annotation pipeline. We apply this pipeline to both\nbase and instruction-tuned Gemma-2-2B models on the MBPP code generation\nbenchmark and a poem generation task where Claude 3.5 Haiku was previously\nshown to plan. Our findings show that planning is not universal: unlike Haiku,\nGemma-2-2B solves the same poem generation task through improvisation, and on\nMBPP it switches between planning and improvisation across similar tasks and\neven successive token predictions. We further show that instruction tuning\nrefines existing planning behaviors in the base model rather than creating them\nfrom scratch. Together, these studies provide a reproducible and scalable\nfoundation for mechanistic studies of planning in LLMs.",
        "url": "http://arxiv.org/abs/2508.18098v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18098v1",
        "arxiv_id": "2508.18098v1",
        "authors": [
            "Jatin Nainani",
            "Sankaran Vaidyanathan",
            "Connor Watts",
            "Andre N. Assis",
            "Alice Rigg"
        ],
        "submitted": "2025-08-25 14:59:46",
        "source": "arxiv",
        "comment": "9 pages, 4 figures"
    },
    {
        "title": "Agri-Query: A Case Study on RAG vs. Long-Context LLMs for Cross-Lingual Technical Question Answering",
        "abstract": "We present a case study evaluating large language models (LLMs) with\n128K-token context windows on a technical question answering (QA) task. Our\nbenchmark is built on a user manual for an agricultural machine, available in\nEnglish, French, and German. It simulates a cross-lingual information retrieval\nscenario where questions are posed in English against all three language\nversions of the manual. The evaluation focuses on realistic\n\"needle-in-a-haystack\" challenges and includes unanswerable questions to test\nfor hallucinations. We compare nine long-context LLMs using direct prompting\nagainst three Retrieval-Augmented Generation (RAG) strategies (keyword,\nsemantic, hybrid), with an LLM-as-a-judge for evaluation. Our findings for this\nspecific manual show that Hybrid RAG consistently outperforms direct\nlong-context prompting. Models like Gemini 2.5 Flash and the smaller Qwen 2.5\n7B achieve high accuracy (over 85%) across all languages with RAG. This paper\ncontributes a detailed analysis of LLM performance in a specialized industrial\ndomain and an open framework for similar evaluations, highlighting practical\ntrade-offs and challenges.",
        "url": "http://arxiv.org/abs/2508.18093v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18093v1",
        "arxiv_id": "2508.18093v1",
        "authors": [
            "Julius Gun",
            "Timo Oksanen"
        ],
        "submitted": "2025-08-25 14:54:46",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Speech-Based Depressive Mood Detection in the Presence of Multiple Sclerosis: A Cross-Corpus and Cross-Lingual Study",
        "abstract": "Depression commonly co-occurs with neurodegenerative disorders like Multiple\nSclerosis (MS), yet the potential of speech-based Artificial Intelligence for\ndetecting depression in such contexts remains unexplored. This study examines\nthe transferability of speech-based depression detection methods to people with\nMS (pwMS) through cross-corpus and cross-lingual analysis using English data\nfrom the general population and German data from pwMS. Our approach implements\nsupervised machine learning models using: 1) conventional speech and language\nfeatures commonly used in the field, 2) emotional dimensions derived from a\nSpeech Emotion Recognition (SER) model, and 3) exploratory speech feature\nanalysis. Despite limited data, our models detect depressive mood in pwMS with\nmoderate generalisability, achieving a 66% Unweighted Average Recall (UAR) on a\nbinary task. Feature selection further improved performance, boosting UAR to\n74%. Our findings also highlight the relevant role emotional changes have as an\nindicator of depressive mood in both the general population and within PwMS.\nThis study provides an initial exploration into generalising speech-based\ndepression detection, even in the presence of co-occurring conditions, such as\nneurodegenerative diseases.",
        "url": "http://arxiv.org/abs/2508.18092v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18092v1",
        "arxiv_id": "2508.18092v1",
        "authors": [
            "Monica Gonzalez-Machorro",
            "Uwe Reichel",
            "Pascal Hecker",
            "Helly Hammer",
            "Hesam Sagha",
            "Florian Eyben",
            "Robert Hoepner",
            "Björn W. Schuller"
        ],
        "submitted": "2025-08-25 14:54:13",
        "source": "arxiv",
        "comment": "Accepted at the 8th International Conference on Natural Language and\n  Speech Processing (ICNLSP 2025). To be appeared in the corresponding\n  Proceedings at ACL Anthology"
    },
    {
        "title": "Named Entity Recognition of Historical Text via Large Language Model",
        "abstract": "Large language models have demonstrated remarkable versatility across a wide\nrange of natural language processing tasks and domains. One such task is Named\nEntity Recognition (NER), which involves identifying and classifying proper\nnames in text, such as people, organizations, locations, dates, and other\nspecific entities. NER plays a crucial role in extracting information from\nunstructured textual data, enabling downstream applications such as information\nretrieval from unstructured text.\n  Traditionally, NER is addressed using supervised machine learning approaches,\nwhich require large amounts of annotated training data. However, historical\ntexts present a unique challenge, as the annotated datasets are often scarce or\nnonexistent, due to the high cost and expertise required for manual labeling.\nIn addition, the variability and noise inherent in historical language, such as\ninconsistent spelling and archaic vocabulary, further complicate the\ndevelopment of reliable NER systems for these sources.\n  In this study, we explore the feasibility of applying LLMs to NER in\nhistorical documents using zero-shot and few-shot prompting strategies, which\nrequire little to no task-specific training data. Our experiments, conducted on\nthe HIPE-2022 (Identifying Historical People, Places and other Entities)\ndataset, show that LLMs can achieve reasonably strong performance on NER tasks\nin this setting. While their performance falls short of fully supervised models\ntrained on domain-specific annotations, the results are nevertheless promising.\nThese findings suggest that LLMs offer a viable and efficient alternative for\ninformation extraction in low-resource or historically significant corpora,\nwhere traditional supervised methods are infeasible.",
        "url": "http://arxiv.org/abs/2508.18090v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18090v1",
        "arxiv_id": "2508.18090v1",
        "authors": [
            "Shibingfeng Zhang",
            "Giovanni Colavizza"
        ],
        "submitted": "2025-08-25 14:52:11",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "How Quantization Shapes Bias in Large Language Models",
        "abstract": "This work presents a comprehensive evaluation of how quantization affects\nmodel bias, with particular attention to its impact on individual demographic\nsubgroups. We focus on weight and activation quantization strategies and\nexamine their effects across a broad range of bias types, including\nstereotypes, toxicity, sentiment, and fairness. We employ both probabilistic\nand generated text-based metrics across nine benchmarks and evaluate models\nvarying in architecture family and reasoning ability. Our findings show that\nquantization has a nuanced impact on bias: while it can reduce model toxicity\nand does not significantly impact sentiment, it tends to slightly increase\nstereotypes and unfairness in generative tasks, especially under aggressive\ncompression. These trends are generally consistent across demographic\ncategories and model types, although their magnitude depends on the specific\nsetting. Overall, our results highlight the importance of carefully balancing\nefficiency and ethical considerations when applying quantization in practice.",
        "url": "http://arxiv.org/abs/2508.18088v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18088v1",
        "arxiv_id": "2508.18088v1",
        "authors": [
            "Federico Marcuzzi",
            "Xuefei Ning",
            "Roy Schwartz",
            "Iryna Gurevych"
        ],
        "submitted": "2025-08-25 14:48:26",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Neither Valid nor Reliable? Investigating the Use of LLMs as Judges",
        "abstract": "Evaluating natural language generation (NLG) systems remains a core challenge\nof natural language processing (NLP), further complicated by the rise of large\nlanguage models (LLMs) that aims to be general-purpose. Recently, large\nlanguage models as judges (LLJs) have emerged as a promising alternative to\ntraditional metrics, but their validity remains underexplored. This position\npaper argues that the current enthusiasm around LLJs may be premature, as their\nadoption has outpaced rigorous scrutiny of their reliability and validity as\nevaluators. Drawing on measurement theory from the social sciences, we identify\nand critically assess four core assumptions underlying the use of LLJs: their\nability to act as proxies for human judgment, their capabilities as evaluators,\ntheir scalability, and their cost-effectiveness. We examine how each of these\nassumptions may be challenged by the inherent limitations of LLMs, LLJs, or\ncurrent practices in NLG evaluation. To ground our analysis, we explore three\napplications of LLJs: text summarization, data annotation, and safety\nalignment. Finally, we highlight the need for more responsible evaluation\npractices in LLJs evaluation, to ensure that their growing role in the field\nsupports, rather than undermines, progress in NLG.",
        "url": "http://arxiv.org/abs/2508.18076v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18076v1",
        "arxiv_id": "2508.18076v1",
        "authors": [
            "Khaoula Chehbouni",
            "Mohammed Haddou",
            "Jackie Chi Kit Cheung",
            "Golnoosh Farnadi"
        ],
        "submitted": "2025-08-25 14:43:10",
        "source": "arxiv",
        "comment": "Prepared for conference submission"
    },
    {
        "title": "HyST: LLM-Powered Hybrid Retrieval over Semi-Structured Tabular Data",
        "abstract": "User queries in real-world recommendation systems often combine structured\nconstraints (e.g., category, attributes) with unstructured preferences (e.g.,\nproduct descriptions or reviews). We introduce HyST (Hybrid retrieval over\nSemi-structured Tabular data), a hybrid retrieval framework that combines\nLLM-powered structured filtering with semantic embedding search to support\ncomplex information needs over semi-structured tabular data. HyST extracts\nattribute-level constraints from natural language using large language models\n(LLMs) and applies them as metadata filters, while processing the remaining\nunstructured query components via embedding-based retrieval. Experiments on a\nsemi-structured benchmark show that HyST consistently outperforms tradtional\nbaselines, highlighting the importance of structured filtering in improving\nretrieval precision, offering a scalable and accurate solution for real-world\nuser queries.",
        "url": "http://arxiv.org/abs/2508.18048v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18048v1",
        "arxiv_id": "2508.18048v1",
        "authors": [
            "Jiyoon Myung",
            "Jihyeon Park",
            "Joohyung Han"
        ],
        "submitted": "2025-08-25 14:06:27",
        "source": "arxiv",
        "comment": "Accepted at the 2nd EARL Workshop on Evaluating and Applying\n  Recommender Systems with Large Language Models (RecSys 2025)"
    },
    {
        "title": "Unseen Speaker and Language Adaptation for Lightweight Text-To-Speech with Adapters",
        "abstract": "In this paper we investigate cross-lingual Text-To-Speech (TTS) synthesis\nthrough the lens of adapters, in the context of lightweight TTS systems. In\nparticular, we compare the tasks of unseen speaker and language adaptation with\nthe goal of synthesising a target voice in a target language, in which the\ntarget voice has no recordings therein. Results from objective evaluations\ndemonstrate the effectiveness of adapters in learning language-specific and\nspeaker-specific information, allowing pre-trained models to learn unseen\nspeaker identities or languages, while avoiding catastrophic forgetting of the\noriginal model's speaker or language information. Additionally, to measure how\nnative the generated voices are in terms of accent, we propose and validate an\nobjective metric inspired by mispronunciation detection techniques in\nsecond-language (L2) learners. The paper also provides insights into the impact\nof adapter placement, configuration and the number of speakers used.",
        "url": "http://arxiv.org/abs/2508.18006v1",
        "pdf_url": "http://arxiv.org/pdf/2508.18006v1",
        "arxiv_id": "2508.18006v1",
        "authors": [
            "Alessio Falai",
            "Ziyao Zhang",
            "Akos Gangoly"
        ],
        "submitted": "2025-08-25 13:14:57",
        "source": "arxiv",
        "comment": "Accepted at IEEE MLSP 2025"
    },
    {
        "title": "A Retail-Corpus for Aspect-Based Sentiment Analysis with Large Language Models",
        "abstract": "Aspect-based sentiment analysis enhances sentiment detection by associating\nit with specific aspects, offering deeper insights than traditional sentiment\nanalysis. This study introduces a manually annotated dataset of 10,814\nmultilingual customer reviews covering brick-and-mortar retail stores, labeled\nwith eight aspect categories and their sentiment. Using this dataset, the\nperformance of GPT-4 and LLaMA-3 in aspect based sentiment analysis is\nevaluated to establish a baseline for the newly introduced data. The results\nshow both models achieving over 85% accuracy, while GPT-4 outperforms LLaMA-3\noverall with regard to all relevant metrics.",
        "url": "http://arxiv.org/abs/2508.17994v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17994v1",
        "arxiv_id": "2508.17994v1",
        "authors": [
            "Oleg Silcenco",
            "Marcos R. Machad",
            "Wallace C. Ugulino",
            "Daniel Braun"
        ],
        "submitted": "2025-08-25 13:02:05",
        "source": "arxiv",
        "comment": "Accepted at ICNLSP 2025"
    },
    {
        "title": "German4All - A Dataset and Model for Readability-Controlled Paraphrasing in German",
        "abstract": "The ability to paraphrase texts across different complexity levels is\nessential for creating accessible texts that can be tailored toward diverse\nreader groups. Thus, we introduce German4All, the first large-scale German\ndataset of aligned readability-controlled, paragraph-level paraphrases. It\nspans five readability levels and comprises over 25,000 samples. The dataset is\nautomatically synthesized using GPT-4 and rigorously evaluated through both\nhuman and LLM-based judgments. Using German4All, we train an open-source,\nreadability-controlled paraphrasing model that achieves state-of-the-art\nperformance in German text simplification, enabling more nuanced and\nreader-specific adaptations. We opensource both the dataset and the model to\nencourage further research on multi-level paraphrasing",
        "url": "http://arxiv.org/abs/2508.17973v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17973v1",
        "arxiv_id": "2508.17973v1",
        "authors": [
            "Miriam Anschütz",
            "Thanh Mai Pham",
            "Eslam Nasrallah",
            "Maximilian Müller",
            "Cristian-George Craciun",
            "Georg Groh"
        ],
        "submitted": "2025-08-25 12:40:32",
        "source": "arxiv",
        "comment": "Accepted to INLG 2025"
    },
    {
        "title": "Understanding Subword Compositionality of Large Language Models",
        "abstract": "Large language models (LLMs) take sequences of subwords as input, requiring\nthem to effective compose subword representations into meaningful word-level\nrepresentations. In this paper, we present a comprehensive set of experiments\nto probe how LLMs compose subword information, focusing on three key aspects:\nstructural similarity, semantic decomposability, and form retention. Our\nanalysis of the experiments suggests that these five LLM families can be\nclassified into three distinct groups, likely reflecting difference in their\nunderlying composition strategies. Specifically, we observe (i) three distinct\npatterns in the evolution of structural similarity between subword compositions\nand whole-word representations across layers; (ii) great performance when\nprobing layer by layer their sensitivity to semantic decompositionality; and\n(iii) three distinct patterns when probing sensitivity to formal features,\ne.g., character sequence length. These findings provide valuable insights into\nthe compositional dynamics of LLMs and highlight different compositional\npattens in how LLMs encode and integrate subword information.",
        "url": "http://arxiv.org/abs/2508.17953v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17953v1",
        "arxiv_id": "2508.17953v1",
        "authors": [
            "Qiwei Peng",
            "Yekun Chai",
            "Anders Søgaard"
        ],
        "submitted": "2025-08-25 12:16:56",
        "source": "arxiv",
        "comment": "EMNLP 2025 Main"
    },
    {
        "title": "Debiasing Multilingual LLMs in Cross-lingual Latent Space",
        "abstract": "Debiasing techniques such as SentDebias aim to reduce bias in large language\nmodels (LLMs). Previous studies have evaluated their cross-lingual\ntransferability by directly applying these methods to LLM representations,\nrevealing their limited effectiveness across languages. In this work, we\ntherefore propose to perform debiasing in a joint latent space rather than\ndirectly on LLM representations. We construct a well-aligned cross-lingual\nlatent space using an autoencoder trained on parallel TED talk scripts. Our\nexperiments with Aya-expanse and two debiasing techniques across four languages\n(English, French, German, Dutch) demonstrate that a) autoencoders effectively\nconstruct a well-aligned cross-lingual latent space, and b) applying debiasing\ntechniques in the learned cross-lingual latent space significantly improves\nboth the overall debiasing performance and cross-lingual transferability.",
        "url": "http://arxiv.org/abs/2508.17948v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17948v1",
        "arxiv_id": "2508.17948v1",
        "authors": [
            "Qiwei Peng",
            "Guimin Hu",
            "Yekun Chai",
            "Anders Søgaard"
        ],
        "submitted": "2025-08-25 12:13:37",
        "source": "arxiv",
        "comment": "EMNLP 2025 Main"
    },
    {
        "title": "AMELIA: A Family of Multi-task End-to-end Language Models for Argumentation",
        "abstract": "Argument mining is a subfield of argumentation that aims to automatically\nextract argumentative structures and their relations from natural language\ntexts. This paper investigates how a single large language model can be\nleveraged to perform one or several argument mining tasks. Our contributions\nare two-fold. First, we construct a multi-task dataset by surveying and\nconverting 19 well-known argument mining datasets from the literature into a\nunified format. Second, we explore various training strategies using Meta AI's\nLlama-3.1-8B-Instruct model: (1) fine-tuning on individual tasks, (2)\nfine-tuning jointly on multiple tasks, and (3) merging models fine-tuned\nseparately on individual tasks. Our experiments show that task-specific\nfine-tuning significantly improves individual performance across all tasks.\nMoreover, multi-task fine-tuning maintains strong performance without\ndegradation, suggesting effective transfer learning across related tasks.\nFinally, we demonstrate that model merging offers a viable compromise: it\nyields competitive performance while mitigating the computational costs\nassociated with full multi-task fine-tuning.",
        "url": "http://arxiv.org/abs/2508.17926v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17926v1",
        "arxiv_id": "2508.17926v1",
        "authors": [
            "Henri Savigny",
            "Bruno Yun"
        ],
        "submitted": "2025-08-25 11:51:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Feature-Refined Unsupervised Model for Loanword Detection",
        "abstract": "We propose an unsupervised method for detecting loanwords i.e., words\nborrowed from one language into another. While prior work has primarily relied\non language-external information to identify loanwords, such approaches can\nintroduce circularity and constraints into the historical linguistics workflow.\nIn contrast, our model relies solely on language-internal information to\nprocess both native and borrowed words in monolingual and multilingual\nwordlists. By extracting pertinent linguistic features, scoring them, and\nmapping them probabilistically, we iteratively refine initial results by\nidentifying and generalizing from emerging patterns until convergence. This\nhybrid approach leverages both linguistic and statistical cues to guide the\ndiscovery process. We evaluate our method on the task of isolating loanwords in\ndatasets from six standard Indo-European languages: English, German, French,\nItalian, Spanish, and Portuguese. Experimental results demonstrate that our\nmodel outperforms baseline methods, with strong performance gains observed when\nscaling to cross-linguistic data.",
        "url": "http://arxiv.org/abs/2508.17923v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17923v1",
        "arxiv_id": "2508.17923v1",
        "authors": [
            "Promise Dodzi Kpoglu"
        ],
        "submitted": "2025-08-25 11:42:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Information availability in different languages and various technological constraints related to multilinguism on the Internet",
        "abstract": "The usage of Internet has grown exponentially over the last two decades. The\nnumber of Internet users has grown from 16 Million to 1650 Million from 1995 to\n2010. It has become a major repository of information catering almost every\narea. Since the Internet has its origin in USA which is English speaking\ncountry there is huge dominance of English on the World Wide Web. Although\nEnglish is a globally acceptable language, still there is a huge population in\nthe world which is not able to access the Internet due to language constraints.\nIt has been estimated that only 20-25% of the world population speaks English\nas a native language. More and more people are accessing the Internet nowadays\nremoving the cultural and linguistic barriers and hence there is a high growth\nin the number of non-English speaking users over the last few years on the\nInternet. Although many solutions have been provided to remove the linguistic\nbarriers, still there is a huge gap to be filled. This paper attempts to\nanalyze the need of information availability in different languages and the\nvarious technological constraints related to multi-linguism on the Internet.",
        "url": "http://arxiv.org/abs/2508.17918v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17918v1",
        "arxiv_id": "2508.17918v1",
        "authors": [
            "Sonal Khosla",
            "Haridasa Acharya"
        ],
        "submitted": "2025-08-25 11:35:12",
        "source": "arxiv",
        "comment": "International Journal of Computer Applications"
    },
    {
        "title": "Evaluating the Representation of Vowels in Wav2Vec Feature Extractor: A Layer-Wise Analysis Using MFCCs",
        "abstract": "Automatic Speech Recognition has advanced with self-supervised learning,\nenabling feature extraction directly from raw audio. In Wav2Vec, a CNN first\ntransforms audio into feature vectors before the transformer processes them.\nThis study examines CNN-extracted information for monophthong vowels using the\nTIMIT corpus. We compare MFCCs, MFCCs with formants, and CNN activations by\ntraining SVM classifiers for front-back vowel identification, assessing their\nclassification accuracy to evaluate phonetic representation.",
        "url": "http://arxiv.org/abs/2508.17914v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17914v1",
        "arxiv_id": "2508.17914v1",
        "authors": [
            "Domenico De Cristofaro",
            "Vincenzo Norman Vitale",
            "Alessandro Vietti"
        ],
        "submitted": "2025-08-25 11:30:56",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Pandora: Leveraging Code-driven Knowledge Transfer for Unified Structured Knowledge Reasoning",
        "abstract": "Unified Structured Knowledge Reasoning (USKR) aims to answer natural language\nquestions by using structured sources such as tables, databases, and knowledge\ngraphs in a unified way. Existing USKR methods rely on task-specific strategies\nor bespoke representations, which hinder their ability to dismantle barriers\nbetween different SKR tasks, thereby constraining their overall performance in\ncross-task scenarios. In this paper, we introduce \\textsc{Pandora}, a novel\nUSKR framework that addresses the limitations of existing methods by leveraging\ntwo key innovations. First, we propose a code-based unified knowledge\nrepresentation using \\textsc{Python}'s \\textsc{Pandas} API, which aligns\nseamlessly with the pre-training of LLMs. This representation facilitates a\ncohesive approach to handling different structured knowledge sources. Building\non this foundation, we employ knowledge transfer to bolster the unified\nreasoning process of LLMs by automatically building cross-task memory. By\nadaptively correcting reasoning using feedback from code execution,\n\\textsc{Pandora} showcases impressive unified reasoning capabilities. Extensive\nexperiments on six widely used benchmarks across three SKR tasks demonstrate\nthat \\textsc{Pandora} outperforms existing unified reasoning frameworks and\ncompetes effectively with task-specific methods.",
        "url": "http://arxiv.org/abs/2508.17905v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17905v1",
        "arxiv_id": "2508.17905v1",
        "authors": [
            "Yongrui Chen",
            "Junhao He",
            "Linbo Fu",
            "Shenyu Zhang",
            "Rihui Jin",
            "Xinbang Dai",
            "Jiaqi Li",
            "Dehai Min",
            "Nan Hu",
            "Yuxin Zhang",
            "Guilin Qi",
            "Yi Huang",
            "Tongtong Wu"
        ],
        "submitted": "2025-08-25 11:22:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Designing Practical Models for Isolated Word Visual Speech Recognition",
        "abstract": "Visual speech recognition (VSR) systems decode spoken words from an input\nsequence using only the video data. Practical applications of such systems\ninclude medical assistance as well as human-machine interactions. A VSR system\nis typically employed in a complementary role in cases where the audio is\ncorrupt or not available. In order to accurately predict the spoken words,\nthese architectures often rely on deep neural networks in order to extract\nmeaningful representations from the input sequence. While deep architectures\nachieve impressive recognition performance, relying on such models incurs\nsignificant computation costs which translates into increased resource demands\nin terms of hardware requirements and results in limited applicability in\nreal-world scenarios where resources might be constrained. This factor prevents\nwider adoption and deployment of speech recognition systems in more practical\napplications. In this work, we aim to alleviate this issue by developing\narchitectures for VSR that have low hardware costs. Following the standard\ntwo-network design paradigm, where one network handles visual feature\nextraction and another one utilizes the extracted features to classify the\nentire sequence, we develop lightweight end-to-end architectures by first\nbenchmarking efficient models from the image classification literature, and\nthen adopting lightweight block designs in a temporal convolution network\nbackbone. We create several unified models with low resource requirements but\nstrong recognition performance. Experiments on the largest public database for\nEnglish words demonstrate the effectiveness and practicality of our developed\nmodels. Code and trained models will be made publicly available.",
        "url": "http://arxiv.org/abs/2508.17894v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17894v1",
        "arxiv_id": "2508.17894v1",
        "authors": [
            "Iason Ioannis Panagos",
            "Giorgos Sfikas",
            "Christophoros Nikou"
        ],
        "submitted": "2025-08-25 11:04:36",
        "source": "arxiv",
        "comment": "Double-column format, 13 pages with references, 2 figures"
    },
    {
        "title": "ILRe: Intermediate Layer Retrieval for Context Compression in Causal Language Models",
        "abstract": "Large Language Models (LLMs) have demonstrated success across many\nbenchmarks. However, they still exhibit limitations in long-context scenarios,\nprimarily due to their short effective context length, quadratic computational\ncomplexity, and high memory overhead when processing lengthy inputs. To\nmitigate these issues, we introduce a novel context compression pipeline,\ncalled Intermediate Layer Retrieval (ILRe), which determines one intermediate\ndecoder layer offline, encodes context by streaming chunked prefill only up to\nthat layer, and recalls tokens by the attention scores between the input query\nand full key cache in that specified layer. In particular, we propose a\nmulti-pooling kernels allocating strategy in the token recalling process to\nmaintain the completeness of semantics. Our approach not only reduces the\nprefilling complexity from $O(L^2)$ to $O(L)$, but also achieves performance\ncomparable to or better than the full context in the long context scenarios.\nWithout additional post training or operator development, ILRe can process a\nsingle $1M$ tokens request in less than half a minute (speedup $\\approx\n180\\times$) and scores RULER-$1M$ benchmark of $\\approx 79.8$ with model\nLlama-3.1-UltraLong-8B-1M-Instruct on a Huawei Ascend 910B NPU.",
        "url": "http://arxiv.org/abs/2508.17892v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17892v1",
        "arxiv_id": "2508.17892v1",
        "authors": [
            "Manlai Liang",
            "Mandi Liu",
            "Jiangzhou Ji",
            "Huaijun Li",
            "Haobo Yang",
            "Yaohan He",
            "Jinlong Li"
        ],
        "submitted": "2025-08-25 10:59:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Speech Discrete Tokens or Continuous Features? A Comparative Analysis for Spoken Language Understanding in SpeechLLMs",
        "abstract": "With the rise of Speech Large Language Models (SpeechLLMs), two dominant\napproaches have emerged for speech processing: discrete tokens and continuous\nfeatures. Each approach has demonstrated strong capabilities in audio-related\nprocessing tasks. However, the performance gap between these two paradigms has\nnot been thoroughly explored. To address this gap, we present a fair comparison\nof self-supervised learning (SSL)-based discrete and continuous features under\nthe same experimental settings. We evaluate their performance across six spoken\nlanguage understanding-related tasks using both small and large-scale LLMs\n(Qwen1.5-0.5B and Llama3.1-8B). We further conduct in-depth analyses, including\nefficient comparison, SSL layer analysis, LLM layer analysis, and robustness\ncomparison. Our findings reveal that continuous features generally outperform\ndiscrete tokens in various tasks. Each speech processing method exhibits\ndistinct characteristics and patterns in how it learns and processes speech\ninformation. We hope our results will provide valuable insights to advance\nspoken language understanding in SpeechLLMs.",
        "url": "http://arxiv.org/abs/2508.17863v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17863v1",
        "arxiv_id": "2508.17863v1",
        "authors": [
            "Dingdong Wang",
            "Junan Li",
            "Mingyu Cui",
            "Dongchao Yang",
            "Xueyuan Chen",
            "Helen Meng"
        ],
        "submitted": "2025-08-25 10:16:07",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025 Main Conference"
    },
    {
        "title": "Retrieval Feedback Memory Enhancement Large Model Retrieval Generation Method",
        "abstract": "Large Language Models (LLMs) have shown remarkable capabilities across\ndiverse tasks, yet they face inherent limitations such as constrained\nparametric knowledge and high retraining costs. Retrieval-Augmented Generation\n(RAG) augments the generation process by retrieving externally stored knowledge\nabsent from the models internal parameters. However, RAG methods face\nchallenges such as information loss and redundant retrievals during multi-round\nqueries, accompanying the difficulties in precisely characterizing knowledge\ngaps for complex tasks. To address these problems, we propose Retrieval\nFeedback and Memory Retrieval Augmented Generation(RFM-RAG), which transforms\nthe stateless retrieval of previous methods into stateful continuous knowledge\nmanagement by constructing a dynamic evidence pool. Specifically, our method\ngenerates refined queries describing the models knowledge gaps using relational\ntriples from questions and evidence from the dynamic evidence pool; Retrieves\ncritical external knowledge to iteratively update this evidence pool; Employs a\nR-Feedback Model to evaluate evidence completeness until convergence. Compared\nto traditional RAG methods, our approach enables persistent storage of\nretrieved passages and effectively distills key information from passages to\nconstruct clearly new queries. Experiments on three public QA benchmarks\ndemonstrate that RFM-RAG outperforms previous methods and improves overall\nsystem accuracy.",
        "url": "http://arxiv.org/abs/2508.17862v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17862v1",
        "arxiv_id": "2508.17862v1",
        "authors": [
            "Leqian Li",
            "Dianxi Shi",
            "Jialu Zhou",
            "Xinyu Wei",
            "Mingyue Yang",
            "Songchang Jin",
            "Shaowu Yang"
        ],
        "submitted": "2025-08-25 10:13:02",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LexSemBridge: Fine-Grained Dense Representation Enhancement through Token-Aware Embedding Augmentation",
        "abstract": "As queries in retrieval-augmented generation (RAG) pipelines powered by large\nlanguage models (LLMs) become increasingly complex and diverse, dense retrieval\nmodels have demonstrated strong performance in semantic matching. Nevertheless,\nthey often struggle with fine-grained retrieval tasks, where precise keyword\nalignment and span-level localization are required, even in cases with high\nlexical overlap that would intuitively suggest easier retrieval. To\nsystematically evaluate this limitation, we introduce two targeted tasks,\nkeyword retrieval and part-of-passage retrieval, designed to simulate practical\nfine-grained scenarios. Motivated by these observations, we propose\nLexSemBridge, a unified framework that enhances dense query representations\nthrough fine-grained, input-aware vector modulation. LexSemBridge constructs\nlatent enhancement vectors from input tokens using three paradigms: Statistical\n(SLR), Learned (LLR), and Contextual (CLR), and integrates them with dense\nembeddings via element-wise interaction. Theoretically, we show that this\nmodulation preserves the semantic direction while selectively amplifying\ndiscriminative dimensions. LexSemBridge operates as a plug-in without modifying\nthe backbone encoder and naturally extends to both text and vision modalities.\nExtensive experiments across semantic and fine-grained retrieval tasks validate\nthe effectiveness and generality of our approach. All code and models are\npublicly available at https://github.com/Jasaxion/LexSemBridge/",
        "url": "http://arxiv.org/abs/2508.17858v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17858v1",
        "arxiv_id": "2508.17858v1",
        "authors": [
            "Shaoxiong Zhan",
            "Hai Lin",
            "Hongming Tan",
            "Xiaodong Cai",
            "Hai-Tao Zheng",
            "Xin Su",
            "Zifei Shan",
            "Ruitong Liu",
            "Hong-Gee Kim"
        ],
        "submitted": "2025-08-25 10:07:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Beyond Demographics: Enhancing Cultural Value Survey Simulation with Multi-Stage Personality-Driven Cognitive Reasoning",
        "abstract": "Introducing MARK, the Multi-stAge Reasoning frameworK for cultural value\nsurvey response simulation, designed to enhance the accuracy, steerability, and\ninterpretability of large language models in this task. The system is inspired\nby the type dynamics theory in the MBTI psychological framework for personality\nresearch. It effectively predicts and utilizes human demographic information\nfor simulation: life-situational stress analysis, group-level personality\nprediction, and self-weighted cognitive imitation. Experiments on the World\nValues Survey show that MARK outperforms existing baselines by 10% accuracy and\nreduces the divergence between model predictions and human preferences. This\nhighlights the potential of our framework to improve zero-shot personalization\nand help social scientists interpret model predictions.",
        "url": "http://arxiv.org/abs/2508.17855v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17855v1",
        "arxiv_id": "2508.17855v1",
        "authors": [
            "Haijiang Liu",
            "Qiyuan Li",
            "Chao Gao",
            "Yong Cao",
            "Xiangyu Xu",
            "Xun Wu",
            "Daniel Hershcovich",
            "Jinguang Gu"
        ],
        "submitted": "2025-08-25 10:04:23",
        "source": "arxiv",
        "comment": "23 pages, 6 figures, accepted to EMNLP 2025 main"
    },
    {
        "title": "DRQA: Dynamic Reasoning Quota Allocation for Controlling Overthinking in Reasoning Large Language Models",
        "abstract": "Reasoning large language models (RLLMs), such as OpenAI-O3 and DeepSeek-R1,\nhave recently demonstrated remarkable capabilities by performing structured and\nmulti-step reasoning. However, recent studies reveal that RLLMs often suffer\nfrom overthinking, i.e., producing unnecessarily lengthy reasoning chains even\nfor simple questions, leading to excessive token consumption and computational\ninefficiency. Interestingly, we observe that when processing multiple questions\nin batch mode, RLLMs exhibit more resource-efficient behavior by dynamically\ncompressing reasoning steps for easier problems, due to implicit resource\ncompetition. Inspired by this, we propose Dynamic Reasoning Quota Allocation\n(DRQA), a novel method that transfers the benefits of resource competition from\nbatch processing to single-question inference. Specifically, DRQA leverages\nbatch-generated preference data and reinforcement learning to train the model\nto allocate reasoning resources adaptively. By encouraging the model to\ninternalize a preference for responses that are both accurate and concise, DRQA\nenables it to generate concise answers for simple questions while retaining\nsufficient reasoning depth for more challenging ones. Extensive experiments on\na wide range of mathematical and scientific reasoning benchmarks demonstrate\nthat DRQA significantly reduces token usage while maintaining, and in many\ncases improving, answer accuracy. By effectively mitigating the overthinking\nproblem, DRQA offers a promising direction for more efficient and scalable\ndeployment of RLLMs, and we hope it inspires further exploration into\nfine-grained control of reasoning behaviors.",
        "url": "http://arxiv.org/abs/2508.17803v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17803v1",
        "arxiv_id": "2508.17803v1",
        "authors": [
            "Kaiwen Yan",
            "Xuanqing Shi",
            "Hongcheng Guo",
            "Wenxuan Wang",
            "Zhuosheng Zhang",
            "Chengwei Qin"
        ],
        "submitted": "2025-08-25 08:47:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Zero-shot Context Biasing with Trie-based Decoding using Synthetic Multi-Pronunciation",
        "abstract": "Contextual automatic speech recognition (ASR) systems allow for recognizing\nout-of-vocabulary (OOV) words, such as named entities or rare words. However,\nit remains challenging due to limited training data and ambiguous or\ninconsistent pronunciations. In this paper, we propose a synthesis-driven\nmulti-pronunciation contextual biasing method that performs zero-shot\ncontextual ASR on a pretrained Whisper model. Specifically, we leverage\ntext-to-speech (TTS) systems to synthesize diverse speech samples containing\neach target rare word, and then use the pretrained Whisper model to extract\nmultiple predicted pronunciation variants. These variant token sequences are\ncompiled into a prefix-trie, which assigns rewards to beam hypotheses in a\nshallow-fusion manner during beam-search decoding. After which, any recognized\nvariant is mapped back to the original rare word in the final transcription.\nThe evaluation results on the Librispeech dataset show that our method reduces\nbiased word error rate (WER) by 42% on test-clean and 43% on test-other while\nmaintaining unbiased WER essentially unchanged.",
        "url": "http://arxiv.org/abs/2508.17796v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17796v1",
        "arxiv_id": "2508.17796v1",
        "authors": [
            "Changsong Liu",
            "Yizhou Peng",
            "Eng Siong Chng"
        ],
        "submitted": "2025-08-25 08:41:52",
        "source": "arxiv",
        "comment": "Accepted to APSIPA ASC 2025"
    },
    {
        "title": "Proximal Supervised Fine-Tuning",
        "abstract": "Supervised fine-tuning (SFT) of foundation models often leads to poor\ngeneralization, where prior capabilities deteriorate after tuning on new tasks\nor domains. Inspired by trust-region policy optimization (TRPO) and proximal\npolicy optimization (PPO) in reinforcement learning (RL), we propose Proximal\nSFT (PSFT). This fine-tuning objective incorporates the benefits of\ntrust-region, effectively constraining policy drift during SFT while\nmaintaining competitive tuning. By viewing SFT as a special case of policy\ngradient methods with constant positive advantages, we derive PSFT that\nstabilizes optimization and leads to generalization, while leaving room for\nfurther optimization in subsequent post-training stages. Experiments across\nmathematical and human-value domains show that PSFT matches SFT in-domain,\noutperforms it in out-of-domain generalization, remains stable under prolonged\ntraining without causing entropy collapse, and provides a stronger foundation\nfor the subsequent optimization.",
        "url": "http://arxiv.org/abs/2508.17784v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17784v1",
        "arxiv_id": "2508.17784v1",
        "authors": [
            "Wenhong Zhu",
            "Ruobing Xie",
            "Rui Wang",
            "Xingwu Sun",
            "Di Wang",
            "Pengfei Liu"
        ],
        "submitted": "2025-08-25 08:26:43",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Research on Evaluation Methods for Patent Novelty Search Systems and Empirical Analysis",
        "abstract": "Patent novelty search systems are critical to IP protection and innovation\nassessment; their retrieval accuracy directly impacts patent quality. We\npropose a comprehensive evaluation methodology that builds high-quality,\nreproducible datasets from examiner citations and X-type citations extracted\nfrom technically consistent family patents, and evaluates systems using\ninvention descriptions as inputs. Using Top-k Detection Rate and Recall as core\nmetrics, we further conduct multi-dimensional analyses by language, technical\nfield (IPC), and filing jurisdiction. Experiments show the method effectively\nexposes performance differences across scenarios and offers actionable evidence\nfor system improvement. The framework is scalable and practical, providing a\nuseful reference for development and optimization of patent novelty search\nsystems",
        "url": "http://arxiv.org/abs/2508.17782v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17782v1",
        "arxiv_id": "2508.17782v1",
        "authors": [
            "Shu Zhang",
            "LiSha Zhang",
            "Kai Duan",
            "XinKai Sun"
        ],
        "submitted": "2025-08-25 08:24:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Speculating LLMs' Chinese Training Data Pollution from Their Tokens",
        "abstract": "Tokens are basic elements in the datasets for LLM training. It is well-known\nthat many tokens representing Chinese phrases in the vocabulary of GPT\n(4o/4o-mini/o1/o3/4.5/4.1/o4-mini) are indicating contents like pornography or\nonline gambling. Based on this observation, our goal is to locate Polluted\nChinese (PoC) tokens in LLMs and study the relationship between PoC tokens'\nexistence and training data. (1) We give a formal definition and taxonomy of\nPoC tokens based on the GPT's vocabulary. (2) We build a PoC token detector via\nfine-tuning an LLM to label PoC tokens in vocabularies by considering each\ntoken's both semantics and related contents from the search engines. (3) We\nstudy the speculation on the training data pollution via PoC tokens'\nappearances (token ID). Experiments on GPT and other 23 LLMs indicate that\ntokens widely exist while GPT's vocabulary behaves the worst: more than 23%\nlong Chinese tokens (i.e., a token with more than two Chinese characters) are\neither porn or online gambling. We validate the accuracy of our speculation\nmethod on famous pre-training datasets like C4 and Pile. Then, considering\nGPT-4o, we speculate that the ratio of \"Yui Hatano\" related webpages in\nGPT-4o's training data is around 0.5%.",
        "url": "http://arxiv.org/abs/2508.17771v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17771v1",
        "arxiv_id": "2508.17771v1",
        "authors": [
            "Qingjie Zhang",
            "Di Wang",
            "Haoting Qian",
            "Liu Yan",
            "Tianwei Zhang",
            "Ke Xu",
            "Qi Li",
            "Minlie Huang",
            "Hewu Li",
            "Han Qiu"
        ],
        "submitted": "2025-08-25 08:08:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ISACL: Internal State Analyzer for Copyrighted Training Data Leakage",
        "abstract": "Large Language Models (LLMs) have revolutionized Natural Language Processing\n(NLP) but pose risks of inadvertently exposing copyrighted or proprietary data,\nespecially when such data is used for training but not intended for\ndistribution. Traditional methods address these leaks only after content is\ngenerated, which can lead to the exposure of sensitive information. This study\nintroduces a proactive approach: examining LLMs' internal states before text\ngeneration to detect potential leaks. By using a curated dataset of copyrighted\nmaterials, we trained a neural network classifier to identify risks, allowing\nfor early intervention by stopping the generation process or altering outputs\nto prevent disclosure. Integrated with a Retrieval-Augmented Generation (RAG)\nsystem, this framework ensures adherence to copyright and licensing\nrequirements while enhancing data privacy and ethical standards. Our results\nshow that analyzing internal states effectively mitigates the risk of\ncopyrighted data leakage, offering a scalable solution that fits smoothly into\nAI workflows, ensuring compliance with copyright regulations while maintaining\nhigh-quality text generation. The implementation is available on\nGitHub.\\footnote{https://github.com/changhu73/Internal_states_leakage}",
        "url": "http://arxiv.org/abs/2508.17767v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17767v1",
        "arxiv_id": "2508.17767v1",
        "authors": [
            "Guangwei Zhang",
            "Qisheng Su",
            "Jiateng Liu",
            "Cheng Qian",
            "Yanzhou Pan",
            "Yanjie Fu",
            "Denghui Zhang"
        ],
        "submitted": "2025-08-25 08:04:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CEIDM: A Controlled Entity and Interaction Diffusion Model for Enhanced Text-to-Image Generation",
        "abstract": "In Text-to-Image (T2I) generation, the complexity of entities and their\nintricate interactions pose a significant challenge for T2I method based on\ndiffusion model: how to effectively control entity and their interactions to\nproduce high-quality images. To address this, we propose CEIDM, a image\ngeneration method based on diffusion model with dual controls for entity and\ninteraction. First, we propose an entity interactive relationships mining\napproach based on Large Language Models (LLMs), extracting reasonable and rich\nimplicit interactive relationships through chain of thought to guide diffusion\nmodels to generate high-quality images that are closer to realistic logic and\nhave more reasonable interactive relationships. Furthermore, We propose an\ninteractive action clustering and offset method to cluster and offset the\ninteractive action features contained in each text prompts. By constructing\nglobal and local bidirectional offsets, we enhance semantic understanding and\ndetail supplementation of original actions, making the model's understanding of\nthe concept of interactive \"actions\" more accurate and generating images with\nmore accurate interactive actions. Finally, we design an entity control network\nwhich generates masks with entity semantic guidance, then leveraging\nmulti-scale convolutional network to enhance entity feature and dynamic network\nto fuse feature. It effectively controls entities and significantly improves\nimage quality. Experiments show that the proposed CEIDM method is better than\nthe most representative existing methods in both entity control and their\ninteraction control.",
        "url": "http://arxiv.org/abs/2508.17760v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17760v1",
        "arxiv_id": "2508.17760v1",
        "authors": [
            "Mingyue Yang",
            "Dianxi Shi",
            "Jialu Zhou",
            "Xinyu Wei",
            "Leqian Li",
            "Shaowu Yang",
            "Chunping Qiu"
        ],
        "submitted": "2025-08-25 07:58:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DiffusionGS: Generative Search with Query Conditioned Diffusion in Kuaishou",
        "abstract": "Personalized search ranking systems are critical for driving engagement and\nrevenue in modern e-commerce and short-video platforms. While existing methods\nexcel at estimating users' broad interests based on the filtered historical\nbehaviors, they typically under-exploit explicit alignment between a user's\nreal-time intent (represented by the user query) and their past actions. In\nthis paper, we propose DiffusionGS, a novel and scalable approach powered by\ngenerative models. Our key insight is that user queries can serve as explicit\nintent anchors to facilitate the extraction of users' immediate interests from\nlong-term, noisy historical behaviors. Specifically, we formulate interest\nextraction as a conditional denoising task, where the user's query guides a\nconditional diffusion process to produce a robust, user intent-aware\nrepresentation from their behavioral sequence. We propose the User-aware\nDenoising Layer (UDL) to incorporate user-specific profiles into the\noptimization of attention distribution on the user's past actions. By reframing\nqueries as intent priors and leveraging diffusion-based denoising, our method\nprovides a powerful mechanism for capturing dynamic user interest shifts.\nExtensive offline and online experiments demonstrate the superiority of\nDiffusionGS over state-of-the-art methods.",
        "url": "http://arxiv.org/abs/2508.17754v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17754v1",
        "arxiv_id": "2508.17754v1",
        "authors": [
            "Qinyao Li",
            "Xiaoyang Zheng",
            "Qihang Zhao",
            "Ke Xu",
            "Zhongbo Sun",
            "Chao Wang",
            "Chenyi Lei",
            "Han Li",
            "Wenwu Ou"
        ],
        "submitted": "2025-08-25 07:46:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Talking to Robots: A Practical Examination of Speech Foundation Models for HRI Applications",
        "abstract": "Automatic Speech Recognition (ASR) systems in real-world settings need to\nhandle imperfect audio, often degraded by hardware limitations or environmental\nnoise, while accommodating diverse user groups. In human-robot interaction\n(HRI), these challenges intersect to create a uniquely challenging recognition\nenvironment. We evaluate four state-of-the-art ASR systems on eight publicly\navailable datasets that capture six dimensions of difficulty: domain-specific,\naccented, noisy, age-variant, impaired, and spontaneous speech. Our analysis\ndemonstrates significant variations in performance, hallucination tendencies,\nand inherent biases, despite similar scores on standard benchmarks. These\nlimitations have serious implications for HRI, where recognition errors can\ninterfere with task performance, user trust, and safety.",
        "url": "http://arxiv.org/abs/2508.17753v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17753v1",
        "arxiv_id": "2508.17753v1",
        "authors": [
            "Theresa Pekarek Rosin",
            "Julia Gachot",
            "Henri-Leon Kordt",
            "Matthias Kerzel",
            "Stefan Wermter"
        ],
        "submitted": "2025-08-25 07:45:20",
        "source": "arxiv",
        "comment": "Accepted at the workshop on Foundation Models for Social Robotics\n  (FoMoSR) at ICSR 2025"
    },
    {
        "title": "SMITE: Enhancing Fairness in LLMs through Optimal In-Context Example Selection via Dynamic Validation",
        "abstract": "Large Language Models (LLMs) are widely used for downstream tasks such as\ntabular classification, where ensuring fairness in their outputs is critical\nfor inclusivity, equal representation, and responsible AI deployment. This\nstudy introduces a novel approach to enhancing LLM performance and fairness\nthrough the concept of a dynamic validation set, which evolves alongside the\ntest set, replacing the traditional static validation approach. We also propose\nan iterative algorithm, SMITE, to select optimal in-context examples, with each\nexample set validated against its corresponding dynamic validation set. The\nin-context set with the lowest total error is used as the final demonstration\nset. Our experiments across four different LLMs show that our proposed\ntechniques significantly improve both predictive accuracy and fairness compared\nto baseline methods. To our knowledge, this is the first study to apply dynamic\nvalidation in the context of in-context learning for LLMs.",
        "url": "http://arxiv.org/abs/2508.17735v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17735v1",
        "arxiv_id": "2508.17735v1",
        "authors": [
            "Garima Chhikara",
            "Kripabandhu Ghosh",
            "Abhijnan Chakraborty"
        ],
        "submitted": "2025-08-25 07:22:08",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Layerwise Importance Analysis of Feed-Forward Networks in Transformer-based Language Models",
        "abstract": "This study investigates the layerwise importance of feed-forward networks\n(FFNs) in Transformer-based language models during pretraining. We introduce an\nexperimental approach that, while maintaining the total parameter count,\nincreases the FFN dimensions in some layers and completely removes the FFNs\nfrom other layers. Furthermore, since our focus is on the importance of FFNs\nduring pretraining, we train models from scratch to examine whether the\nimportance of FFNs varies depending on their layer positions, rather than using\npublicly available pretrained models as is frequently done. Through\ncomprehensive evaluations of models with varying sizes (285M, 570M, and 1.2B\nparameters) and layer counts (12, 24, and 40 layers), we demonstrate that\nconcentrating FFNs in 70% of the consecutive middle layers consistently\noutperforms standard configurations for multiple downstream tasks.",
        "url": "http://arxiv.org/abs/2508.17734v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17734v1",
        "arxiv_id": "2508.17734v1",
        "authors": [
            "Wataru Ikeda",
            "Kazuki Yano",
            "Ryosuke Takahashi",
            "Jaesung Lee",
            "Keigo Shibata",
            "Jun Suzuki"
        ],
        "submitted": "2025-08-25 07:21:49",
        "source": "arxiv",
        "comment": "Accepted to COLM 2025"
    },
    {
        "title": "How Do LLM-Generated Texts Impact Term-Based Retrieval Models?",
        "abstract": "As more content generated by large language models (LLMs) floods into the\nInternet, information retrieval (IR) systems now face the challenge of\ndistinguishing and handling a blend of human-authored and machine-generated\ntexts. Recent studies suggest that neural retrievers may exhibit a preferential\ninclination toward LLM-generated content, while classic term-based retrievers\nlike BM25 tend to favor human-written documents. This paper investigates the\ninfluence of LLM-generated content on term-based retrieval models, which are\nvalued for their efficiency and robust generalization across domains. Our\nlinguistic analysis reveals that LLM-generated texts exhibit smoother\nhigh-frequency and steeper low-frequency Zipf slopes, higher term specificity,\nand greater document-level diversity. These traits are aligned with LLMs being\ntrained to optimize reader experience through diverse and precise expressions.\nOur study further explores whether term-based retrieval models demonstrate\nsource bias, concluding that these models prioritize documents whose term\ndistributions closely correspond to those of the queries, rather than\ndisplaying an inherent source bias. This work provides a foundation for\nunderstanding and addressing potential biases in term-based IR systems managing\nmixed-source content.",
        "url": "http://arxiv.org/abs/2508.17715v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17715v1",
        "arxiv_id": "2508.17715v1",
        "authors": [
            "Wei Huang",
            "Keping Bi",
            "Yinqiong Cai",
            "Wei Chen",
            "Jiafeng Guo",
            "Xueqi Cheng"
        ],
        "submitted": "2025-08-25 06:43:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "EMPOWER: Evolutionary Medical Prompt Optimization With Reinforcement Learning",
        "abstract": "Prompt engineering significantly influences the reliability and clinical\nutility of Large Language Models (LLMs) in medical applications. Current\noptimization approaches inadequately address domain-specific medical knowledge\nand safety requirements. This paper introduces EMPOWER, a novel evolutionary\nframework that enhances medical prompt quality through specialized\nrepresentation learning, multi-dimensional evaluation, and structure-preserving\nalgorithms. Our methodology incorporates: (1) a medical terminology attention\nmechanism, (2) a comprehensive assessment architecture evaluating clarity,\nspecificity, clinical relevance, and factual accuracy, (3) a component-level\nevolutionary algorithm preserving clinical reasoning integrity, and (4) a\nsemantic verification module ensuring adherence to medical knowledge.\nEvaluation across diagnostic, therapeutic, and educational tasks demonstrates\nsignificant improvements: 24.7% reduction in factually incorrect content, 19.6%\nenhancement in domain specificity, and 15.3% higher clinician preference in\nblinded evaluations. The framework addresses critical challenges in developing\nclinically appropriate prompts, facilitating more responsible integration of\nLLMs into healthcare settings.",
        "url": "http://arxiv.org/abs/2508.17703v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17703v1",
        "arxiv_id": "2508.17703v1",
        "authors": [
            "Yinda Chen",
            "Yangfan He",
            "Jing Yang",
            "Dapeng Zhang",
            "Zhenlong Yuan",
            "Muhammad Attique Khan",
            "Jamel Baili",
            "Por Lip Yee"
        ],
        "submitted": "2025-08-25 06:23:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Semantic Search for Information Retrieval",
        "abstract": "Information retrieval systems have progressed notably from lexical techniques\nsuch as BM25 and TF-IDF to modern semantic retrievers. This survey provides a\nbrief overview of the BM25 baseline, then discusses the architecture of modern\nstate-of-the-art semantic retrievers. Advancing from BERT, we introduce dense\nbi-encoders (DPR), late-interaction models (ColBERT), and neural sparse\nretrieval (SPLADE). Finally, we examine MonoT5, a cross-encoder model. We\nconclude with common evaluation tactics, pressing challenges, and propositions\nfor future directions.",
        "url": "http://arxiv.org/abs/2508.17694v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17694v1",
        "arxiv_id": "2508.17694v1",
        "authors": [
            "Kayla Farivar"
        ],
        "submitted": "2025-08-25 06:03:26",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LLM-based Agentic Reasoning Frameworks: A Survey from Methods to Scenarios",
        "abstract": "Recent advances in the intrinsic reasoning capabilities of large language\nmodels (LLMs) have given rise to LLM-based agent systems that exhibit\nnear-human performance on a variety of automated tasks. However, although these\nsystems share similarities in terms of their use of LLMs, different reasoning\nframeworks of the agent system steer and organize the reasoning process in\ndifferent ways. In this survey, we propose a systematic taxonomy that\ndecomposes agentic reasoning frameworks and analyze how these frameworks\ndominate framework-level reasoning by comparing their applications across\ndifferent scenarios. Specifically, we propose an unified formal language to\nfurther classify agentic reasoning systems into single-agent methods,\ntool-based methods, and multi-agent methods. After that, we provide a\ncomprehensive review of their key application scenarios in scientific\ndiscovery, healthcare, software engineering, social simulation, and economics.\nWe also analyze the characteristic features of each framework and summarize\ndifferent evaluation strategies. Our survey aims to provide the research\ncommunity with a panoramic view to facilitate understanding of the strengths,\nsuitable scenarios, and evaluation practices of different agentic reasoning\nframeworks.",
        "url": "http://arxiv.org/abs/2508.17692v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17692v1",
        "arxiv_id": "2508.17692v1",
        "authors": [
            "Bingxi Zhao",
            "Lin Geng Foo",
            "Ping Hu",
            "Christian Theobalt",
            "Hossein Rahmani",
            "Jun Liu"
        ],
        "submitted": "2025-08-25 06:01:16",
        "source": "arxiv",
        "comment": "51 pages,10 figures,8 tables. Work in progress"
    },
    {
        "title": "Text Meets Topology: Rethinking Out-of-distribution Detection in Text-Rich Networks",
        "abstract": "Out-of-distribution (OOD) detection remains challenging in text-rich\nnetworks, where textual features intertwine with topological structures.\nExisting methods primarily address label shifts or rudimentary domain-based\nsplits, overlooking the intricate textual-structural diversity. For example, in\nsocial networks, where users represent nodes with textual features (name, bio)\nwhile edges indicate friendship status, OOD may stem from the distinct language\npatterns between bot and normal users. To address this gap, we introduce the\nTextTopoOOD framework for evaluating detection across diverse OOD scenarios:\n(1) attribute-level shifts via text augmentations and embedding perturbations;\n(2) structural shifts through edge rewiring and semantic connections; (3)\nthematically-guided label shifts; and (4) domain-based divisions. Furthermore,\nwe propose TNT-OOD to model the complex interplay between Text aNd Topology\nusing: 1) a novel cross-attention module to fuse local structure into\nnode-level text representations, and 2) a HyperNetwork to generate\nnode-specific transformation parameters. This aligns topological and semantic\nfeatures of ID nodes, enhancing ID/OOD distinction across structural and\ntextual shifts. Experiments on 11 datasets across four OOD scenarios\ndemonstrate the nuanced challenge of TextTopoOOD for evaluating OOD detection\nin text-rich networks.",
        "url": "http://arxiv.org/abs/2508.17690v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17690v1",
        "arxiv_id": "2508.17690v1",
        "authors": [
            "Danny Wang",
            "Ruihong Qiu",
            "Guangdong Bai",
            "Zi Huang"
        ],
        "submitted": "2025-08-25 05:57:29",
        "source": "arxiv",
        "comment": "EMNLP2025 Main"
    },
    {
        "title": "Characterizing the Behavior of Training Mamba-based State Space Models on GPUs",
        "abstract": "Mamba-based State Space Models (SSM) have emerged as a promising alternative\nto the ubiquitous transformers. Despite the expressive power of transformers,\nthe quadratic complexity of computing attention is a major impediment to\nscaling performance as we increase the sequence length. SSMs provide an\nalternative path that addresses this problem, reducing the computational\ncomplexity requirements of self-attention with novel model architectures for\ndifferent domains and fields such as video, text generation and graphs. Thus,\nit is important to characterize the behavior of these emerging workloads on\nGPUs and understand their requirements during GPU microarchitectural design. In\nthis work we evaluate Mamba-based SSMs and characterize their behavior during\ntraining on GPUs. We construct a workload suite that offers representative\nmodels that span different model architectures. We then use this suite to\nanalyze the architectural implications of running Mamba-based SSMs on GPUs. Our\nwork sheds new light on potential optimizations to continue scaling the\nperformance for such models.",
        "url": "http://arxiv.org/abs/2508.17679v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17679v1",
        "arxiv_id": "2508.17679v1",
        "authors": [
            "Trinayan Baruah",
            "Kaustubh Shivdikar",
            "Sara Prescott",
            "David Kaeli"
        ],
        "submitted": "2025-08-25 05:22:27",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CoCoA: Confidence- and Context-Aware Adaptive Decoding for Resolving Knowledge Conflicts in Large Language Models",
        "abstract": "Faithful generation in large language models (LLMs) is challenged by\nknowledge conflicts between parametric memory and external context. Existing\ncontrastive decoding methods tuned specifically to handle conflict often lack\nadaptability and can degrade performance in low conflict settings. We introduce\nCoCoA (Confidence- and Context-Aware Adaptive Decoding), a novel token-level\nalgorithm for principled conflict resolution and enhanced faithfulness. CoCoA\nresolves conflict by utilizing confidence-aware measures (entropy gap and\ncontextual peakedness) and the generalized divergence between the parametric\nand contextual distributions. Crucially, CoCoA maintains strong performance\neven in low conflict settings. Extensive experiments across multiple LLMs on\ndiverse Question Answering (QA), Summarization, and Long-Form Question\nAnswering (LFQA) benchmarks demonstrate CoCoA's state-of-the-art performance\nover strong baselines like AdaCAD. It yields significant gains in QA accuracy,\nup to 9.2 points on average compared to the strong baseline AdaCAD, and\nimproves factuality in summarization and LFQA by up to 2.5 points on average\nacross key benchmarks. Additionally, it demonstrates superior sensitivity to\nconflict variations. CoCoA enables more informed, context-aware, and ultimately\nmore faithful token generation.",
        "url": "http://arxiv.org/abs/2508.17670v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17670v1",
        "arxiv_id": "2508.17670v1",
        "authors": [
            "Anant Khandelwal",
            "Manish Gupta",
            "Puneet Agrawal"
        ],
        "submitted": "2025-08-25 05:06:04",
        "source": "arxiv",
        "comment": "Accepted to EMNLP'25, Main. 21 pages, 17 tables, 3 Figures"
    },
    {
        "title": "Heterogeneous co-occurrence embedding for visual information exploration",
        "abstract": "This paper proposes an embedding method for co-occurrence data aimed at\nvisual information exploration. We consider cases where co-occurrence\nprobabilities are measured between pairs of elements from heterogeneous\ndomains. The proposed method maps these heterogeneous elements into\ncorresponding two-dimensional latent spaces, enabling visualization of\nasymmetric relationships between the domains. The key idea is to embed the\nelements in a way that maximizes their mutual information, thereby preserving\nthe original dependency structure as much as possible. This approach can be\nnaturally extended to cases involving three or more domains, using a\ngeneralization of mutual information known as total correlation. For\ninter-domain analysis, we also propose a visualization method that assigns\ncolors to the latent spaces based on conditional probabilities, allowing users\nto explore asymmetric relationships interactively. We demonstrate the utility\nof the method through applications to an adjective-noun dataset, the NeurIPS\ndataset, and a subject-verb-object dataset, showcasing both intra- and\ninter-domain analysis.",
        "url": "http://arxiv.org/abs/2508.17663v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17663v1",
        "arxiv_id": "2508.17663v1",
        "authors": [
            "Takuro Ishida",
            "Tetsuo Furukawa"
        ],
        "submitted": "2025-08-25 04:51:50",
        "source": "arxiv",
        "comment": "36pages, 9 figures, Accepted to International Journal of Innovative\n  Computing, Information and Control (IJICIC), 2025"
    },
    {
        "title": "SurveyGen: Quality-Aware Scientific Survey Generation with Large Language Models",
        "abstract": "Automatic survey generation has emerged as a key task in scientific document\nprocessing. While large language models (LLMs) have shown promise in generating\nsurvey texts, the lack of standardized evaluation datasets critically hampers\nrigorous assessment of their performance against human-written surveys. In this\nwork, we present SurveyGen, a large-scale dataset comprising over 4,200\nhuman-written surveys across diverse scientific domains, along with 242,143\ncited references and extensive quality-related metadata for both the surveys\nand the cited papers. Leveraging this resource, we build QUAL-SG, a novel\nquality-aware framework for survey generation that enhances the standard\nRetrieval-Augmented Generation (RAG) pipeline by incorporating quality-aware\nindicators into literature retrieval to assess and select higher-quality source\npapers. Using this dataset and framework, we systematically evaluate\nstate-of-the-art LLMs under varying levels of human involvement - from fully\nautomatic generation to human-guided writing. Experimental results and human\nevaluations show that while semi-automatic pipelines can achieve partially\ncompetitive outcomes, fully automatic survey generation still suffers from low\ncitation quality and limited critical analysis.",
        "url": "http://arxiv.org/abs/2508.17647v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17647v1",
        "arxiv_id": "2508.17647v1",
        "authors": [
            "Tong Bao",
            "Mir Tafseer Nayeem",
            "Davood Rafiei",
            "Chengzhi Zhang"
        ],
        "submitted": "2025-08-25 04:22:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Demographically-Inspired Query Variants Using an LLM",
        "abstract": "This study proposes a method to diversify queries in existing test\ncollections to reflect some of the diversity of search engine users, aligning\nwith an earlier vision of an 'ideal' test collection. A Large Language Model\n(LLM) is used to create query variants: alternative queries that have the same\nmeaning as the original. These variants represent user profiles characterised\nby different properties, such as language and domain proficiency, which are\nknown in the IR literature to influence query formulation.\n  The LLM's ability to generate query variants that align with user profiles is\nempirically validated, and the variants' utility is further explored for IR\nsystem evaluation. Results demonstrate that the variants impact how systems are\nranked and show that user profiles experience significantly different levels of\nsystem effectiveness. This method enables an alternative perspective on system\nevaluation where we can observe both the impact of user profiles on system\nrankings and how system performance varies across users.",
        "url": "http://arxiv.org/abs/2508.17644v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17644v1",
        "arxiv_id": "2508.17644v1",
        "authors": [
            "Marwah Alaofi",
            "Nicola Ferro",
            "Paul Thomas",
            "Falk Scholer",
            "Mark Sanderson"
        ],
        "submitted": "2025-08-25 04:17:56",
        "source": "arxiv",
        "comment": "Published in the proceedings of ICTIR'25, Padua, Italy"
    },
    {
        "title": "Dynamic Embedding of Hierarchical Visual Features for Efficient Vision-Language Fine-Tuning",
        "abstract": "Large Vision-Language Models (LVLMs) commonly follow a paradigm that projects\nvisual features and then concatenates them with text tokens to form a unified\nsequence input for Large Language Models (LLMs). However, this paradigm leads\nto a significant increase in the length of the input sequence, resulting in\nsubstantial computational overhead. Existing methods attempt to fuse visual\ninformation into the intermediate layers of LLMs, which alleviate the sequence\nlength issue but often neglect the hierarchical semantic representations within\nthe model and the fine-grained visual information available in the shallower\nvisual encoding layers. To address this limitation, we propose DEHVF, an\nefficient vision-language fine-tuning method based on dynamic embedding and\nfusion of hierarchical visual features. Its core lies in leveraging the\ninherent hierarchical representation characteristics of visual encoders and\nlanguage models. Through a lightweight hierarchical visual fuser, it\ndynamically selects and fuses hierarchical features corresponding to semantic\ngranularity based on the internal representations of each layer in LLMs. The\nfused layer-related visual features are then projected and aligned before being\ndirectly embedded into the Feed-Forward Network (FFN) of the corresponding\nlayer in LLMs. This approach not only avoids sequence expansion but also\ndynamically fuses multi-layer visual information. By fine-tuning only a small\nnumber of parameters, DEHVF achieves precise alignment and complementarity of\ncross-modal information at the same semantic granularity. We conducted\nexperiments across various VL benchmarks, including visual question answering\non ScienceQA and image captioning on COCO Captions. The results demonstrate\nthat DEHVF achieves higher accuracy than existing parameter-efficient\nfine-tuning (PEFT) baselines while maintaining efficient training and\ninference.",
        "url": "http://arxiv.org/abs/2508.17638v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17638v1",
        "arxiv_id": "2508.17638v1",
        "authors": [
            "Xinyu Wei",
            "Guoli Yang",
            "Jialu Zhou",
            "Mingyue Yang",
            "Leqian Li",
            "Kedi Zhang",
            "Chunping Qiu"
        ],
        "submitted": "2025-08-25 03:57:46",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Weights-Rotated Preference Optimization for Large Language Models",
        "abstract": "Despite the efficacy of Direct Preference Optimization (DPO) in aligning\nLarge Language Models (LLMs), reward hacking remains a pivotal challenge. This\nissue emerges when LLMs excessively reduce the probability of rejected\ncompletions to achieve high rewards, without genuinely meeting their intended\ngoals. As a result, this leads to overly lengthy generation lacking diversity,\nas well as catastrophic forgetting of knowledge. We investigate the underlying\nreason behind this issue, which is representation redundancy caused by neuron\ncollapse in the parameter space. Hence, we propose a novel Weights-Rotated\nPreference Optimization (RoPO) algorithm, which implicitly constrains the\noutput layer logits with the KL divergence inherited from DPO and explicitly\nconstrains the intermediate hidden states by fine-tuning on a multi-granularity\northogonal matrix. This design prevents the policy model from deviating too far\nfrom the reference model, thereby retaining the knowledge and expressive\ncapabilities acquired during pre-training and SFT stages. Our RoPO achieves up\nto a 3.27-point improvement on AlpacaEval 2, and surpasses the best baseline by\n6.2 to 7.5 points on MT-Bench with merely 0.015% of the trainable parameters,\ndemonstrating its effectiveness in alleviating the reward hacking problem of\nDPO.",
        "url": "http://arxiv.org/abs/2508.17637v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17637v1",
        "arxiv_id": "2508.17637v1",
        "authors": [
            "Chenxu Yang",
            "Ruipeng Jia",
            "Mingyu Zheng",
            "Naibin Gu",
            "Zheng Lin",
            "Siyuan Chen",
            "Weichong Yin",
            "Hua Wu",
            "Weiping Wang"
        ],
        "submitted": "2025-08-25 03:57:17",
        "source": "arxiv",
        "comment": "EMNLP 2025"
    },
    {
        "title": "Stop Spinning Wheels: Mitigating LLM Overthinking via Mining Patterns for Early Reasoning Exit",
        "abstract": "Large language models (LLMs) enhance complex reasoning tasks by scaling the\nindividual thinking process. However, prior work shows that overthinking can\ndegrade overall performance. Motivated by observed patterns in thinking length\nand content length, we categorize reasoning into three stages: insufficient\nexploration stage, compensatory reasoning stage, and reasoning convergence\nstage. Typically, LLMs produce correct answers in the compensatory reasoning\nstage, whereas reasoning convergence often triggers overthinking, causing\nincreased resource usage or even infinite loops. Therefore, mitigating\noverthinking hinges on detecting the end of the compensatory reasoning stage,\ndefined as the Reasoning Completion Point (RCP). RCP typically appears at the\nend of the first complete reasoning cycle and can be identified by querying the\nLLM sentence by sentence or monitoring the probability of an end-of-thinking\ntoken (e.g., \\texttt{</think>}), though these methods lack an efficient and\nprecise balance. To improve this, we mine more sensitive and consistent RCP\npatterns and develop a lightweight thresholding strategy based on heuristic\nrules. Experimental evaluations on benchmarks (AIME24, AIME25, GPQA-D)\ndemonstrate that the proposed method reduces token consumption while preserving\nor enhancing reasoning accuracy.",
        "url": "http://arxiv.org/abs/2508.17627v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17627v1",
        "arxiv_id": "2508.17627v1",
        "authors": [
            "Zihao Wei",
            "Liang Pang",
            "Jiahao Liu",
            "Jingcheng Deng",
            "Shicheng Xu",
            "Zenghao Duan",
            "Jingang Wang",
            "Fei Sun",
            "Xunliang Cai",
            "Huawei Shen",
            "Xueqi Cheng"
        ],
        "submitted": "2025-08-25 03:17:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "EMO-Reasoning: Benchmarking Emotional Reasoning Capabilities in Spoken Dialogue Systems",
        "abstract": "Speech emotions play a crucial role in human-computer interaction, shaping\nengagement and context-aware communication. Despite recent advances in spoken\ndialogue systems, a holistic system for evaluating emotional reasoning is still\nlacking. To address this, we introduce EMO-Reasoning, a benchmark for assessing\nemotional coherence in dialogue systems. It leverages a curated dataset\ngenerated via text-to-speech to simulate diverse emotional states, overcoming\nthe scarcity of emotional speech data. We further propose the Cross-turn\nEmotion Reasoning Score to assess the emotion transitions in multi-turn\ndialogues. Evaluating seven dialogue systems through continuous, categorical,\nand perceptual metrics, we show that our framework effectively detects\nemotional inconsistencies, providing insights for improving current dialogue\nsystems. By releasing a systematic evaluation benchmark, we aim to advance\nemotion-aware spoken dialogue modeling toward more natural and adaptive\ninteractions.",
        "url": "http://arxiv.org/abs/2508.17623v2",
        "pdf_url": "http://arxiv.org/pdf/2508.17623v2",
        "arxiv_id": "2508.17623v2",
        "authors": [
            "Jingwen Liu",
            "Kan Jen Cheng",
            "Jiachen Lian",
            "Akshay Anand",
            "Rishi Jain",
            "Faith Qiao",
            "Robin Netzorg",
            "Huang-Cheng Chou",
            "Tingle Li",
            "Guan-Ting Lin",
            "Gopala Anumanchipalli"
        ],
        "submitted": "2025-08-25 03:01:40",
        "source": "arxiv",
        "comment": "Accepted at (ASRU 2025) 2025 IEEE Automatic Speech Recognition and\n  Understanding Workshop"
    },
    {
        "title": "Steering When Necessary: Flexible Steering Large Language Models with Backtracking",
        "abstract": "Large language models (LLMs) have achieved remarkable performance across many\ngeneration tasks. Nevertheless, effectively aligning them with desired\nbehaviors remains a significant challenge. Activation steering is an effective\nand cost-efficient approach that directly modifies the activations of LLMs\nduring the inference stage, aligning their responses with the desired behaviors\nand avoiding the high cost of fine-tuning. Existing methods typically\nindiscriminately intervene to all generations or rely solely on the question to\ndetermine intervention, which limits the accurate assessment of the\nintervention strength. To this end, we propose the Flexible Activation Steering\nwith Backtracking (FASB) framework, which dynamically determines both the\nnecessity and strength of intervention by tracking the internal states of the\nLLMs during generation, considering both the question and the generated\ncontent. Since intervening after detecting a deviation from the desired\nbehavior is often too late, we further propose the backtracking mechanism to\ncorrect the deviated tokens and steer the LLMs toward the desired behavior.\nExtensive experiments on the TruthfulQA dataset and six multiple-choice\ndatasets demonstrate that our method outperforms baselines. Our code will be\nreleased at https://github.com/gjw185/FASB.",
        "url": "http://arxiv.org/abs/2508.17621v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17621v1",
        "arxiv_id": "2508.17621v1",
        "authors": [
            "Jinwei Gan",
            "Zifeng Cheng",
            "Zhiwei Jiang",
            "Cong Wang",
            "Yafeng Yin",
            "Xiang Luo",
            "Yuchen Fu",
            "Qing Gu"
        ],
        "submitted": "2025-08-25 03:01:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Preference Trajectory Modeling via Flow Matching for Sequential Recommendation",
        "abstract": "Sequential recommendation predicts each user's next item based on their\nhistorical interaction sequence. Recently, diffusion models have attracted\nsignificant attention in this area due to their strong ability to model user\ninterest distributions. They typically generate target items by denoising\nGaussian noise conditioned on historical interactions. However, these models\nface two critical limitations. First, they exhibit high sensitivity to the\ncondition, making it difficult to recover target items from pure Gaussian\nnoise. Second, the inference process is computationally expensive, limiting\npractical deployment. To address these issues, we propose FlowRec, a simple yet\neffective sequential recommendation framework which leverages flow matching to\nexplicitly model user preference trajectories from current states to future\ninterests. Flow matching is an emerging generative paradigm, which offers\ngreater flexibility in initial distributions and enables more efficient\nsampling. Based on this, we construct a personalized behavior-based prior\ndistribution to replace Gaussian noise and learn a vector field to model user\npreference trajectories. To better align flow matching with the recommendation\nobjective, we further design a single-step alignment loss incorporating both\npositive and negative samples, improving sampling efficiency and generation\nquality. Extensive experiments on four benchmark datasets verify the\nsuperiority of FlowRec over the state-of-the-art baselines.",
        "url": "http://arxiv.org/abs/2508.17618v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17618v1",
        "arxiv_id": "2508.17618v1",
        "authors": [
            "Li Li",
            "Mingyue Cheng",
            "Yuyang Ye",
            "Zhiding Liu",
            "Enhong Chen"
        ],
        "submitted": "2025-08-25 02:55:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Less Is More? Examining Fairness in Pruned Large Language Models for Summarising Opinions",
        "abstract": "Model compression through post-training pruning offers a way to reduce model\nsize and computational requirements without significantly impacting model\nperformance. However, the effect of pruning on the fairness of LLM-generated\nsummaries remains unexplored, particularly for opinion summarisation where\nbiased outputs could influence public views.In this paper, we present a\ncomprehensive empirical analysis of opinion summarisation, examining three\nstate-of-the-art pruning methods and various calibration sets across three\nopen-source LLMs using four fairness metrics. Our systematic analysis reveals\nthat pruning methods have a greater impact on fairness than calibration sets.\nBuilding on these insights, we propose High Gradient Low Activation (HGLA)\npruning, which identifies and removes parameters that are redundant for input\nprocessing but influential in output generation. Our experiments demonstrate\nthat HGLA can better maintain or even improve fairness compared to existing\nmethods, showing promise across models and tasks where traditional methods have\nlimitations. Our human evaluation shows HGLA-generated outputs are fairer than\nexisting state-of-the-art pruning methods. Code is available at:\nhttps://github.com/amberhuang01/HGLA.",
        "url": "http://arxiv.org/abs/2508.17610v2",
        "pdf_url": "http://arxiv.org/pdf/2508.17610v2",
        "arxiv_id": "2508.17610v2",
        "authors": [
            "Nannan Huang",
            "Haytham Fayek",
            "Xiuzhen Zhang"
        ],
        "submitted": "2025-08-25 02:40:55",
        "source": "arxiv",
        "comment": "Accepted to EMNLP 2025 Main Conference"
    },
    {
        "title": "RubikSQL: Lifelong Learning Agentic Knowledge Base as an Industrial NL2SQL System",
        "abstract": "We present RubikSQL, a novel NL2SQL system designed to address key challenges\nin real-world enterprise-level NL2SQL, such as implicit intents and\ndomain-specific terminology. RubikSQL frames NL2SQL as a lifelong learning\ntask, demanding both Knowledge Base (KB) maintenance and SQL generation.\nRubikSQL systematically builds and refines its KB through techniques including\ndatabase profiling, structured information extraction, agentic rule mining, and\nChain-of-Thought (CoT)-enhanced SQL profiling. RubikSQL then employs a\nmulti-agent workflow to leverage this curated KB, generating accurate SQLs.\nRubikSQL achieves SOTA performance on both the KaggleDBQA and BIRD Mini-Dev\ndatasets. Finally, we release the RubikBench benchmark, a new benchmark\nspecifically designed to capture vital traits of industrial NL2SQL scenarios,\nproviding a valuable resource for future research.",
        "url": "http://arxiv.org/abs/2508.17590v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17590v1",
        "arxiv_id": "2508.17590v1",
        "authors": [
            "Zui Chen",
            "Han Li",
            "Xinhao Zhang",
            "Xiaoyu Chen",
            "Chunyin Dong",
            "Yifeng Wang",
            "Xin Cai",
            "Su Zhang",
            "Ziqi Li",
            "Chi Ding",
            "Jinxu Li",
            "Shuai Wang",
            "Dousheng Zhao",
            "Sanhai Gao",
            "Guangyi Liu"
        ],
        "submitted": "2025-08-25 01:28:37",
        "source": "arxiv",
        "comment": "18 pages, 3 figures, 3 tables, to be submitted to VLDB 2026 (PVLDB\n  Volume 19)"
    },
    {
        "title": "UQ: Assessing Language Models on Unsolved Questions",
        "abstract": "Benchmarks shape progress in AI research. A useful benchmark should be both\ndifficult and realistic: questions should challenge frontier models while also\nreflecting real-world usage. Yet, current paradigms face a difficulty-realism\ntension: exam-style benchmarks are often made artificially difficult with\nlimited real-world value, while benchmarks based on real user interaction often\nskew toward easy, high-frequency problems. In this work, we explore a radically\ndifferent paradigm: assessing models on unsolved questions. Rather than a\nstatic benchmark scored once, we curate unsolved questions and evaluate models\nasynchronously over time with validator-assisted screening and community\nverification. We introduce UQ, a testbed of 500 challenging, diverse questions\nsourced from Stack Exchange, spanning topics from CS theory and math to sci-fi\nand history, probing capabilities including reasoning, factuality, and\nbrowsing. UQ is difficult and realistic by construction: unsolved questions are\noften hard and naturally arise when humans seek answers, thus solving them\nyields direct real-world value. Our contributions are threefold: (1) UQ-Dataset\nand its collection pipeline combining rule-based filters, LLM judges, and human\nreview to ensure question quality (e.g., well-defined and difficult); (2)\nUQ-Validators, compound validation strategies that leverage the\ngenerator-validator gap to provide evaluation signals and pre-screen candidate\nsolutions for human review; and (3) UQ-Platform, an open platform where experts\ncollectively verify questions and solutions. The top model passes UQ-validation\non only 15% of questions, and preliminary human verification has already\nidentified correct answers among those that passed. UQ charts a path for\nevaluating frontier models on real-world, open-ended challenges, where success\npushes the frontier of human knowledge. We release UQ at\nhttps://uq.stanford.edu.",
        "url": "http://arxiv.org/abs/2508.17580v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17580v1",
        "arxiv_id": "2508.17580v1",
        "authors": [
            "Fan Nie",
            "Ken Ziyu Liu",
            "Zihao Wang",
            "Rui Sun",
            "Wei Liu",
            "Weijia Shi",
            "Huaxiu Yao",
            "Linjun Zhang",
            "Andrew Y. Ng",
            "James Zou",
            "Sanmi Koyejo",
            "Yejin Choi",
            "Percy Liang",
            "Niklas Muennighoff"
        ],
        "submitted": "2025-08-25 01:07:59",
        "source": "arxiv",
        "comment": "FN, KZL, and NM are project co-leads and contributed equally. Project\n  website: https://uq.stanford.edu"
    },
    {
        "title": "CausalSent: Interpretable Sentiment Classification with RieszNet",
        "abstract": "Despite the overwhelming performance improvements offered by recent natural\nlanguage processing (NLP) models, the decisions made by these models are\nlargely a black box. Towards closing this gap, the field of causal NLP combines\ncausal inference literature with modern NLP models to elucidate causal effects\nof text features. We replicate and extend Bansal et al's work on regularizing\ntext classifiers to adhere to estimated effects, focusing instead on model\ninterpretability. Specifically, we focus on developing a two-headed\nRieszNet-based neural network architecture which achieves better treatment\neffect estimation accuracy. Our framework, CausalSent, accurately predicts\ntreatment effects in semi-synthetic IMDB movie reviews, reducing MAE of effect\nestimates by 2-3x compared to Bansal et al's MAE on synthetic Civil Comments\ndata. With an ensemble of validated models, we perform an observational case\nstudy on the causal effect of the word \"love\" in IMDB movie reviews, finding\nthat the presence of the word \"love\" causes a +2.9% increase in the probability\nof a positive sentiment.",
        "url": "http://arxiv.org/abs/2508.17576v2",
        "pdf_url": "http://arxiv.org/pdf/2508.17576v2",
        "arxiv_id": "2508.17576v2",
        "authors": [
            "Daniel Frees",
            "Martin Pollack"
        ],
        "submitted": "2025-08-25 00:56:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Humanizing Machines: Rethinking LLM Anthropomorphism Through a Multi-Level Framework of Design",
        "abstract": "Large Language Models (LLMs) increasingly exhibit \\textbf{anthropomorphism}\ncharacteristics -- human-like qualities portrayed across their outlook,\nlanguage, behavior, and reasoning functions. Such characteristics enable more\nintuitive and engaging human-AI interactions. However, current research on\nanthropomorphism remains predominantly risk-focused, emphasizing over-trust and\nuser deception while offering limited design guidance. We argue that\nanthropomorphism should instead be treated as a \\emph{concept of design} that\ncan be intentionally tuned to support user goals. Drawing from multiple\ndisciplines, we propose that the anthropomorphism of an LLM-based artifact\nshould reflect the interaction between artifact designers and interpreters.\nThis interaction is facilitated by cues embedded in the artifact by the\ndesigners and the (cognitive) responses of the interpreters to the cues. Cues\nare categorized into four dimensions: \\textit{perceptive, linguistic,\nbehavioral}, and \\textit{cognitive}. By analyzing the manifestation and\neffectiveness of each cue, we provide a unified taxonomy with actionable levers\nfor practitioners. Consequently, we advocate for function-oriented evaluations\nof anthropomorphic design.",
        "url": "http://arxiv.org/abs/2508.17573v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17573v1",
        "arxiv_id": "2508.17573v1",
        "authors": [
            "Yunze Xiao",
            "Lynnette Hui Xian Ng",
            "Jiarui Liu",
            "Mona T. Diab"
        ],
        "submitted": "2025-08-25 00:48:39",
        "source": "arxiv",
        "comment": "Accepted in EMNLP main proceedings"
    },
    {
        "title": "A Universal Framework for Offline Serendipity Evaluation in Recommender Systems via Large Language Models",
        "abstract": "Serendipity in recommender systems (RSs) has attracted increasing attention\nas a concept that enhances user satisfaction by presenting unexpected and\nuseful items. However, evaluating serendipitous performance remains challenging\nbecause its ground truth is generally unobservable. The existing offline\nmetrics often depend on ambiguous definitions or are tailored to specific\ndatasets and RSs, thereby limiting their generalizability. To address this\nissue, we propose a universally applicable evaluation framework that leverages\nlarge language models (LLMs) known for their extensive knowledge and reasoning\ncapabilities, as evaluators. First, to improve the evaluation performance of\nthe proposed framework, we assessed the serendipity prediction accuracy of LLMs\nusing four different prompt strategies on a dataset containing user-annotated\nserendipitous ground truth and found that the chain-of-thought prompt achieved\nthe highest accuracy. Next, we re-evaluated the serendipitous performance of\nboth serendipity-oriented and general RSs using the proposed framework on three\ncommonly used real-world datasets, without the ground truth. The results\nindicated that there was no serendipity-oriented RS that consistently\noutperformed across all datasets, and even a general RS sometimes achieved\nhigher performance than the serendipity-oriented RS.",
        "url": "http://arxiv.org/abs/2508.17571v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17571v1",
        "arxiv_id": "2508.17571v1",
        "authors": [
            "Yu Tokutake",
            "Kazushi Okamoto",
            "Kei Harada",
            "Atsushi Shibata",
            "Koki Karube"
        ],
        "submitted": "2025-08-25 00:45:16",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Activation Transport Operators",
        "abstract": "The residual stream mediates communication between transformer decoder layers\nvia linear reads and writes of non-linear computations. While sparse-dictionary\nlearning-based methods locate features in the residual stream, and activation\npatching methods discover circuits within the model, the mechanism by which\nfeatures flow through the residual stream remains understudied. Understanding\nthis dynamic can better inform jailbreaking protections, enable early detection\nof model mistakes, and their correction. In this work, we propose Activation\nTransport Operators (ATO), linear maps from upstream to downstream residuals\n$k$ layers later, evaluated in feature space using downstream SAE decoder\nprojections. We empirically demonstrate that these operators can determine\nwhether a feature has been linearly transported from a previous layer or\nsynthesised from non-linear layer computation. We develop the notion of\ntransport efficiency, for which we provide an upper bound, and use it to\nestimate the size of the residual stream subspace that corresponds to linear\ntransport. We empirically demonstrate the linear transport, report transport\nefficiency and the size of the residual stream's subspace involved in linear\ntransport. This compute-light (no finetuning, <50 GPU-h) method offers\npractical tools for safety, debugging, and a clearer picture of where\ncomputation in LLMs behaves linearly.",
        "url": "http://arxiv.org/abs/2508.17540v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17540v1",
        "arxiv_id": "2508.17540v1",
        "authors": [
            "Andrzej Szablewski",
            "Marek Masiak"
        ],
        "submitted": "2025-08-24 22:22:09",
        "source": "arxiv",
        "comment": "4 pages, 4 figures, references and appendices"
    },
    {
        "title": "Debate or Vote: Which Yields Better Decisions in Multi-Agent Large Language Models?",
        "abstract": "Multi-Agent Debate~(MAD) has emerged as a promising paradigm for improving\nthe performance of large language models through collaborative reasoning.\nDespite recent advances, the key factors driving MAD's effectiveness remain\nunclear. In this work, we disentangle MAD into two key components--Majority\nVoting and inter-agent Debate--and assess their respective contributions.\nThrough extensive experiments across seven NLP benchmarks, we find that\nMajority Voting alone accounts for most of the performance gains typically\nattributed to MAD. To explain this, we propose a theoretical framework that\nmodels debate as a stochastic process. We prove that it induces a martingale\nover agents' belief trajectories, implying that debate alone does not improve\nexpected correctness. Guided by these insights, we demonstrate that targeted\ninterventions, by biasing the belief update toward correction, can meaningfully\nenhance debate effectiveness. Overall, our findings suggest that while MAD has\npotential, simple ensembling methods remain strong and more reliable\nalternatives in many practical settings. Code is released in\nhttps://github.com/deeplearning-wisc/debate-or-vote.",
        "url": "http://arxiv.org/abs/2508.17536v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17536v1",
        "arxiv_id": "2508.17536v1",
        "authors": [
            "Hyeong Kyu Choi",
            "Xiaojin Zhu",
            "Yixuan Li"
        ],
        "submitted": "2025-08-24 22:14:32",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Improving French Synthetic Speech Quality via SSML Prosody Control",
        "abstract": "Despite recent advances, synthetic voices often lack expressiveness due to\nlimited prosody control in commercial text-to-speech (TTS) systems. We\nintroduce the first end-to-end pipeline that inserts Speech Synthesis Markup\nLanguage (SSML) tags into French text to control pitch, speaking rate, volume,\nand pause duration. We employ a cascaded architecture with two QLoRA-fine-tuned\nQwen 2.5-7B models: one predicts phrase-break positions and the other performs\nregression on prosodic targets, generating commercial TTS-compatible SSML\nmarkup. Evaluated on a 14-hour French podcast corpus, our method achieves 99.2%\nF1 for break placement and reduces mean absolute error on pitch, rate, and\nvolume by 25-40% compared with prompting-only large language models (LLMs) and\na BiLSTM baseline. In perceptual evaluation involving 18 participants across\nover 9 hours of synthesized audio, SSML-enhanced speech generated by our\npipeline significantly improves naturalness, with the mean opinion score\nincreasing from 3.20 to 3.87 (p < 0.005). Additionally, 15 of 18 listeners\npreferred our enhanced synthesis. These results demonstrate substantial\nprogress in bridging the expressiveness gap between synthetic and natural\nFrench speech. Our code is publicly available at\nhttps://github.com/hi-paris/Prosody-Control-French-TTS.",
        "url": "http://arxiv.org/abs/2508.17494v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17494v1",
        "arxiv_id": "2508.17494v1",
        "authors": [
            "Nassima Ould Ouali",
            "Awais Hussain Sani",
            "Ruben Bueno",
            "Jonah Dauvet",
            "Tim Luka Horstmann",
            "Eric Moulines"
        ],
        "submitted": "2025-08-24 19:07:59",
        "source": "arxiv",
        "comment": "13 pages, 9 figures, 6 tables. Accepted for presentation at ICNLSP\n  2025 (Odense, Denmark). Code and demo:\n  https://github.com/hi-paris/Prosody-Control-French-TTS. ACM Class: I.2.7;\n  H.5.5"
    },
    {
        "title": "Efficient Zero-Shot Long Document Classification by Reducing Context Through Sentence Ranking",
        "abstract": "Transformer-based models like BERT excel at short text classification but\nstruggle with long document classification (LDC) due to input length\nlimitations and computational inefficiencies. In this work, we propose an\nefficient, zero-shot approach to LDC that leverages sentence ranking to reduce\ninput context without altering the model architecture. Our method enables the\nadaptation of models trained on short texts, such as headlines, to long-form\ndocuments by selecting the most informative sentences using a TF-IDF-based\nranking strategy. Using the MahaNews dataset of long Marathi news articles, we\nevaluate three context reduction strategies that prioritize essential content\nwhile preserving classification accuracy. Our results show that retaining only\nthe top 50\\% ranked sentences maintains performance comparable to full-document\ninference while reducing inference time by up to 35\\%. This demonstrates that\nsentence ranking is a simple yet effective technique for scalable and efficient\nzero-shot LDC.",
        "url": "http://arxiv.org/abs/2508.17490v1",
        "pdf_url": "http://arxiv.org/pdf/2508.17490v1",
        "arxiv_id": "2508.17490v1",
        "authors": [
            "Prathamesh Kokate",
            "Mitali Sarnaik",
            "Manavi Khopade",
            "Mukta Takalikar",
            "Raviraj Joshi"
        ],
        "submitted": "2025-08-24 18:52:37",
        "source": "arxiv",
        "comment": null
    }
]