[
    {
        "title": "Quantifying the Effect of Test Set Contamination on Generative Evaluations",
        "abstract": "As frontier AI systems are pretrained on web-scale data, test set contamination has become a critical concern for accurately assessing their capabilities. While research has thoroughly investigated the impact of test set contamination on discriminative evaluations like multiple-choice question-answering, comparatively little research has studied the impact of test set contamination on generative evaluations. In this work, we quantitatively assess the effect of test set contamination on generative evaluations through the language model lifecycle. We pretrain language models on mixtures of web data and the MATH benchmark, sweeping model sizes and number of test set replicas contaminating the pretraining corpus; performance improves with contamination and model size. Using scaling laws, we make a surprising discovery: including even a single test set replica enables models to achieve lower loss than the irreducible error of training on the uncontaminated corpus. We then study further training: overtraining with fresh data reduces the effects of contamination, whereas supervised finetuning on the training set can either increase or decrease performance on test data, depending on the amount of pretraining contamination. Finally, at inference, we identify factors that modulate memorization: high sampling temperatures mitigate contamination effects, and longer solutions are exponentially more difficult to memorize than shorter ones, presenting a contrast with discriminative evaluations, where solutions are only a few tokens in length. By characterizing how generation and memorization interact, we highlight a new layer of complexity for trustworthy evaluation of AI systems.",
        "url": "http://arxiv.org/abs/2601.04301v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04301v1",
        "arxiv_id": "2601.04301v1",
        "authors": [
            "Rylan Schaeffer",
            "Joshua Kazdan",
            "Baber Abbasi",
            "Ken Ziyu Liu",
            "Brando Miranda",
            "Ahmed Ahmed",
            "Abhay Puri",
            "Niloofar Mireshghallah",
            "Sanmi Koyejo"
        ],
        "submitted": "2026-01-07 18:46:22",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "All That Glisters Is Not Gold: A Benchmark for Reference-Free Counterfactual Financial Misinformation Detection",
        "abstract": "We introduce RFC Bench, a benchmark for evaluating large language models on financial misinformation under realistic news. RFC Bench operates at the paragraph level and captures the contextual complexity of financial news where meaning emerges from dispersed cues. The benchmark defines two complementary tasks: reference free misinformation detection and comparison based diagnosis using paired original perturbed inputs. Experiments reveal a consistent pattern: performance is substantially stronger when comparative context is available, while reference free settings expose significant weaknesses, including unstable predictions and elevated invalid outputs. These results indicate that current models struggle to maintain coherent belief states without external grounding. By highlighting this gap, RFC Bench provides a structured testbed for studying reference free reasoning and advancing more reliable financial misinformation detection in real world settings.",
        "url": "http://arxiv.org/abs/2601.04160v2",
        "pdf_url": "https://arxiv.org/pdf/2601.04160v2",
        "arxiv_id": "2601.04160v2",
        "authors": [
            "Yuechen Jiang",
            "Zhiwei Liu",
            "Yupeng Cao",
            "Yueru He",
            "Chen Xu",
            "Ziyang Xu",
            "Zhiyang Deng",
            "Prayag Tiwari",
            "Xi Chen",
            "Alejandro Lopez-Lira",
            "Jimin Huang",
            "Junichi Tsujii",
            "Sophia Ananiadou"
        ],
        "submitted": "2026-01-07 18:18:28",
        "source": "arxiv",
        "comment": "49 pages; 24 figures"
    },
    {
        "title": "FLEx: Language Modeling with Few-shot Language Explanations",
        "abstract": "Language models have become effective at a wide range of tasks, from math problem solving to open-domain question answering. However, they still make mistakes, and these mistakes are often repeated across related queries. Natural language explanations can help correct these errors, but collecting them at scale may be infeasible, particularly in domains where expert annotators are required. To address this issue, we introduce FLEx ($\\textbf{F}$ew-shot $\\textbf{L}$anguage $\\textbf{Ex}$planations), a method for improving model behavior using a small number of explanatory examples. FLEx selects representative model errors using embedding-based clustering, verifies that the associated explanations correct those errors, and summarizes them into a prompt prefix that is prepended at inference-time. This summary guides the model to avoid similar errors on new inputs, without modifying model weights. We evaluate FLEx on CounterBench, GSM8K, and ReasonIF. We find that FLEx consistently outperforms chain-of-thought (CoT) prompting across all three datasets and reduces up to 83\\% of CoT's remaining errors.",
        "url": "http://arxiv.org/abs/2601.04157v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04157v1",
        "arxiv_id": "2601.04157v1",
        "authors": [
            "Adar Avsian",
            "Christopher Richardson",
            "Anirudh Sundar",
            "Larry Heck"
        ],
        "submitted": "2026-01-07 18:12:05",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LLMberjack: Guided Trimming of Debate Trees for Multi-Party Conversation Creation",
        "abstract": "We present LLMberjack, a platform for creating multi-party conversations starting from existing debates, originally structured as reply trees. The system offers an interactive interface that visualizes discussion trees and enables users to construct coherent linearized dialogue sequences while preserving participant identity and discourse relations. It integrates optional large language model (LLM) assistance to support automatic editing of the messages and speakers' descriptions. We demonstrate the platform's utility by showing how tree visualization facilitates the creation of coherent, meaningful conversation threads and how LLM support enhances output quality while reducing human effort. The tool is open-source and designed to promote transparent and reproducible workflows to create multi-party conversations, addressing a lack of resources of this type.",
        "url": "http://arxiv.org/abs/2601.04135v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04135v1",
        "arxiv_id": "2601.04135v1",
        "authors": [
            "Leonardo Bottona",
            "Nicolò Penzo",
            "Bruno Lepri",
            "Marco Guerini",
            "Sara Tonelli"
        ],
        "submitted": "2026-01-07 17:49:17",
        "source": "arxiv",
        "comment": "9 pages, 3 figures"
    },
    {
        "title": "ContextFocus: Activation Steering for Contextual Faithfulness in Large Language Models",
        "abstract": "Large Language Models (LLMs) encode vast amounts of parametric knowledge during pre-training. As world knowledge evolves, effective deployment increasingly depends on their ability to faithfully follow externally retrieved context. When such evidence conflicts with the model's internal knowledge, LLMs often default to memorized facts, producing unfaithful outputs. In this work, we introduce ContextFocus, a lightweight activation steering approach that improves context faithfulness in such knowledge-conflict settings while preserving fluency and efficiency. Unlike prior approaches, our solution requires no model finetuning and incurs minimal inference-time overhead, making it highly efficient. We evaluate ContextFocus on the ConFiQA benchmark, comparing it against strong baselines including ContextDPO, COIECD, and prompting-based methods. Furthermore, we show that our method is complementary to prompting strategies and remains effective on larger models. Extensive experiments show that ContextFocus significantly improves contextual-faithfulness. Our results highlight the effectiveness, robustness, and efficiency of ContextFocus in improving contextual-faithfulness of LLM outputs.",
        "url": "http://arxiv.org/abs/2601.04131v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04131v1",
        "arxiv_id": "2601.04131v1",
        "authors": [
            "Nikhil Anand",
            "Shwetha Somasundaram",
            "Anirudh Phukan",
            "Apoorv Saxena",
            "Koyel Mukherjee"
        ],
        "submitted": "2026-01-07 17:45:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "InfiniteWeb: Scalable Web Environment Synthesis for GUI Agent Training",
        "abstract": "GUI agents that interact with graphical interfaces on behalf of users represent a promising direction for practical AI assistants. However, training such agents is hindered by the scarcity of suitable environments. We present InfiniteWeb, a system that automatically generates functional web environments at scale for GUI agent training. While LLMs perform well on generating a single webpage, building a realistic and functional website with many interconnected pages faces challenges. We address these challenges through unified specification, task-centric test-driven development, and a combination of website seed with reference design image to ensure diversity. Our system also generates verifiable task evaluators enabling dense reward signals for reinforcement learning. Experiments show that InfiniteWeb surpasses commercial coding agents at realistic website construction, and GUI agents trained on our generated environments achieve significant performance improvements on OSWorld and Online-Mind2Web, demonstrating the effectiveness of proposed system.",
        "url": "http://arxiv.org/abs/2601.04126v2",
        "pdf_url": "https://arxiv.org/pdf/2601.04126v2",
        "arxiv_id": "2601.04126v2",
        "authors": [
            "Ziyun Zhang",
            "Zezhou Wang",
            "Xiaoyi Zhang",
            "Zongyu Guo",
            "Jiahao Li",
            "Bin Li",
            "Yan Lu"
        ],
        "submitted": "2026-01-07 17:40:08",
        "source": "arxiv",
        "comment": "Work In Progress"
    },
    {
        "title": "ArtCognition: A Multimodal AI Framework for Affective State Sensing from Visual and Kinematic Drawing Cues",
        "abstract": "The objective assessment of human affective and psychological states presents a significant challenge, particularly through non-verbal channels. This paper introduces digital drawing as a rich and underexplored modality for affective sensing. We present a novel multimodal framework, named ArtCognition, for the automated analysis of the House-Tree-Person (HTP) test, a widely used psychological instrument. ArtCognition uniquely fuses two distinct data streams: static visual features from the final artwork, captured by computer vision models, and dynamic behavioral kinematic cues derived from the drawing process itself, such as stroke speed, pauses, and smoothness. To bridge the gap between low-level features and high-level psychological interpretation, we employ a Retrieval-Augmented Generation (RAG) architecture. This grounds the analysis in established psychological knowledge, enhancing explainability and reducing the potential for model hallucination. Our results demonstrate that the fusion of visual and behavioral kinematic cues provides a more nuanced assessment than either modality alone. We show significant correlations between the extracted multimodal features and standardized psychological metrics, validating the framework's potential as a scalable tool to support clinicians. This work contributes a new methodology for non-intrusive affective state assessment and opens new avenues for technology-assisted mental healthcare.",
        "url": "http://arxiv.org/abs/2601.04297v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04297v1",
        "arxiv_id": "2601.04297v1",
        "authors": [
            "Behrad Binaei-Haghighi",
            "Nafiseh Sadat Sajadi",
            "Mehrad Liviyan",
            "Reyhane Akhavan Kharazi",
            "Fatemeh Amirkhani",
            "Behnam Bahrak"
        ],
        "submitted": "2026-01-07 17:35:37",
        "source": "arxiv",
        "comment": "12 pages, 7 figures"
    },
    {
        "title": "Layer-wise Positional Bias in Short-Context Language Modeling",
        "abstract": "Language models often show a preference for using information from specific positions in the input regardless of semantic relevance. While positional bias has been studied in various contexts, from attention sinks to task performance degradation in long-context settings, prior work has not established how these biases evolve across individual layers and input positions, or how they vary independent of task complexity. We introduce an attribution-based framework to analyze positional effects in short-context language modeling. Using layer conductance with a sliding-window approach, we quantify how each layer distributes importance across input positions, yielding layer-wise positional importance profiles. We find that these profiles are architecture-specific, stable across inputs, and invariant to lexical scrambling. Characterizing these profiles, we find prominent recency bias that increases with depth and subtle primacy bias that diminishes through model depth. Beyond positional structure, we also show that early layers preferentially weight content words over function words across all positions, while later layers lose this word-type differentiation.",
        "url": "http://arxiv.org/abs/2601.04098v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04098v1",
        "arxiv_id": "2601.04098v1",
        "authors": [
            "Maryam Rahimi",
            "Mahdi Nouri",
            "Yadollah Yaghoobzadeh"
        ],
        "submitted": "2026-01-07 17:04:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SearchAttack: Red-Teaming LLMs against Real-World Threats via Framing Unsafe Web Information-Seeking Tasks",
        "abstract": "Recently, people have suffered and become increasingly aware of the unreliability gap in LLMs for open and knowledge-intensive tasks, and thus turn to search-augmented LLMs to mitigate this issue. However, when the search engine is triggered for harmful tasks, the outcome is no longer under the LLM's control. Once the returned content directly contains targeted, ready-to-use harmful takeaways, the LLM's safeguards cannot withdraw that exposure. Motivated by this dilemma, we identify web search as a critical attack surface and propose \\textbf{\\textit{SearchAttack}} for red-teaming. SearchAttack outsources the harmful semantics to web search, retaining only the query's skeleton and fragmented clues, and further steers LLMs to reconstruct the retrieved content via structural rubrics to achieve malicious goals. Extensive experiments are conducted to red-team the search-augmented LLMs for responsible vulnerability assessment. Empirically, SearchAttack demonstrates strong effectiveness in attacking these systems.",
        "url": "http://arxiv.org/abs/2601.04093v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04093v1",
        "arxiv_id": "2601.04093v1",
        "authors": [
            "Yu Yan",
            "Sheng Sun",
            "Mingfeng Li",
            "Zheming Yang",
            "Chiwei Zhu",
            "Fei Ma",
            "Benfeng Xu",
            "Min Liu"
        ],
        "submitted": "2026-01-07 16:59:34",
        "source": "arxiv",
        "comment": "We find that the key to jailbreak the LLM is objectifying its safety responsibility, thus we delegate the open-web to inject harmful semantics and get the huge gain from unmoderated web resources"
    },
    {
        "title": "KDCM: Reducing Hallucination in LLMs through Explicit Reasoning Structures",
        "abstract": "To mitigate hallucinations in large language models (LLMs), we propose a framework that focuses on errors induced by prompts. Our method extends a chain-style knowledge distillation approach by incorporating a programmable module that guides knowledge graph exploration. This module is embedded as executable code within the reasoning prompt, allowing the model to leverage external structured knowledge during inference. Based on this design, we develop an enhanced distillation-based reasoning framework that explicitly regulates intermediate reasoning steps, resulting in more reliable predictions. We evaluate the proposed approach on multiple public benchmarks using GPT-4 and LLaMA-3.3. Experimental results show that code-guided reasoning significantly improves contextual modeling and reduces prompt-induced hallucinations. Specifically, HIT@1, HIT@3, and HIT@5 increase by 15.64%, 13.38%, and 13.28%, respectively, with scores exceeding 95% across several evaluation settings. These findings indicate that the proposed method effectively constrains erroneous reasoning while improving both accuracy and interpretability.",
        "url": "http://arxiv.org/abs/2601.04086v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04086v1",
        "arxiv_id": "2601.04086v1",
        "authors": [
            "Jinbo Hao",
            "Kai Yang",
            "Qingzhen Su",
            "Yifan Li",
            "Chao Jiang"
        ],
        "submitted": "2026-01-07 16:54:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Analyzing Reasoning Consistency in Large Multimodal Models under Cross-Modal Conflicts",
        "abstract": "Large Multimodal Models (LMMs) have demonstrated impressive capabilities in video reasoning via Chain-of-Thought (CoT). However, the robustness of their reasoning chains remains questionable. In this paper, we identify a critical failure mode termed textual inertia, where once a textual hallucination occurs in the thinking process, models tend to blindly adhere to the erroneous text while neglecting conflicting visual evidence. To systematically investigate this, we propose the LogicGraph Perturbation Protocol that structurally injects perturbations into the reasoning chains of diverse LMMs spanning both native reasoning architectures and prompt-driven paradigms to evaluate their self-reflection capabilities. The results reveal that models successfully self-correct in less than 10% of cases and predominantly succumb to blind textual error propagation. To mitigate this, we introduce Active Visual-Context Refinement, a training-free inference paradigm which orchestrates an active visual re-grounding mechanism to enforce fine-grained verification coupled with an adaptive context refinement strategy to summarize and denoise the reasoning history. Experiments demonstrate that our approach significantly stifles hallucination propagation and enhances reasoning robustness.",
        "url": "http://arxiv.org/abs/2601.04073v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04073v1",
        "arxiv_id": "2601.04073v1",
        "authors": [
            "Zhihao Zhu",
            "Jiafeng Liang",
            "Shixin Jiang",
            "Jinlan Fu",
            "Ming Liu",
            "Guanglu Sun",
            "See-Kiong Ng",
            "Bing Qin"
        ],
        "submitted": "2026-01-07 16:39:34",
        "source": "arxiv",
        "comment": "10 pages, 5 figures"
    },
    {
        "title": "Bridging the Discrete-Continuous Gap: Unified Multimodal Generation via Coupled Manifold Discrete Absorbing Diffusion",
        "abstract": "The bifurcation of generative modeling into autoregressive approaches for discrete data (text) and diffusion approaches for continuous data (images) hinders the development of truly unified multimodal systems. While Masked Language Models (MLMs) offer efficient bidirectional context, they traditionally lack the generative fidelity of autoregressive models and the semantic continuity of diffusion models. Furthermore, extending masked generation to multimodal settings introduces severe alignment challenges and training instability. In this work, we propose \\textbf{CoM-DAD} (\\textbf{Co}upled \\textbf{M}anifold \\textbf{D}iscrete \\textbf{A}bsorbing \\textbf{D}iffusion), a novel probabilistic framework that reformulates multimodal generation as a hierarchical dual-process. CoM-DAD decouples high-level semantic planning from low-level token synthesis. First, we model the semantic manifold via a continuous latent diffusion process; second, we treat token generation as a discrete absorbing diffusion process, regulated by a \\textbf{Variable-Rate Noise Schedule}, conditioned on these evolving semantic priors. Crucially, we introduce a \\textbf{Stochastic Mixed-Modal Transport} strategy that aligns disparate modalities without requiring heavy contrastive dual-encoders. Our method demonstrates superior stability over standard masked modeling, establishing a new paradigm for scalable, unified text-image generation.",
        "url": "http://arxiv.org/abs/2601.04056v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04056v1",
        "arxiv_id": "2601.04056v1",
        "authors": [
            "Yuanfeng Xu",
            "Yuhao Chen",
            "Liang Lin",
            "Guangrun Wang"
        ],
        "submitted": "2026-01-07 16:21:19",
        "source": "arxiv",
        "comment": "10 pages, 5 figures"
    },
    {
        "title": "Modular Prompt Optimization: Optimizing Structured Prompts with Section-Local Textual Gradients",
        "abstract": "Prompt quality plays a central role in controlling the behavior, reliability, and reasoning performance of large language models (LLMs), particularly for smaller open-source instruction-tuned models that depend heavily on explicit structure. While recent work has explored automatic prompt optimization using textual gradients and self-refinement, most existing methods treat prompts as monolithic blocks of text, making it difficult to localize errors, preserve critical instructions, or prevent uncontrolled prompt growth. We introduce Modular Prompt Optimization (MPO), a schema-based prompt optimization framework that treats prompts as structured objects composed of fixed semantic sections, including system role, context, task description, constraints, and output format. MPO applies section-local textual gradients, generated by a critic language model, to refine each section independently while keeping the overall prompt schema fixed. Section updates are consolidated through de-duplication to reduce redundancy and interference between components, yielding an interpretable and robust optimization process. We evaluate MPO on two reasoning benchmarks, ARC-Challenge and MMLU, using LLaMA-3 8B-Instruct and Mistral-7B-Instruct as solver models. Across both benchmarks and models, MPO consistently outperforms an untuned structured prompt and the TextGrad baseline, achieving substantial accuracy gains without modifying model parameters or altering prompt structure. These results demonstrate that maintaining a fixed prompt schema while applying localized, section-wise optimization is an effective and practical approach for improving reasoning performance in small open-source LMs.",
        "url": "http://arxiv.org/abs/2601.04055v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04055v1",
        "arxiv_id": "2601.04055v1",
        "authors": [
            "Prith Sharma",
            "Austin Z. Henley"
        ],
        "submitted": "2026-01-07 16:20:08",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Stable Language Guidance for Vision-Language-Action Models",
        "abstract": "Vision-Language-Action (VLA) models have demonstrated impressive capabilities in generalized robotic control; however, they remain notoriously brittle to linguistic perturbations. We identify a critical ``modality collapse'' phenomenon where strong visual priors overwhelm sparse linguistic signals, causing agents to overfit to specific instruction phrasings while ignoring the underlying semantic intent. To address this, we propose \\textbf{Residual Semantic Steering (RSS)}, a probabilistic framework that disentangles physical affordance from semantic execution. RSS introduces two theoretical innovations: (1) \\textbf{Monte Carlo Syntactic Integration}, which approximates the true semantic posterior via dense, LLM-driven distributional expansion, and (2) \\textbf{Residual Affordance Steering}, a dual-stream decoding mechanism that explicitly isolates the causal influence of language by subtracting the visual affordance prior. Theoretical analysis suggests that RSS effectively maximizes the mutual information between action and intent while suppressing visual distractors. Empirical results across diverse manipulation benchmarks demonstrate that RSS achieves state-of-the-art robustness, maintaining performance even under adversarial linguistic perturbations.",
        "url": "http://arxiv.org/abs/2601.04052v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04052v1",
        "arxiv_id": "2601.04052v1",
        "authors": [
            "Zhihao Zhan",
            "Yuhao Chen",
            "Jiaying Zhou",
            "Qinhan Lv",
            "Hao Liu",
            "Keze Wang",
            "Liang Lin",
            "Guangrun Wang"
        ],
        "submitted": "2026-01-07 16:16:10",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "When Helpers Become Hazards: A Benchmark for Analyzing Multimodal LLM-Powered Safety in Daily Life",
        "abstract": "As Multimodal Large Language Models (MLLMs) become an indispensable assistant in human life, the unsafe content generated by MLLMs poses a danger to human behavior, perpetually overhanging human society like a sword of Damocles. To investigate and evaluate the safety impact of MLLMs responses on human behavior in daily life, we introduce SaLAD, a multimodal safety benchmark which contains 2,013 real-world image-text samples across 10 common categories, with a balanced design covering both unsafe scenarios and cases of oversensitivity. It emphasizes realistic risk exposure, authentic visual inputs, and fine-grained cross-modal reasoning, ensuring that safety risks cannot be inferred from text alone. We further propose a safety-warning-based evaluation framework that encourages models to provide clear and informative safety warnings, rather than generic refusals. Results on 18 MLLMs demonstrate that the top-performing models achieve a safe response rate of only 57.2% on unsafe queries. Moreover, even popular safety alignment methods limit effectiveness of the models in our scenario, revealing the vulnerabilities of current MLLMs in identifying dangerous behaviors in daily life. Our dataset is available at https://github.com/xinyuelou/SaLAD.",
        "url": "http://arxiv.org/abs/2601.04043v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04043v1",
        "arxiv_id": "2601.04043v1",
        "authors": [
            "Xinyue Lou",
            "Jinan Xu",
            "Jingyi Yin",
            "Xiaolong Wang",
            "Zhaolu Kang",
            "Youwei Liao",
            "Yixuan Wang",
            "Xiangyu Shi",
            "Fengran Mo",
            "Su Yao",
            "Kaiyu Huang"
        ],
        "submitted": "2026-01-07 15:59:07",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Analyzing and Improving Cross-lingual Knowledge Transfer for Machine Translation",
        "abstract": "Multilingual machine translation systems aim to make knowledge accessible across languages, yet learning effective cross-lingual representations remains challenging. These challenges are especially pronounced for low-resource languages, where limited parallel data constrains generalization and transfer. Understanding how multilingual models share knowledge across languages requires examining the interaction between representations, data availability, and training strategies. In this thesis, we study cross-lingual knowledge transfer in neural models and develop methods to improve robustness and generalization in multilingual settings, using machine translation as a central testbed. We analyze how similarity between languages influences transfer, how retrieval and auxiliary supervision can strengthen low-resource translation, and how fine-tuning on parallel data can introduce unintended trade-offs in large language models. We further examine the role of language diversity during training and show that increasing translation coverage improves generalization and reduces off-target behavior. Together, this work highlights how modeling choices and data composition shape multilingual learning and offers insights toward more inclusive and resilient multilingual NLP systems.",
        "url": "http://arxiv.org/abs/2601.04036v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04036v1",
        "arxiv_id": "2601.04036v1",
        "authors": [
            "David Stap"
        ],
        "submitted": "2026-01-07 15:51:54",
        "source": "arxiv",
        "comment": "PhD dissertation defended on November 26th, 2025"
    },
    {
        "title": "SpeakerSleuth: Evaluating Large Audio-Language Models as Judges for Multi-turn Speaker Consistency",
        "abstract": "Large Audio-Language Models (LALMs) as judges have emerged as a prominent approach for evaluating speech generation quality, yet their ability to assess speaker consistency across multi-turn conversations remains unexplored. We present SpeakerSleuth, a benchmark evaluating whether LALMs can reliably judge speaker consistency in multi-turn dialogues through three tasks reflecting real-world requirements. We construct 1,818 human-verified evaluation instances across four diverse datasets spanning synthetic and real speech, with controlled acoustic difficulty. Evaluating nine widely-used LALMs, we find that models struggle to reliably detect acoustic inconsistencies. For instance, given audio samples of the same speaker's turns, some models overpredict inconsistency, whereas others are overly lenient. Models further struggle to identify the exact turns that are problematic. When other interlocutors' turns are provided together, performance degrades dramatically as models prioritize textual coherence over acoustic cues, failing to detect even obvious gender switches for a speaker. On the other hand, models perform substantially better in choosing the audio that best matches the speaker among several acoustic variants, demonstrating inherent acoustic discrimination capabilities. These findings expose a significant bias in LALMs: they tend to prioritize text over acoustics, revealing fundamental modality imbalances that need to be addressed to build reliable audio-language judges.",
        "url": "http://arxiv.org/abs/2601.04029v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04029v1",
        "arxiv_id": "2601.04029v1",
        "authors": [
            "Jonggeun Lee",
            "Junseong Pyo",
            "Gyuhyeon Seo",
            "Yohan Jo"
        ],
        "submitted": "2026-01-07 15:45:41",
        "source": "arxiv",
        "comment": "28 pages"
    },
    {
        "title": "Simulated Students in Tutoring Dialogues: Substance or Illusion?",
        "abstract": "Advances in large language models (LLMs) enable many new innovations in education. However, evaluating the effectiveness of new technology requires real students, which is time-consuming and hard to scale up. Therefore, many recent works on LLM-powered tutoring solutions have used simulated students for both training and evaluation, often via simple prompting. Surprisingly, little work has been done to ensure or even measure the quality of simulated students. In this work, we formally define the student simulation task, propose a set of evaluation metrics that span linguistic, behavioral, and cognitive aspects, and benchmark a wide range of student simulation methods on these metrics. We experiment on a real-world math tutoring dialogue dataset, where both automated and human evaluation results show that prompting strategies for student simulation perform poorly; supervised fine-tuning and preference optimization yield much better but still limited performance, motivating future work on this challenging task.",
        "url": "http://arxiv.org/abs/2601.04025v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04025v1",
        "arxiv_id": "2601.04025v1",
        "authors": [
            "Alexander Scarlatos",
            "Jaewook Lee",
            "Simon Woodhead",
            "Andrew Lan"
        ],
        "submitted": "2026-01-07 15:44:11",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Modeling Behavioral Patterns in News Recommendations Using Fuzzy Neural Networks",
        "abstract": "News recommender systems are increasingly driven by black-box models, offering little transparency for editorial decision-making. In this work, we introduce a transparent recommender system that uses fuzzy neural networks to learn human-readable rules from behavioral data for predicting article clicks. By extracting the rules at configurable thresholds, we can control rule complexity and thus, the level of interpretability. We evaluate our approach on two publicly available news datasets (i.e., MIND and EB-NeRD) and show that we can accurately predict click behavior compared to several established baselines, while learning human-readable rules. Furthermore, we show that the learned rules reveal news consumption patterns, enabling editors to align content curation goals with target audience behavior.",
        "url": "http://arxiv.org/abs/2601.04019v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04019v1",
        "arxiv_id": "2601.04019v1",
        "authors": [
            "Kevin Innerebner",
            "Stephan Bartl",
            "Markus Reiter-Haas",
            "Elisabeth Lex"
        ],
        "submitted": "2026-01-07 15:34:15",
        "source": "arxiv",
        "comment": "Accepted for the IR for Good track at ECIR'26"
    },
    {
        "title": "Correct and Weight: A Simple Yet Effective Loss for Implicit Feedback Recommendation",
        "abstract": "Learning from implicit feedback has become the standard paradigm for modern recommender systems. However, this setting is fraught with the persistent challenge of false negatives, where unobserved user-item interactions are not necessarily indicative of negative preference. To address this issue, this paper introduces a novel and principled loss function, named Corrected and Weighted (CW) loss, that systematically corrects for the impact of false negatives within the training objective. Our approach integrates two key techniques. First, inspired by Positive-Unlabeled learning, we debias the negative sampling process by re-calibrating the assumed negative distribution. By theoretically approximating the true negative distribution (p-) using the observable general data distribution (p) and the positive interaction distribution (p^+), our method provides a more accurate estimate of the likelihood that a sampled unlabeled item is truly negative. Second, we introduce a dynamic re-weighting mechanism that modulates the importance of each negative instance based on the model's current prediction. This scheme encourages the model to enforce a larger ranking margin between positive items and confidently predicted (i.e., easy) negative items, while simultaneously down-weighting the penalty on uncertain negatives that have a higher probability of being false negatives. A key advantage of our approach is its elegance and efficiency; it requires no complex modifications to the data sampling process or significant computational overhead, making it readily applicable to a wide array of existing recommendation models. Extensive experiments conducted on four large-scale, sparse benchmark datasets demonstrate the superiority of our proposed loss. The results show that our method consistently and significantly outperforms a suite of state-of-the-art loss functions across multiple ranking-oriented metrics.",
        "url": "http://arxiv.org/abs/2601.04291v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04291v1",
        "arxiv_id": "2601.04291v1",
        "authors": [
            "Minglei Yin",
            "Chuanbo Hu",
            "Bin Liu",
            "Neil Zhenqiang Gong",
            "Yanfang",
            "Ye",
            "Xin Li"
        ],
        "submitted": "2026-01-07 15:20:27",
        "source": "arxiv",
        "comment": "arXiv admin note: text overlap with arXiv:2508.05673 by other authors"
    },
    {
        "title": "VotIE: Information Extraction from Meeting Minutes",
        "abstract": "Municipal meeting minutes record key decisions in local democratic processes. Unlike parliamentary proceedings, which typically adhere to standardized formats, they encode voting outcomes in highly heterogeneous, free-form narrative text that varies widely across municipalities, posing significant challenges for automated extraction. In this paper, we introduce VotIE (Voting Information Extraction), a new information extraction task aimed at identifying structured voting events in narrative deliberative records, and establish the first benchmark for this task using Portuguese municipal minutes, building on the recently introduced CitiLink corpus. Our experiments yield two key findings. First, under standard in-domain evaluation, fine-tuned encoders, specifically XLM-R-CRF, achieve the strongest performance, reaching 93.2\\% macro F1, outperforming generative approaches. Second, in a cross-municipality setting that evaluates transfer to unseen administrative contexts, these models suffer substantial performance degradation, whereas few-shot LLMs demonstrate greater robustness, with significantly smaller declines in performance. Despite this generalization advantage, the high computational cost of generative models currently constrains their practicality. As a result, lightweight fine-tuned encoders remain a more practical option for large-scale, real-world deployment. To support reproducible research in administrative NLP, we publicly release our benchmark, trained models, and evaluation framework.",
        "url": "http://arxiv.org/abs/2601.03997v2",
        "pdf_url": "https://arxiv.org/pdf/2601.03997v2",
        "arxiv_id": "2601.03997v2",
        "authors": [
            "José Pedro Evans",
            "Luís Filipe Cunha",
            "Purificação Silvano",
            "Alípio Jorge",
            "Nuno Guimarães",
            "Sérgio Nunes",
            "Ricardo Campos"
        ],
        "submitted": "2026-01-07 15:06:53",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Benchmark^2: Systematic Evaluation of LLM Benchmarks",
        "abstract": "The rapid proliferation of benchmarks for evaluating large language models (LLMs) has created an urgent need for systematic methods to assess benchmark quality itself. We propose Benchmark^2, a comprehensive framework comprising three complementary metrics: (1) Cross-Benchmark Ranking Consistency, measuring whether a benchmark produces model rankings aligned with peer benchmarks; (2) Discriminability Score, quantifying a benchmark's ability to differentiate between models; and (3) Capability Alignment Deviation, identifying problematic instances where stronger models fail but weaker models succeed within the same model family. We conduct extensive experiments across 15 benchmarks spanning mathematics, reasoning, and knowledge domains, evaluating 11 LLMs across four model families. Our analysis reveals significant quality variations among existing benchmarks and demonstrates that selective benchmark construction based on our metrics can achieve comparable evaluation performance with substantially reduced test sets.",
        "url": "http://arxiv.org/abs/2601.03986v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03986v1",
        "arxiv_id": "2601.03986v1",
        "authors": [
            "Qi Qian",
            "Chengsong Huang",
            "Jingwen Xu",
            "Changze Lv",
            "Muling Wu",
            "Wenhao Liu",
            "Xiaohua Wang",
            "Zhenghua Wang",
            "Zisu Huang",
            "Muzhao Tian",
            "Jianhan Xu",
            "Kun Hu",
            "He-Da Wang",
            "Yao Hu",
            "Xuanjing Huang",
            "Xiaoqing Zheng"
        ],
        "submitted": "2026-01-07 14:59:03",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "RADAR: Retrieval-Augmented Detector with Adversarial Refinement for Robust Fake News Detection",
        "abstract": "To efficiently combat the spread of LLM-generated misinformation, we present RADAR, a retrieval-augmented detector with adversarial refinement for robust fake news detection. Our approach employs a generator that rewrites real articles with factual perturbations, paired with a lightweight detector that verifies claims using dense passage retrieval. To enable effective co-evolution, we introduce verbal adversarial feedback (VAF). Rather than relying on scalar rewards, VAF issues structured natural-language critiques; these guide the generator toward more sophisticated evasion attempts, compelling the detector to adapt and improve. On a fake news detection benchmark, RADAR achieves 86.98% ROC-AUC, significantly outperforming general-purpose LLMs with retrieval. Ablation studies confirm that detector-side retrieval yields the largest gains, while VAF and few-shot demonstrations provide critical signals for robust training.",
        "url": "http://arxiv.org/abs/2601.03981v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03981v1",
        "arxiv_id": "2601.03981v1",
        "authors": [
            "Song-Duo Ma",
            "Yi-Hung Liu",
            "Hsin-Yu Lin",
            "Pin-Yu Chen",
            "Hong-Yan Huang",
            "Shau-Yung Hsu",
            "Yun-Nung Chen"
        ],
        "submitted": "2026-01-07 14:52:15",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SoK: Privacy Risks and Mitigations in Retrieval-Augmented Generation Systems",
        "abstract": "The continued promise of Large Language Models (LLMs), particularly in their natural language understanding and generation capabilities, has driven a rapidly increasing interest in identifying and developing LLM use cases. In an effort to complement the ingrained \"knowledge\" of LLMs, Retrieval-Augmented Generation (RAG) techniques have become widely popular. At its core, RAG involves the coupling of LLMs with domain-specific knowledge bases, whereby the generation of a response to a user question is augmented with contextual and up-to-date information. The proliferation of RAG has sparked concerns about data privacy, particularly with the inherent risks that arise when leveraging databases with potentially sensitive information. Numerous recent works have explored various aspects of privacy risks in RAG systems, from adversarial attacks to proposed mitigations. With the goal of surveying and unifying these works, we ask one simple question: What are the privacy risks in RAG, and how can they be measured and mitigated? To answer this question, we conduct a systematic literature review of RAG works addressing privacy, and we systematize our findings into a comprehensive set of privacy risks, mitigation techniques, and evaluation strategies. We supplement these findings with two primary artifacts: a Taxonomy of RAG Privacy Risks and a RAG Privacy Process Diagram. Our work contributes to the study of privacy in RAG not only by conducting the first systematization of risks and mitigations, but also by uncovering important considerations when mitigating privacy risks in RAG systems and assessing the current maturity of proposed mitigations.",
        "url": "http://arxiv.org/abs/2601.03979v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03979v1",
        "arxiv_id": "2601.03979v1",
        "authors": [
            "Andreea-Elena Bodea",
            "Stephen Meisenbacher",
            "Alexandra Klymenko",
            "Florian Matthes"
        ],
        "submitted": "2026-01-07 14:50:41",
        "source": "arxiv",
        "comment": "17 pages, 3 figures, 5 tables. This work has been accepted for publication at the IEEE Conference on Secure and Trustworthy Machine Learning (SaTML 2026). The final version will be available on IEEE Xplore"
    },
    {
        "title": "Muse: Towards Reproducible Long-Form Song Generation with Fine-Grained Style Control",
        "abstract": "Recent commercial systems such as Suno demonstrate strong capabilities in long-form song generation, while academic research remains largely non-reproducible due to the lack of publicly available training data, hindering fair comparison and progress. To this end, we release a fully open-source system for long-form song generation with fine-grained style conditioning, including a licensed synthetic dataset, training and evaluation pipelines, and Muse, an easy-to-deploy song generation model. The dataset consists of 116k fully licensed synthetic songs with automatically generated lyrics and style descriptions paired with audio synthesized by SunoV5. We train Muse via single-stage supervised finetuning of a Qwen-based language model extended with discrete audio tokens using MuCodec, without task-specific losses, auxiliary objectives, or additional architectural components. Our evaluations find that although Muse is trained with a modest data scale and model size, it achieves competitive performance on phoneme error rate, text--music style similarity, and audio aesthetic quality, while enabling controllable segment-level generation across different musical structures. All data, model weights, and training and evaluation pipelines will be publicly released, paving the way for continued progress in controllable long-form song generation research. The project repository is available at https://github.com/yuhui1038/Muse.",
        "url": "http://arxiv.org/abs/2601.03973v2",
        "pdf_url": "https://arxiv.org/pdf/2601.03973v2",
        "arxiv_id": "2601.03973v2",
        "authors": [
            "Changhao Jiang",
            "Jiahao Chen",
            "Zhenghao Xiang",
            "Zhixiong Yang",
            "Hanchen Wang",
            "Jiabao Zhuang",
            "Xinmeng Che",
            "Jiajun Sun",
            "Hui Li",
            "Yifei Cao",
            "Shihan Dou",
            "Ming Zhang",
            "Junjie Ye",
            "Tao Ji",
            "Tao Gui",
            "Qi Zhang",
            "Xuanjing Huang"
        ],
        "submitted": "2026-01-07 14:40:48",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Anti-Length Shift: Dynamic Outlier Truncation for Training Efficient Reasoning Models",
        "abstract": "Large reasoning models enhanced by reinforcement learning with verifiable rewards have achieved significant performance gains by extending their chain-of-thought. However, this paradigm incurs substantial deployment costs as models often exhibit excessive verbosity on simple queries. Existing efficient reasoning methods relying on explicit length penalties often introduce optimization conflicts and leave the generative mechanisms driving overthinking largely unexamined. In this paper, we identify a phenomenon termed length shift where models increasingly generate unnecessary reasoning on trivial inputs during training. To address this, we introduce Dynamic Outlier Truncation (DOT), a training-time intervention that selectively suppresses redundant tokens. This method targets only the extreme tail of response lengths within fully correct rollout groups while preserving long-horizon reasoning capabilities for complex problems. To complement this intervention and ensure stable convergence, we further incorporate auxiliary KL regularization and predictive dynamic sampling. Experimental results across multiple model scales demonstrate that our approach significantly pushes the efficiency-performance Pareto frontier outward. Notably, on the AIME-24, our method reduces inference token usage by 78% while simultaneously increasing accuracy compared to the initial policy and surpassing state-of-the-art efficient reasoning methods.",
        "url": "http://arxiv.org/abs/2601.03969v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03969v1",
        "arxiv_id": "2601.03969v1",
        "authors": [
            "Wei Wu",
            "Liyi Chen",
            "Congxi Xiao",
            "Tianfu Wang",
            "Qimeng Wang",
            "Chengqiang Lu",
            "Yan Gao",
            "Yi Wu",
            "Yao Hu",
            "Hui Xiong"
        ],
        "submitted": "2026-01-07 14:31:07",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Large-Scale Aspect-Based Sentiment Analysis with Reasoning-Infused LLMs",
        "abstract": "We introduce Arctic-ABSA, a collection of powerful models for real-life aspect-based sentiment analysis (ABSA). Our models are tailored to commercial needs, trained on a large corpus of public data alongside carefully generated synthetic data, resulting in a dataset 20 times larger than SemEval14. We extend typical ABSA models by expanding the number of sentiment classes from the standard three (positive, negative, neutral) to five, adding mixed and unknown classes, while also jointly predicting overall text sentiment and supporting multiple languages. We experiment with reasoning injection by fine-tuning on Chain-of-Thought (CoT) examples and introduce a novel reasoning pretraining technique for encoder-only models that significantly improves downstream fine-tuning and generalization. Our 395M-parameter encoder and 8B-parameter decoder achieve up to 10 percentage points higher accuracy than GPT-4o and Claude 3.5 Sonnet, while setting new state-of-the-art results on the SemEval14 benchmark. A single multilingual model maintains 87-91% accuracy across six languages without degrading English performance. We release ABSA-mix, a large-scale benchmark aggregating 17 public ABSA datasets across 92 domains.",
        "url": "http://arxiv.org/abs/2601.03940v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03940v1",
        "arxiv_id": "2601.03940v1",
        "authors": [
            "Paweł Liskowski",
            "Krzysztof Jankowski"
        ],
        "submitted": "2026-01-07 13:58:29",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "FOREVER: Forgetting Curve-Inspired Memory Replay for Language Model Continual Learning",
        "abstract": "Continual learning (CL) for large language models (LLMs) aims to enable sequential knowledge acquisition without catastrophic forgetting. Memory replay methods are widely used for their practicality and effectiveness, but most rely on fixed, step-based heuristics that often misalign with the model's actual learning progress, since identical training steps can result in varying degrees of parameter change. Motivated by recent findings that LLM forgetting mirrors the Ebbinghaus human forgetting curve, we propose FOREVER (FORgEtting curVe-inspired mEmory Replay), a novel CL framework that aligns replay schedules with a model-centric notion of time. FOREVER defines model time using the magnitude of optimizer updates, allowing forgetting curve-inspired replay intervals to align with the model's internal evolution rather than raw training steps. Building on this approach, FOREVER incorporates a forgetting curve-based replay scheduler to determine when to replay and an intensity-aware regularization mechanism to adaptively control how to replay. Extensive experiments on three CL benchmarks and models ranging from 0.6B to 13B parameters demonstrate that FOREVER consistently mitigates catastrophic forgetting.",
        "url": "http://arxiv.org/abs/2601.03938v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03938v1",
        "arxiv_id": "2601.03938v1",
        "authors": [
            "Yujie Feng",
            "Hao Wang",
            "Jian Li",
            "Xu Chu",
            "Zhaolu Kang",
            "Yiran Liu",
            "Yasha Wang",
            "Philip S. Yu",
            "Xiao-Ming Wu"
        ],
        "submitted": "2026-01-07 13:55:14",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "FocusUI: Efficient UI Grounding via Position-Preserving Visual Token Selection",
        "abstract": "Vision-Language Models (VLMs) have shown remarkable performance in User Interface (UI) grounding tasks, driven by their ability to process increasingly high-resolution screenshots. However, screenshots are tokenized into thousands of visual tokens (e.g., about 4700 for 2K resolution), incurring significant computational overhead and diluting attention. In contrast, humans typically focus on regions of interest when interacting with UI. In this work, we pioneer the task of efficient UI grounding. Guided by practical analysis of the task's characteristics and challenges, we propose FocusUI, an efficient UI grounding framework that selects patches most relevant to the instruction while preserving positional continuity for precise grounding. FocusUI addresses two key challenges: (1) Eliminating redundant tokens in visual encoding. We construct patch-level supervision by fusing an instruction-conditioned score with a rule-based UI-graph score that down-weights large homogeneous regions to select distinct and instruction-relevant visual tokens. (2) Preserving positional continuity during visual token selection. We find that general visual token pruning methods suffer from severe accuracy degradation on UI grounding tasks due to broken positional information. We introduce a novel PosPad strategy, which compresses each contiguous sequence of dropped visual tokens into a single special marker placed at the sequence's last index to preserve positional continuity. Comprehensive experiments on four grounding benchmarks demonstrate that FocusUI surpasses GUI-specific baselines. On the ScreenSpot-Pro benchmark, FocusUI-7B achieves a performance improvement of 3.7% over GUI-Actor-7B. Even with only 30% visual token retention, FocusUI-7B drops by only 3.2% while achieving up to 1.44x faster inference and 17% lower peak GPU memory.",
        "url": "http://arxiv.org/abs/2601.03928v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03928v1",
        "arxiv_id": "2601.03928v1",
        "authors": [
            "Mingyu Ouyang",
            "Kevin Qinghong Lin",
            "Mike Zheng Shou",
            "Hwee Tou Ng"
        ],
        "submitted": "2026-01-07 13:48:12",
        "source": "arxiv",
        "comment": "14 pages, 13 figures"
    },
    {
        "title": "Doc-PP: Document Policy Preservation Benchmark for Large Vision-Language Models",
        "abstract": "The deployment of Large Vision-Language Models (LVLMs) for real-world document question answering is often constrained by dynamic, user-defined policies that dictate information disclosure based on context. While ensuring adherence to these explicit constraints is critical, existing safety research primarily focuses on implicit social norms or text-only settings, overlooking the complexities of multimodal documents. In this paper, we introduce Doc-PP (Document Policy Preservation Benchmark), a novel benchmark constructed from real-world reports requiring reasoning across heterogeneous visual and textual elements under strict non-disclosure policies. Our evaluation highlights a systemic Reasoning-Induced Safety Gap: models frequently leak sensitive information when answers must be inferred through complex synthesis or aggregated across modalities, effectively circumventing existing safety constraints. Furthermore, we identify that providing extracted text improves perception but inadvertently facilitates leakage. To address these vulnerabilities, we propose DVA (Decompose-Verify-Aggregation), a structural inference framework that decouples reasoning from policy verification. Experimental results demonstrate that DVA significantly outperforms standard prompting defenses, offering a robust baseline for policy-compliant document understanding",
        "url": "http://arxiv.org/abs/2601.03926v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03926v1",
        "arxiv_id": "2601.03926v1",
        "authors": [
            "Haeun Jang",
            "Hwan Chang",
            "Hwanhee Lee"
        ],
        "submitted": "2026-01-07 13:45:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Mitigating Position-Shift Failures in Text-Based Modular Arithmetic via Position Curriculum and Template Diversity",
        "abstract": "Building on insights from the grokking literature, we study character-level Transformers trained to compute modular addition from text, and focus on robustness under input-format variation rather than only in-distribution accuracy. We identify a previously under-emphasized failure mode: models that achieve high in-distribution accuracy can fail catastrophically when the same expression is shifted to different absolute character positions (\"position shift\") or presented under out-of-distribution natural-language templates. Using a disjoint-pair split over all ordered pairs for p=97, we show that a baseline model reaches strong in-distribution performance yet collapses under position shift and template OOD. We then introduce a simple training recipe that combines (i) explicit expression boundary markers, (ii) position curriculum that broadens the range of absolute positions seen during training, (iii) diverse template mixtures, and (iv) consistency training across multiple variants per example. Across three seeds, this intervention substantially improves robustness to position shift and template OOD while maintaining high in-distribution accuracy, whereas an ALiBi-style ablation fails to learn the task under our setup. Our results suggest that steering procedural generalization under noisy supervision benefits from explicitly training invariances that are otherwise absent from the data distribution, and we provide a reproducible evaluation protocol and artifacts.",
        "url": "http://arxiv.org/abs/2601.04283v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04283v1",
        "arxiv_id": "2601.04283v1",
        "authors": [
            "Nikolay Yudin"
        ],
        "submitted": "2026-01-07 13:29:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "When Models Decide and When They Bind: A Two-Stage Computation for Multiple-Choice Question-Answering",
        "abstract": "Multiple-choice question answering (MCQA) is easy to evaluate but adds a meta-task: models must both solve the problem and output the symbol that *represents* the answer, conflating reasoning errors with symbol-binding failures. We study how language models implement MCQA internally using representational analyses (PCA, linear probes) as well as causal interventions. We find that option-boundary (newline) residual states often contain strong linearly decodable signals related to per-option correctness. Winner-identity probing reveals a two-stage progression: the winning *content position* becomes decodable immediately after the final option is processed, while the *output symbol* is represented closer to the answer emission position. Tests under symbol and content permutations support a two-stage mechanism in which models first select a winner in content space and then bind or route that winner to the appropriate symbol to emit.",
        "url": "http://arxiv.org/abs/2601.03914v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03914v1",
        "arxiv_id": "2601.03914v1",
        "authors": [
            "Hugh Mee Wong",
            "Rick Nouwen",
            "Albert Gatt"
        ],
        "submitted": "2026-01-07 13:27:48",
        "source": "arxiv",
        "comment": "Under review"
    },
    {
        "title": "Decide Then Retrieve: A Training-Free Framework with Uncertainty-Guided Triggering and Dual-Path Retrieval",
        "abstract": "Retrieval-augmented generation (RAG) enhances large language models (LLMs) by incorporating external knowledge, but existing approaches indiscriminately trigger retrieval and rely on single-path evidence construction, often introducing noise and limiting performance gains. In this work, we propose Decide Then Retrieve (DTR), a training-free framework that adaptively determines when retrieval is necessary and how external information should be selected. DTR leverages generation uncertainty to guide retrieval triggering and introduces a dual-path retrieval mechanism with adaptive information selection to better handle sparse and ambiguous queries. Extensive experiments across five open-domain QA benchmarks, multiple model scales, and different retrievers demonstrate that DTR consistently improves EM and F1 over standard RAG and strong retrieval-enhanced baselines, while reducing unnecessary retrievals. The code and data used in this paper are available at https://github.com/ChenWangHKU/DTR.",
        "url": "http://arxiv.org/abs/2601.03908v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03908v1",
        "arxiv_id": "2601.03908v1",
        "authors": [
            "Wang Chen",
            "Guanqiang Qi",
            "Weikang Li",
            "Yang Li",
            "Deguo Xia",
            "Jizhou Huang"
        ],
        "submitted": "2026-01-07 13:20:59",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Current Agents Fail to Leverage World Model as Tool for Foresight",
        "abstract": "Agents built on vision-language models increasingly face tasks that demand anticipating future states rather than relying on short-horizon reasoning. Generative world models offer a promising remedy: agents could use them as external simulators to foresee outcomes before acting. This paper empirically examines whether current agents can leverage such world models as tools to enhance their cognition. Across diverse agentic and visual question answering tasks, we observe that some agents rarely invoke simulation (fewer than 1%), frequently misuse predicted rollouts (approximately 15%), and often exhibit inconsistent or even degraded performance (up to 5%) when simulation is available or enforced. Attribution analysis further indicates that the primary bottleneck lies in the agents' capacity to decide when to simulate, how to interpret predicted outcomes, and how to integrate foresight into downstream reasoning. These findings underscore the need for mechanisms that foster calibrated, strategic interaction with world models, paving the way toward more reliable anticipatory cognition in future agent systems.",
        "url": "http://arxiv.org/abs/2601.03905v2",
        "pdf_url": "https://arxiv.org/pdf/2601.03905v2",
        "arxiv_id": "2601.03905v2",
        "authors": [
            "Cheng Qian",
            "Emre Can Acikgoz",
            "Bingxuan Li",
            "Xiusi Chen",
            "Yuji Zhang",
            "Bingxiang He",
            "Qinyu Luo",
            "Dilek Hakkani-Tür",
            "Gokhan Tur",
            "Yunzhu Li",
            "Heng Ji"
        ],
        "submitted": "2026-01-07 13:15:23",
        "source": "arxiv",
        "comment": "36 Pages, 13 Figures, 17 Tables (Meta data updated)"
    },
    {
        "title": "Unleashing the Potential of Neighbors: Diffusion-based Latent Neighbor Generation for Session-based Recommendation",
        "abstract": "Session-based recommendation aims to predict the next item that anonymous users may be interested in, based on their current session interactions. Recent studies have demonstrated that retrieving neighbor sessions to augment the current session can effectively alleviate the data sparsity issue and improve recommendation performance. However, existing methods typically rely on explicitly observed session data, neglecting latent neighbors - not directly observed but potentially relevant within the interest space - thereby failing to fully exploit the potential of neighbor sessions in recommendation. To address the above limitation, we propose a novel model of diffusion-based latent neighbor generation for session-based recommendation, named DiffSBR. Specifically, DiffSBR leverages two diffusion modules, including retrieval-augmented diffusion and self-augmented diffusion, to generate high-quality latent neighbors. In the retrieval-augmented diffusion module, we leverage retrieved neighbors as guiding signals to constrain and reconstruct the distribution of latent neighbors. Meanwhile, we adopt a training strategy that enables the retriever to learn from the feedback provided by the generator. In the self-augmented diffusion module, we explicitly guide the generation of latent neighbors by injecting the current session's multi-modal signals through contrastive learning. After obtaining the generated latent neighbors, we utilize them to enhance session representations for improving session-based recommendation. Extensive experiments on four public datasets show that DiffSBR generates effective latent neighbors and improves recommendation performance against state-of-the-art baselines.",
        "url": "http://arxiv.org/abs/2601.03903v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03903v1",
        "arxiv_id": "2601.03903v1",
        "authors": [
            "Yuhan Yang",
            "Jie Zou",
            "Guojia An",
            "Jiwei Wei",
            "Yang Yang",
            "Heng Tao Shen"
        ],
        "submitted": "2026-01-07 13:14:12",
        "source": "arxiv",
        "comment": "This paper has been accepted by KDD 2026"
    },
    {
        "title": "Adaptive-Boundary-Clipping GRPO: Ensuring Bounded Ratios for Stable and Generalizable Training",
        "abstract": "Group Relative Policy Optimization (GRPO) has emerged as a popular algorithm for reinforcement learning with large language models (LLMs). However, upon analyzing its clipping mechanism, we argue that it is suboptimal in certain scenarios. With appropriate modifications, GRPO can be significantly enhanced to improve both flexibility and generalization. To this end, we propose Adaptive-Boundary-Clipping GRPO (ABC-GRPO), an asymmetric and adaptive refinement of the original GRPO framework. We demonstrate that ABC-GRPO achieves superior performance over standard GRPO on mathematical reasoning tasks using the Qwen3 LLMs. Moreover, ABC-GRPO maintains substantially higher entropy throughout training, thereby preserving the model's exploration capacity and mitigating premature convergence. The implementation code is available online to ease reproducibility https://github.com/chi2liu/ABC-GRPO.",
        "url": "http://arxiv.org/abs/2601.03895v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03895v1",
        "arxiv_id": "2601.03895v1",
        "authors": [
            "Chi Liu",
            "Xin Chen"
        ],
        "submitted": "2026-01-07 13:04:52",
        "source": "arxiv",
        "comment": "10 pages, 4 figures"
    },
    {
        "title": "From Domains to Instances: Dual-Granularity Data Synthesis for LLM Unlearning",
        "abstract": "Although machine unlearning is essential for removing private, harmful, or copyrighted content from LLMs, current benchmarks often fail to faithfully represent the true \"forgetting scope\" learned by the model. We formalize two distinct unlearning granularities, domain-level and instance-level, and propose BiForget, an automated framework for synthesizing high-quality forget sets. Unlike prior work relying on external generators, BiForget exploits the target model per se to elicit data that matches its internal knowledge distribution through seed-guided and adversarial prompting. Our experiments across diverse benchmarks show that it achieves a superior balance of relevance, diversity, and efficiency. Quantitatively, in the Harry Potter domain, it improves relevance by ${\\sim}20$ and diversity by ${\\sim}$0.05 while halving the total data size compared to SOTAs. Ultimately, it facilitates more robust forgetting and better utility preservation, providing a more rigorous foundation for evaluating LLM unlearning.",
        "url": "http://arxiv.org/abs/2601.04278v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04278v1",
        "arxiv_id": "2601.04278v1",
        "authors": [
            "Xiaoyu Xu",
            "Minxin Du",
            "Zitong Li",
            "Zi Liang",
            "Zhibiao Guo",
            "Shiyu Zhang",
            "Peizhao Hu",
            "Qingqing Ye",
            "Haibo Hu"
        ],
        "submitted": "2026-01-07 12:41:07",
        "source": "arxiv",
        "comment": "16 pages"
    },
    {
        "title": "Evaluating Small Decoder-Only Language Models for Grammar Correction and Text Simplification",
        "abstract": "Large language models have become extremely popular recently due to their ability to achieve strong performance on a variety of tasks, such as text generation and rewriting, but their size and computation cost make them difficult to access, deploy, and secure in many settings. This paper investigates whether small, decoder-only language models can provide an efficient alternative for the tasks of grammar correction and text simplification. The experiments in this paper focus on testing small language models out of the box, fine-tuned, and run sequentially on the JFLEG and ASSET datasets using established metrics. The results show that while SLMs may learn certain behaviors well, their performance remains below strong baselines and current LLMs. The results also show that SLMs struggle with retaining meaning and hallucinations. These findings suggest that despite their efficiency advantages, current SLMs are not yet competitive enough with modern LLMs for rewriting, and further advances in training are required for SLMs to close the performance gap between them and today's LLMs.",
        "url": "http://arxiv.org/abs/2601.03874v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03874v1",
        "arxiv_id": "2601.03874v1",
        "authors": [
            "Anthony Lamelas"
        ],
        "submitted": "2026-01-07 12:39:31",
        "source": "arxiv",
        "comment": "9 pages, 12 figures"
    },
    {
        "title": "Atlas: Orchestrating Heterogeneous Models and Tools for Multi-Domain Complex Reasoning",
        "abstract": "The integration of large language models (LLMs) with external tools has significantly expanded the capabilities of AI agents. However, as the diversity of both LLMs and tools increases, selecting the optimal model-tool combination becomes a high-dimensional optimization challenge. Existing approaches often rely on a single model or fixed tool-calling logic, failing to exploit the performance variations across heterogeneous model-tool pairs. In this paper, we present ATLAS (Adaptive Tool-LLM Alignment and Synergistic Invocation), a dual-path framework for dynamic tool usage in cross-domain complex reasoning. ATLAS operates via a dual-path approach: (1) \\textbf{training-free cluster-based routing} that exploits empirical priors for domain-specific alignment, and (2) \\textbf{RL-based multi-step routing} that explores autonomous trajectories for out-of-distribution generalization. Extensive experiments across 15 benchmarks demonstrate that our method outperforms closed-source models like GPT-4o, surpassing existing routing methods on both in-distribution (+10.1%) and out-of-distribution (+13.1%) tasks. Furthermore, our framework shows significant gains in visual reasoning by orchestrating specialized multi-modal tools.",
        "url": "http://arxiv.org/abs/2601.03872v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03872v1",
        "arxiv_id": "2601.03872v1",
        "authors": [
            "Jinyang Wu",
            "Guocheng Zhai",
            "Ruihan Jin",
            "Jiahao Yuan",
            "Yuhao Shen",
            "Shuai Zhang",
            "Zhengqi Wen",
            "Jianhua Tao"
        ],
        "submitted": "2026-01-07 12:38:33",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "What Matters For Safety Alignment?",
        "abstract": "This paper presents a comprehensive empirical study on the safety alignment capabilities. We evaluate what matters for safety alignment in LLMs and LRMs to provide essential insights for developing more secure and reliable AI systems. We systematically investigate and compare the influence of six critical intrinsic model characteristics and three external attack techniques. Our large-scale evaluation is conducted using 32 recent, popular LLMs and LRMs across thirteen distinct model families, spanning a parameter scale from 3B to 235B. The assessment leverages five established safety datasets and probes model vulnerabilities with 56 jailbreak techniques and four CoT attack strategies, resulting in 4.6M API calls. Our key empirical findings are fourfold. First, we identify the LRMs GPT-OSS-20B, Qwen3-Next-80B-A3B-Thinking, and GPT-OSS-120B as the top-three safest models, which substantiates the significant advantage of integrated reasoning and self-reflection mechanisms for robust safety alignment. Second, post-training and knowledge distillation may lead to a systematic degradation of safety alignment. We thus argue that safety must be treated as an explicit constraint or a core optimization objective during these stages, not merely subordinated to the pursuit of general capability. Third, we reveal a pronounced vulnerability: employing a CoT attack via a response prefix can elevate the attack success rate by 3.34x on average and from 0.6% to 96.3% for Seed-OSS-36B-Instruct. This critical finding underscores the safety risks inherent in text-completion interfaces and features that allow user-defined response prefixes in LLM services, highlighting an urgent need for architectural and deployment safeguards. Fourth, roleplay, prompt injection, and gradient-based search for adversarial prompts are the predominant methodologies for eliciting unaligned behaviors in modern models.",
        "url": "http://arxiv.org/abs/2601.03868v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03868v1",
        "arxiv_id": "2601.03868v1",
        "authors": [
            "Xing Li",
            "Hui-Ling Zhen",
            "Lihao Yin",
            "Xianzhi Yu",
            "Zhenhua Dong",
            "Mingxuan Yuan"
        ],
        "submitted": "2026-01-07 12:31:52",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "PartisanLens: A Multilingual Dataset of Hyperpartisan and Conspiratorial Immigration Narratives in European Media",
        "abstract": "Detecting hyperpartisan narratives and Population Replacement Conspiracy Theories (PRCT) is essential to addressing the spread of misinformation. These complex narratives pose a significant threat, as hyperpartisanship drives political polarisation and institutional distrust, while PRCTs directly motivate real-world extremist violence, making their identification critical for social cohesion and public safety. However, existing resources are scarce, predominantly English-centric, and often analyse hyperpartisanship, stance, and rhetorical bias in isolation rather than as interrelated aspects of political discourse. To bridge this gap, we introduce \\textsc{PartisanLens}, the first multilingual dataset of  um{1617} hyperpartisan news headlines in Spanish, Italian, and Portuguese, annotated in multiple political discourse aspects. We first evaluate the classification performance of widely used Large Language Models (LLMs) on this dataset, establishing robust baselines for the classification of hyperpartisan and PRCT narratives. In addition, we assess the viability of using LLMs as automatic annotators for this task, analysing their ability to approximate human annotation. Results highlight both their potential and current limitations. Next, moving beyond standard judgments, we explore whether LLMs can emulate human annotation patterns by conditioning them on socio-economic and ideological profiles that simulate annotator perspectives. At last, we provide our resources and evaluation, \\textsc{PartisanLens} supports future research on detecting partisan and conspiratorial narratives in European contexts.",
        "url": "http://arxiv.org/abs/2601.03860v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03860v1",
        "arxiv_id": "2601.03860v1",
        "authors": [
            "Michele Joshua Maggini",
            "Paloma Piot",
            "Anxo Pérez",
            "Erik Bran Marino",
            "Lúa Santamaría Montesinos",
            "Ana Lisboa",
            "Marta Vázquez Abuín",
            "Javier Parapar",
            "Pablo Gamallo"
        ],
        "submitted": "2026-01-07 12:18:14",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "What Does Loss Optimization Actually Teach, If Anything? Knowledge Dynamics in Continual Pre-training of LLMs",
        "abstract": "Continual Pre-Training (CPT) is widely used for acquiring and updating factual knowledge in LLMs. This practice treats loss as a proxy for knowledge learning, while offering no grounding into how it changes during training. We study CPT as a knowledge learning process rather than a solely optimization problem. We construct a controlled, distribution-matched benchmark of factual documents and interleave diagnostic probes directly into the CPT loop, enabling epoch-level measurement of knowledge acquisition dynamics and changes in Out-Of-Domain (OOD) general skills (e.g., math). We further analyze how CPT reshapes knowledge circuits during training. Across three instruction-tuned LLMs and multiple CPT strategies, optimization and learning systematically diverge as loss decreases monotonically while factual learning is unstable and non-monotonic. Acquired facts are rarely consolidated, learning is strongly conditioned on prior exposure, and OOD performance degrades from early epochs. Circuit analysis reveals rapid reconfiguration of knowledge pathways across epochs, providing an explanation for narrow acquisition windows and systematic forgetting. These results show that loss optimization is misaligned with learning progress in CPT and motivate evaluation of stopping criteria based on task-level learning dynamics.",
        "url": "http://arxiv.org/abs/2601.03858v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03858v1",
        "arxiv_id": "2601.03858v1",
        "authors": [
            "Seyed Mahed Mousavi",
            "Simone Alghisi",
            "Giuseppe Riccardi"
        ],
        "submitted": "2026-01-07 12:14:33",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Shadow Unlearning: A Neuro-Semantic Approach to Fidelity-Preserving Faceless Forgetting in LLMs",
        "abstract": "Machine unlearning aims to selectively remove the influence of specific training samples to satisfy privacy regulations such as the GDPR's 'Right to be Forgotten'. However, many existing methods require access to the data being removed, exposing it to membership inference attacks and potential misuse of Personally Identifiable Information (PII). We address this critical challenge by proposing Shadow Unlearning, a novel paradigm of approximate unlearning, that performs machine unlearning on anonymized forget data without exposing PII. We further propose a novel privacy-preserving framework, Neuro-Semantic Projector Unlearning (NSPU) to achieve Shadow unlearning. To evaluate our method, we compile Multi-domain Fictitious Unlearning (MuFU) forget set across five diverse domains and introduce an evaluation stack to quantify the trade-off between knowledge retention and unlearning effectiveness. Experimental results on various LLMs show that NSPU achieves superior unlearning performance, preserves model utility, and enhances user privacy. Additionally, the proposed approach is at least 10 times more computationally efficient than standard unlearning approaches. Our findings foster a new direction for privacy-aware machine unlearning that balances data protection and model fidelity.",
        "url": "http://arxiv.org/abs/2601.04275v1",
        "pdf_url": "https://arxiv.org/pdf/2601.04275v1",
        "arxiv_id": "2601.04275v1",
        "authors": [
            "Dinesh Srivasthav P",
            "Ashok Urlana",
            "Rahul Mishra",
            "Bala Mallikarjunarao Garlapati",
            "Ponnurangam Kumaraguru"
        ],
        "submitted": "2026-01-07 12:11:25",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Rethinking Table Pruning in TableQA: From Sequential Revisions to Gold Trajectory-Supervised Parallel Search",
        "abstract": "Table Question Answering (TableQA) benefits significantly from table pruning, which extracts compact sub-tables by eliminating redundant cells to streamline downstream reasoning. However, existing pruning methods typically rely on sequential revisions driven by unreliable critique signals, often failing to detect the loss of answer-critical data. To address this limitation, we propose TabTrim, a novel table pruning framework which transforms table pruning from sequential revisions to gold trajectory-supervised parallel search. TabTrim derives a gold pruning trajectory using the intermediate sub-tables in the execution process of gold SQL queries, and trains a pruner and a verifier to make the step-wise pruning result align with the gold pruning trajectory. During inference, TabTrim performs parallel search to explore multiple candidate pruning trajectories and identify the optimal sub-table. Extensive experiments demonstrate that TabTrim achieves state-of-the-art performance across diverse tabular reasoning tasks: TabTrim-8B reaches 73.5% average accuracy, outperforming the strongest baseline by 3.2%, including 79.4% on WikiTQ and 61.2% on TableBench.",
        "url": "http://arxiv.org/abs/2601.03851v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03851v1",
        "arxiv_id": "2601.03851v1",
        "authors": [
            "Yu Guo",
            "Shenghao Ye",
            "Shuangwu Chen",
            "Zijian Wen",
            "Tao Zhang",
            "Qirui Bai",
            "Dong Jin",
            "Yunpeng Hou",
            "Huasen He",
            "Jian Yang",
            "Xiaobin Tan"
        ],
        "submitted": "2026-01-07 12:08:59",
        "source": "arxiv",
        "comment": "16 pages, 5 figures"
    },
    {
        "title": "Step Potential Advantage Estimation: Harnessing Intermediate Confidence and Correctness for Efficient Mathematical Reasoning",
        "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) elicits long chain-of-thought reasoning in large language models (LLMs), but outcome-based rewards lead to coarse-grained advantage estimation. While existing approaches improve RLVR via token-level entropy or sequence-level length control, they lack a semantically grounded, step-level measure of reasoning progress. As a result, LLMs fail to distinguish necessary deduction from redundant verification: they may continue checking after reaching a correct solution and, in extreme cases, overturn a correct trajectory into an incorrect final answer. To remedy the lack of process supervision, we introduce a training-free probing mechanism that extracts intermediate confidence and correctness and combines them into a Step Potential signal that explicitly estimates the reasoning state at each step. Building on this signal, we propose Step Potential Advantage Estimation (SPAE), a fine-grained credit assignment method that amplifies potential gains, penalizes potential drops, and applies penalty after potential saturates to encourage timely termination. Experiments across multiple benchmarks show SPAE consistently improves accuracy while substantially reducing response length, outperforming strong RL baselines and recent efficient reasoning and token-level advantage estimation methods. The code is available at https://github.com/cii030/SPAE-RL.",
        "url": "http://arxiv.org/abs/2601.03823v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03823v1",
        "arxiv_id": "2601.03823v1",
        "authors": [
            "Fei Wu",
            "Zhenrong Zhang",
            "Qikai Chang",
            "Jianshu Zhang",
            "Quan Liu",
            "Jun Du"
        ],
        "submitted": "2026-01-07 11:36:01",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "AI Generated Text Detection",
        "abstract": "The rapid development of large language models has led to an increase in AI-generated text, with students increasingly using LLM-generated content as their own work, which violates academic integrity. This paper presents an evaluation of AI text detection methods, including both traditional machine learning models and transformer-based architectures. We utilize two datasets, HC3 and DAIGT v2, to build a unified benchmark and apply a topic-based data split to prevent information leakage. This approach ensures robust generalization across unseen domains. Our experiments show that TF-IDF logistic regression achieves a reasonable baseline accuracy of 82.87%. However, deep learning models outperform it. The BiLSTM classifier achieves an accuracy of 88.86%, while DistilBERT achieves a similar accuracy of 88.11% with the highest ROC-AUC score of 0.96, demonstrating the strongest overall performance. The results indicate that contextual semantic modeling is significantly superior to lexical features and highlight the importance of mitigating topic memorization through appropriate evaluation protocols. The limitations of this work are primarily related to dataset diversity and computational constraints. In future work, we plan to expand dataset diversity and utilize parameter-efficient fine-tuning methods such as LoRA. We also plan to explore smaller or distilled models and employ more efficient batching strategies and hardware-aware optimization.",
        "url": "http://arxiv.org/abs/2601.03812v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03812v1",
        "arxiv_id": "2601.03812v1",
        "authors": [
            "Adilkhan Alikhanov",
            "Aidar Amangeldi",
            "Diar Demeubay",
            "Dilnaz Akhmetzhan",
            "Nurbek Moldakhmetov",
            "Omar Polat",
            "Galymzhan Zharas"
        ],
        "submitted": "2026-01-07 11:18:10",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Where meaning lives: Layer-wise accessibility of psycholinguistic features in encoder and decoder language models",
        "abstract": "Understanding where transformer language models encode psychologically meaningful aspects of meaning is essential for both theory and practice. We conduct a systematic layer-wise probing study of 58 psycholinguistic features across 10 transformer models, spanning encoder-only and decoder-only architectures, and compare three embedding extraction methods. We find that apparent localization of meaning is strongly method-dependent: contextualized embeddings yield higher feature-specific selectivity and different layer-wise profiles than isolated embeddings. Across models and methods, final-layer representations are rarely optimal for recovering psycholinguistic information with linear probes. Despite these differences, models exhibit a shared depth ordering of meaning dimensions, with lexical properties peaking earlier and experiential and affective dimensions peaking later. Together, these results show that where meaning \"lives\" in transformer models reflects an interaction between methodological choices and architectural constraints.",
        "url": "http://arxiv.org/abs/2601.03798v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03798v1",
        "arxiv_id": "2601.03798v1",
        "authors": [
            "Taisiia Tikhomirova",
            "Dirk U. Wulff"
        ],
        "submitted": "2026-01-07 10:55:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Prompt Tuning without Labeled Samples for Zero-Shot Node Classification in Text-Attributed Graphs",
        "abstract": "Node classification is a fundamental problem in information retrieval with many real-world applications, such as community detection in social networks, grouping articles published online and product categorization in e-commerce. Zero-shot node classification in text-attributed graphs (TAGs) presents a significant challenge, particularly due to the absence of labeled data. In this paper, we propose a novel Zero-shot Prompt Tuning (ZPT) framework to address this problem by leveraging a Universal Bimodal Conditional Generator (UBCG). Our approach begins with pre-training a graph-language model to capture both the graph structure and the associated textual descriptions of each node. Following this, a conditional generative model is trained to learn the joint distribution of nodes in both graph and text modalities, enabling the generation of synthetic samples for each class based solely on the class name. These synthetic node and text embeddings are subsequently used to perform continuous prompt tuning, facilitating effective node classification in a zero-shot setting. Furthermore, we conduct extensive experiments on multiple benchmark datasets, demonstrating that our framework performs better than existing state-of-the-art baselines. We also provide ablation studies to validate the contribution of the bimodal generator. The code is provided at: https://github.com/Sethup123/ZPT.",
        "url": "http://arxiv.org/abs/2601.03793v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03793v1",
        "arxiv_id": "2601.03793v1",
        "authors": [
            "Sethupathy Parameswaran",
            "Suresh Sundaram",
            "Yuan Fang"
        ],
        "submitted": "2026-01-07 10:50:18",
        "source": "arxiv",
        "comment": "Accepted by WSDM 2026"
    },
    {
        "title": "VietMed-MCQ: A Consistency-Filtered Data Synthesis Framework for Vietnamese Traditional Medicine Evaluation",
        "abstract": "Large Language Models (LLMs) have demonstrated remarkable proficiency in general medical domains. However, their performance significantly degrades in specialized, culturally specific domains such as Vietnamese Traditional Medicine (VTM), primarily due to the scarcity of high-quality, structured benchmarks. In this paper, we introduce VietMed-MCQ, a novel multiple-choice question dataset generated via a Retrieval-Augmented Generation (RAG) pipeline with an automated consistency check mechanism. Unlike previous synthetic datasets, our framework incorporates a dual-model validation approach to ensure reasoning consistency through independent answer verification, though the substring-based evidence checking has known limitations. The complete dataset of 3,190 questions spans three difficulty levels and underwent validation by one medical expert and four students, achieving 94.2 percent approval with substantial inter-rater agreement (Fleiss' kappa = 0.82). We benchmark seven open-source models on VietMed-MCQ. Results reveal that general-purpose models with strong Chinese priors outperform Vietnamese-centric models, highlighting cross-lingual conceptual transfer, while all models still struggle with complex diagnostic reasoning. Our code and dataset are publicly available to foster research in low-resource medical domains.",
        "url": "http://arxiv.org/abs/2601.03792v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03792v1",
        "arxiv_id": "2601.03792v1",
        "authors": [
            "Huynh Trung Kiet",
            "Dao Sy Duy Minh",
            "Nguyen Dinh Ha Duong",
            "Le Hoang Minh Huy",
            "Long Nguyen",
            "Dien Dinh"
        ],
        "submitted": "2026-01-07 10:49:56",
        "source": "arxiv",
        "comment": "11 pages, 4 figures. Dataset and code released"
    },
    {
        "title": "Do LLMs Really Memorize Personally Identifiable Information? Revisiting PII Leakage with a Cue-Controlled Memorization Framework",
        "abstract": "Large Language Models (LLMs) have been reported to \"leak\" Personally Identifiable Information (PII), with successful PII reconstruction often interpreted as evidence of memorization. We propose a principled revision of memorization evaluation for LLMs, arguing that PII leakage should be evaluated under low lexical cue conditions, where target PII cannot be reconstructed through prompt-induced generalization or pattern completion. We formalize Cue-Resistant Memorization (CRM) as a cue-controlled evaluation framework and a necessary condition for valid memorization evaluation, explicitly conditioning on prompt-target overlap cues. Using CRM, we conduct a large-scale multilingual re-evaluation of PII leakage across 32 languages and multiple memorization paradigms. Revisiting reconstruction-based settings, including verbatim prefix-suffix completion and associative reconstruction, we find that their apparent effectiveness is driven primarily by direct surface-form cues rather than by true memorization. When such cues are controlled for, reconstruction success diminishes substantially. We further examine cue-free generation and membership inference, both of which exhibit extremely low true positive rates. Overall, our results suggest that previously reported PII leakage is better explained by cue-driven behavior than by genuine memorization, highlighting the importance of cue-controlled evaluation for reliably quantifying privacy-relevant memorization in LLMs.",
        "url": "http://arxiv.org/abs/2601.03791v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03791v1",
        "arxiv_id": "2601.03791v1",
        "authors": [
            "Xiaoyu Luo",
            "Yiyi Chen",
            "Qiongxiu Li",
            "Johannes Bjerva"
        ],
        "submitted": "2026-01-07 10:49:36",
        "source": "arxiv",
        "comment": "20 pages, 13 figures"
    },
    {
        "title": "NeoAMT: Neologism-Aware Agentic Machine Translation with Reinforcement Learning",
        "abstract": "Neologism-aware machine translation aims to translate source sentences containing neologisms into target languages. This field remains underexplored compared with general machine translation (MT). In this paper, we propose an agentic framework, NeoAMT, for neologism-aware machine translation using a Wiktionary search tool. Specifically, we first create a new dataset for neologism-aware machine translation and develop a search tool based on Wiktionary. The new dataset covers 16 languages and 75 translation directions and is derived from approximately 10 million records of an English Wiktionary dump. The retrieval corpus of the search tool is also constructed from around 3 million cleaned records of the Wiktionary dump. We then use it for training the translation agent with reinforcement learning (RL) and evaluating the accuracy of neologism-aware machine translation. Based on this, we also propose an RL training framework that contains a novel reward design and an adaptive rollout generation approach by leveraging \"translation difficulty\" to further improve the translation quality of translation agents using our search tool.",
        "url": "http://arxiv.org/abs/2601.03790v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03790v1",
        "arxiv_id": "2601.03790v1",
        "authors": [
            "Zhongtao Miao",
            "Kaiyan Zhao",
            "Masaaki Nagata",
            "Yoshimasa Tsuruoka"
        ],
        "submitted": "2026-01-07 10:49:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Compact Example-Based Explanations for Language Models",
        "abstract": "Training data influence estimation methods quantify the contribution of training documents to a model's output, making them a promising source of information for example-based explanations. As humans cannot interpret thousands of documents, only a small subset of the training data can be presented as an explanation. Although the choice of which documents to include directly affects explanation quality, previous evaluations of such systems have largely ignored any selection strategies. To address this, we propose a novel selection relevance score, a retraining-free metric that quantifies how useful a set of examples is for explaining a model's output. We validate this score through fine-tuning experiments, confirming that it can predict whether a set of examples supports or undermines the model's predictions. Using this metric, we further show that common selection strategies often underperform random selection. Motivated by this finding, we propose a strategy that balances influence and representativeness, enabling better use of selection budgets than naively selecting the highest-ranking examples.",
        "url": "http://arxiv.org/abs/2601.03786v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03786v1",
        "arxiv_id": "2601.03786v1",
        "authors": [
            "Loris Schoenegger",
            "Benjamin Roth"
        ],
        "submitted": "2026-01-07 10:36:46",
        "source": "arxiv",
        "comment": "8 pages"
    },
    {
        "title": "Membox: Weaving Topic Continuity into Long-Range Memory for LLM Agents",
        "abstract": "Human-agent dialogues often exhibit topic continuity-a stable thematic frame that evolves through temporally adjacent exchanges-yet most large language model (LLM) agent memory systems fail to preserve it. Existing designs follow a fragmentation-compensation paradigm: they first break dialogue streams into isolated utterances for storage, then attempt to restore coherence via embedding-based retrieval. This process irreversibly damages narrative and causal flow, while biasing retrieval towards lexical similarity. We introduce membox, a hierarchical memory architecture centered on a Topic Loom that continuously monitors dialogue in a sliding-window fashion, grouping consecutive same-topic turns into coherent \"memory boxes\" at storage time. Sealed boxes are then linked by a Trace Weaver into long-range event-timeline traces, recovering macro-topic recurrences across discontinuities. Experiments on LoCoMo demonstrate that Membox achieves up to 68% F1 improvement on temporal reasoning tasks, outperforming competitive baselines (e.g., Mem0, A-MEM). Notably, Membox attains these gains while using only a fraction of the context tokens required by existing methods, highlighting a superior balance between efficiency and effectiveness. By explicitly modeling topic continuity, Membox offers a cognitively motivated mechanism for enhancing both coherence and efficiency in LLM agents.",
        "url": "http://arxiv.org/abs/2601.03785v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03785v1",
        "arxiv_id": "2601.03785v1",
        "authors": [
            "Dehao Tao",
            "Guoliang Ma",
            "Yongfeng Huang",
            "Minghu Jiang"
        ],
        "submitted": "2026-01-07 10:36:29",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "HearSay Benchmark: Do Audio LLMs Leak What They Hear?",
        "abstract": "While Audio Large Language Models (ALLMs) have achieved remarkable progress in understanding and generation, their potential privacy implications remain largely unexplored. This paper takes the first step to investigate whether ALLMs inadvertently leak user privacy solely through acoustic voiceprints and introduces $\\textit{HearSay}$, a comprehensive benchmark constructed from over 22,000 real-world audio clips. To ensure data quality, the benchmark is meticulously curated through a rigorous pipeline involving automated profiling and human verification, guaranteeing that all privacy labels are grounded in factual records. Extensive experiments on $\\textit{HearSay}$ yield three critical findings: $\\textbf{Significant Privacy Leakage}$: ALLMs inherently extract private attributes from voiceprints, reaching 92.89% accuracy on gender and effectively profiling social attributes. $\\textbf{Insufficient Safety Mechanisms}$: Alarmingly, existing safeguards are severely inadequate; most models fail to refuse privacy-intruding requests, exhibiting near-zero refusal rates for physiological traits. $\\textbf{Reasoning Amplifies Risk}$: Chain-of-Thought (CoT) reasoning exacerbates privacy risks in capable models by uncovering deeper acoustic correlations. These findings expose critical vulnerabilities in ALLMs, underscoring the urgent need for targeted privacy alignment. The codes and dataset are available at https://github.com/JinWang79/HearSay_Benchmark",
        "url": "http://arxiv.org/abs/2601.03783v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03783v1",
        "arxiv_id": "2601.03783v1",
        "authors": [
            "Jin Wang",
            "Liang Lin",
            "Kaiwen Luo",
            "Weiliu Wang",
            "Yitian Chen",
            "Moayad Aloqaily",
            "Xuehai Tang",
            "Zhenhong Zhou",
            "Kun Wang",
            "Li Sun",
            "Qingsong Wen"
        ],
        "submitted": "2026-01-07 10:33:44",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Tracing the complexity profiles of different linguistic phenomena through the intrinsic dimension of LLM representations",
        "abstract": "We explore the intrinsic dimension (ID) of LLM representations as a marker of linguistic complexity, asking if different ID profiles across LLM layers differentially characterize formal and functional complexity. We find the formal contrast between sentences with multiple coordinated or subordinated clauses to be reflected in ID differences whose onset aligns with a phase of more abstract linguistic processing independently identified in earlier work. The functional contrasts between sentences characterized by right branching vs. center embedding or unambiguous vs. ambiguous relative clause attachment are also picked up by ID, but in a less marked way, and they do not correlate with the same processing phase. Further experiments using representational similarity and layer ablation confirm the same trends. We conclude that ID is a useful marker of linguistic complexity in LLMs, that it allows to differentiate between different types of complexity, and that it points to similar stages of linguistic processing across disparate LLMs.",
        "url": "http://arxiv.org/abs/2601.03779v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03779v1",
        "arxiv_id": "2601.03779v1",
        "authors": [
            "Marco Baroni",
            "Emily Cheng",
            "Iria deDios-Flores",
            "Francesca Franzon"
        ],
        "submitted": "2026-01-07 10:16:59",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Do LLM Self-Explanations Help Users Predict Model Behavior? Evaluating Counterfactual Simulatability with Pragmatic Perturbations",
        "abstract": "Large Language Models (LLMs) can produce verbalized self-explanations, yet prior studies suggest that such rationales may not reliably reflect the model's true decision process. We ask whether these explanations nevertheless help users predict model behavior, operationalized as counterfactual simulatability. Using StrategyQA, we evaluate how well humans and LLM judges can predict a model's answers to counterfactual follow-up questions, with and without access to the model's chain-of-thought or post-hoc explanations. We compare LLM-generated counterfactuals with pragmatics-based perturbations as alternative ways to construct test cases for assessing the potential usefulness of explanations. Our results show that self-explanations consistently improve simulation accuracy for both LLM judges and humans, but the degree and stability of gains depend strongly on the perturbation strategy and judge strength. We also conduct a qualitative analysis of free-text justifications written by human users when predicting the model's behavior, which provides evidence that access to explanations helps humans form more accurate predictions on the perturbed questions.",
        "url": "http://arxiv.org/abs/2601.03775v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03775v1",
        "arxiv_id": "2601.03775v1",
        "authors": [
            "Pingjun Hong",
            "Benjamin Roth"
        ],
        "submitted": "2026-01-07 10:13:26",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Evaluation of Multilingual LLMs Personalized Text Generation Capabilities Targeting Groups and Social-Media Platforms",
        "abstract": "Capabilities of large language models to generate multilingual coherent text have continuously enhanced in recent years, which opens concerns about their potential misuse. Previous research has shown that they can be misused for generation of personalized disinformation in multiple languages. It has also been observed that personalization negatively affects detectability of machine-generated texts; however, this has been studied in the English language only. In this work, we examine this phenomenon across 10 languages, while we focus not only on potential misuse of personalization capabilities, but also on potential benefits they offer. Overall, we cover 1080 combinations of various personalization aspects in the prompts, for which the texts are generated by 16 distinct language models (17,280 texts in total). Our results indicate that there are differences in personalization quality of the generated texts when targeting demographic groups and when targeting social-media platforms across languages. Personalization towards platforms affects detectability of the generated texts in a higher scale, especially in English, where the personalization quality is the highest.",
        "url": "http://arxiv.org/abs/2601.03752v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03752v1",
        "arxiv_id": "2601.03752v1",
        "authors": [
            "Dominik Macko"
        ],
        "submitted": "2026-01-07 09:43:13",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Bridging OLAP and RAG: A Multidimensional Approach to the Design of Corpus Partitioning",
        "abstract": "Retrieval-Augmented Generation (RAG) systems are increasingly deployed on large-scale document collections, often comprising millions of documents and tens of millions of text chunks. In industrial-scale retrieval platforms, scalability is typically addressed through horizontal sharding and a combination of Approximate Nearest-Neighbor search, hybrid indexing, and optimized metadata filtering. Although effective from an efficiency perspective, these mechanisms rely on bottom-up, similarity-driven organization and lack a conceptual rationale for corpus partitioning. In this paper, we claim that the design of large-scale RAG systems may benefit from the combination of two orthogonal strategies: semantic clustering, which optimizes locality in embedding space, and multidimensional partitioning, which governs where retrieval should occur based on conceptual dimensions such as time and organizational context. Although such dimensions are already implicitly present in current systems, they are used in an ad hoc and poorly structured manner. We propose the Dimensional Fact Model (DFM) as a conceptual framework to guide the design of multidimensional partitions for RAG corpora. The DFM provides a principled way to reason about facts, dimensions, hierarchies, and granularity in retrieval-oriented settings. This framework naturally supports hierarchical routing and controlled fallback strategies, ensuring that retrieval remains robust even in the presence of incomplete metadata, while transforming the search process from a 'black-box' similarity matching into a governable and deterministic workflow. This work is intended as a position paper; its goal is to bridge the gap between OLAP-style multidimensional modeling and modern RAG architectures, and to stimulate further research on principled, explainable, and governable retrieval strategies at scale.",
        "url": "http://arxiv.org/abs/2601.03748v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03748v1",
        "arxiv_id": "2601.03748v1",
        "authors": [
            "Dario Maio",
            "Stefano Rizzi"
        ],
        "submitted": "2026-01-07 09:37:36",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Whose Facts Win? LLM Source Preferences under Knowledge Conflicts",
        "abstract": "As large language models (LLMs) are more frequently used in retrieval-augmented generation pipelines, it is increasingly relevant to study their behavior under knowledge conflicts. Thus far, the role of the source of the retrieved information has gone unexamined. We address this gap with a novel framework to investigate how source preferences affect LLM resolution of inter-context knowledge conflicts in English, motivated by interdisciplinary research on credibility. With a comprehensive, tightly-controlled evaluation of 13 open-weight LLMs, we find that LLMs prefer institutionally-corroborated information (e.g., government or newspaper sources) over information from people and social media. However, these source preferences can be reversed by simply repeating information from less credible sources. To mitigate repetition effects and maintain consistent preferences, we propose a novel method that reduces repetition bias by up to 99.8%, while also maintaining at least 88.8% of original preferences. We release all data and code to encourage future work on credibility and source preferences in knowledge-intensive NLP.",
        "url": "http://arxiv.org/abs/2601.03746v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03746v1",
        "arxiv_id": "2601.03746v1",
        "authors": [
            "Jakob Schuster",
            "Vagrant Gautam",
            "Katja Markert"
        ],
        "submitted": "2026-01-07 09:35:35",
        "source": "arxiv",
        "comment": "Data and code: https://github.com/JaSchuste/llm-source-preference"
    },
    {
        "title": "O-Researcher: An Open Ended Deep Research Model via Multi-Agent Distillation and Agentic RL",
        "abstract": "The performance gap between closed-source and open-source large language models (LLMs) is largely attributed to disparities in access to high-quality training data. To bridge this gap, we introduce a novel framework for the automated synthesis of sophisticated, research-grade instructional data. Our approach centers on a multi-agent workflow where collaborative AI agents simulate complex tool-integrated reasoning to generate diverse and high-fidelity data end-to-end. Leveraging this synthesized data, we develop a two-stage training strategy that integrates supervised fine-tuning with a novel reinforcement learning method, designed to maximize model alignment and capability. Extensive experiments demonstrate that our framework empowers open-source models across multiple scales, enabling them to achieve new state-of-the-art performance on the major deep research benchmark. This work provides a scalable and effective pathway for advancing open-source LLMs without relying on proprietary data or models.",
        "url": "http://arxiv.org/abs/2601.03743v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03743v1",
        "arxiv_id": "2601.03743v1",
        "authors": [
            "Yi Yao",
            "He Zhu",
            "Piaohong Wang",
            "Jincheng Ren",
            "Xinlong Yang",
            "Qianben Chen",
            "Xiaowan Li",
            "Dingfeng Shi",
            "Jiaxian Li",
            "Qiexiang Wang",
            "Sinuo Wang",
            "Xinpeng Liu",
            "Jiaqi Wu",
            "Minghao Liu",
            "Wangchunshu Zhou"
        ],
        "submitted": "2026-01-07 09:31:10",
        "source": "arxiv",
        "comment": "22 pages"
    },
    {
        "title": "RadDiff: Describing Differences in Radiology Image Sets with Natural Language",
        "abstract": "Understanding how two radiology image sets differ is critical for generating clinical insights and for interpreting medical AI systems. We introduce RadDiff, a multimodal agentic system that performs radiologist-style comparative reasoning to describe clinically meaningful differences between paired radiology studies. RadDiff builds on a proposer-ranker framework from VisDiff, and incorporates four innovations inspired by real diagnostic workflows: (1) medical knowledge injection through domain-adapted vision-language models; (2) multimodal reasoning that integrates images with their clinical reports; (3) iterative hypothesis refinement across multiple reasoning rounds; and (4) targeted visual search that localizes and zooms in on salient regions to capture subtle findings. To evaluate RadDiff, we construct RadDiffBench, a challenging benchmark comprising 57 expert-validated radiology study pairs with ground-truth difference descriptions. On RadDiffBench, RadDiff achieves 47% accuracy, and 50% accuracy when guided by ground-truth reports, significantly outperforming the general-domain VisDiff baseline. We further demonstrate RadDiff's versatility across diverse clinical tasks, including COVID-19 phenotype comparison, racial subgroup analysis, and discovery of survival-related imaging features. Together, RadDiff and RadDiffBench provide the first method-and-benchmark foundation for systematically uncovering meaningful differences in radiological data.",
        "url": "http://arxiv.org/abs/2601.03733v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03733v1",
        "arxiv_id": "2601.03733v1",
        "authors": [
            "Xiaoxian Shen",
            "Yuhui Zhang",
            "Sahithi Ankireddy",
            "Xiaohan Wang",
            "Maya Varma",
            "Henry Guo",
            "Curtis Langlotz",
            "Serena Yeung-Levy"
        ],
        "submitted": "2026-01-07 09:25:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Perception-Aware Bias Detection for Query Suggestions",
        "abstract": "Bias in web search has been in the spotlight of bias detection research for quite a while. At the same time, little attention has been paid to query suggestions in this regard. Awareness of the problem of biased query suggestions has been raised. Likewise, there is a rising need for automatic bias detection approaches. This paper adds on the bias detection pipeline for bias detection in query suggestions of person-related search developed by Bonart et al. \\cite{Bonart_2019a}. The sparseness and lack of contextual metadata of query suggestions make them a difficult subject for bias detection. Furthermore, query suggestions are perceived very briefly and subliminally. To overcome these issues, perception-aware metrics are introduced. Consequently, the enhanced pipeline is able to better detect systematic topical bias in search engine query suggestions for person-related searches. The results of an analysis performed with the developed pipeline confirm this assumption. Due to the perception-aware bias detection metrics, findings produced by the pipeline can be assumed to reflect bias that users would discern.",
        "url": "http://arxiv.org/abs/2601.03730v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03730v1",
        "arxiv_id": "2601.03730v1",
        "authors": [
            "Fabian Haak",
            "Philipp Schaer"
        ],
        "submitted": "2026-01-07 09:21:59",
        "source": "arxiv",
        "comment": "13 pages (pp. 130-142); 2 figures; 2 tables; Workshop paper (BIAS 2021) published in CCIS vol. 1418 (Springer)"
    },
    {
        "title": "Stuttering-Aware Automatic Speech Recognition for Indonesian Language",
        "abstract": "Automatic speech recognition systems have achieved remarkable performance on fluent speech but continue to degrade significantly when processing stuttered speech, a limitation that is particularly acute for low-resource languages like Indonesian where specialized datasets are virtually non-existent. To overcome this scarcity, we propose a data augmentation framework that generates synthetic stuttered audio by injecting repetitions and prolongations into fluent text through a combination of rule-based transformations and large language models followed by text-to-speech synthesis. We apply this synthetic data to fine-tune a pre-trained Indonesian Whisper model using transfer learning, enabling the architecture to adapt to dysfluent acoustic patterns without requiring large-scale real-world recordings. Our experiments demonstrate that this targeted synthetic exposure consistently reduces recognition errors on stuttered speech while maintaining performance on fluent segments, validating the utility of synthetic data pipelines for developing more inclusive speech technologies in under-represented languages.",
        "url": "http://arxiv.org/abs/2601.03727v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03727v1",
        "arxiv_id": "2601.03727v1",
        "authors": [
            "Fadhil Muhammad",
            "Alwin Djuliansah",
            "Adrian Aryaputra Hamzah",
            "Kurniawati Azizah"
        ],
        "submitted": "2026-01-07 09:21:12",
        "source": "arxiv",
        "comment": "Preprint"
    },
    {
        "title": "MIND: From Passive Mimicry to Active Reasoning through Capability-Aware Multi-Perspective CoT Distillation",
        "abstract": "While Large Language Models (LLMs) have emerged with remarkable capabilities in complex tasks through Chain-of-Thought reasoning, practical resource constraints have sparked interest in transferring these abilities to smaller models. However, achieving both domain performance and cross-domain generalization remains challenging. Existing approaches typically restrict students to following a single golden rationale and treat different reasoning paths independently. Due to distinct inductive biases and intrinsic preferences, alongside the student's evolving capacity and reasoning preferences during training, a teacher's \"optimal\" rationale could act as out-of-distribution noise. This misalignment leads to a degeneration of the student's latent reasoning distribution, causing suboptimal performance. To bridge this gap, we propose MIND, a capability-adaptive framework that transitions distillation from passive mimicry to active cognitive construction. We synthesize diverse teacher perspectives through a novel \"Teaching Assistant\" network. By employing a Feedback-Driven Inertia Calibration mechanism, this network utilizes inertia-filtered training loss to align supervision with the student's current adaptability, effectively enhancing performance while mitigating catastrophic forgetting. Extensive experiments demonstrate that MIND achieves state-of-the-art performance on both in-distribution and out-of-distribution benchmarks, and our sophisticated latent space analysis further confirms the mechanism of reasoning ability internalization.",
        "url": "http://arxiv.org/abs/2601.03717v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03717v1",
        "arxiv_id": "2601.03717v1",
        "authors": [
            "Jin Cui",
            "Jiaqi Guo",
            "Jiepeng Zhou",
            "Ruixuan Yang",
            "Jiayi Lu",
            "Jiajun Xu",
            "Jiangcheng Song",
            "Boran Zhao",
            "Pengju Ren"
        ],
        "submitted": "2026-01-07 09:08:59",
        "source": "arxiv",
        "comment": "13 pages, 8 figures"
    },
    {
        "title": "Visual Merit or Linguistic Crutch? A Close Look at DeepSeek-OCR",
        "abstract": "DeepSeek-OCR utilizes an optical 2D mapping approach to achieve high-ratio vision-text compression, claiming to decode text tokens exceeding ten times the input visual tokens. While this suggests a promising solution for the LLM long-context bottleneck, we investigate a critical question: \"Visual merit or linguistic crutch - which drives DeepSeek-OCR's performance?\" By employing sentence-level and word-level semantic corruption, we isolate the model's intrinsic OCR capabilities from its language priors. Results demonstrate that without linguistic support, DeepSeek-OCR's performance plummets from approximately 90% to 20%. Comparative benchmarking against 13 baseline models reveals that traditional pipeline OCR methods exhibit significantly higher robustness to such semantic perturbations than end-to-end methods. Furthermore, we find that lower visual token counts correlate with increased reliance on priors, exacerbating hallucination risks. Context stress testing also reveals a total model collapse around 10,000 text tokens, suggesting that current optical compression techniques may paradoxically aggravate the long-context bottleneck. This study empirically defines DeepSeek-OCR's capability boundaries and offers essential insights for future optimizations of the vision-text compression paradigm. We release all data, results and scripts used in this study at https://github.com/dududuck00/DeepSeekOCR.",
        "url": "http://arxiv.org/abs/2601.03714v2",
        "pdf_url": "https://arxiv.org/pdf/2601.03714v2",
        "arxiv_id": "2601.03714v2",
        "authors": [
            "Yunhao Liang",
            "Ruixuan Ying",
            "Bo Li",
            "Hong Li",
            "Kai Yan",
            "Qingwen Li",
            "Min Yang",
            "Okamoto Satoshi",
            "Zhe Cui",
            "Shiwen Ni"
        ],
        "submitted": "2026-01-07 09:01:23",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "AirNav: A Large-Scale Real-World UAV Vision-and-Language Navigation Dataset with Natural and Diverse Instructions",
        "abstract": "Existing Unmanned Aerial Vehicle (UAV) Vision-Language Navigation (VLN) datasets face issues such as dependence on virtual environments, lack of naturalness in instructions, and limited scale. To address these challenges, we propose AirNav, a large-scale UAV VLN benchmark constructed from real urban aerial data, rather than synthetic environments, with natural and diverse instructions. Additionally, we introduce the AirVLN-R1, which combines Supervised Fine-Tuning and Reinforcement Fine-Tuning to enhance performance and generalization. The feasibility of the model is preliminarily evaluated through real-world tests. Our dataset and code are publicly available.",
        "url": "http://arxiv.org/abs/2601.03707v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03707v1",
        "arxiv_id": "2601.03707v1",
        "authors": [
            "Hengxing Cai",
            "Yijie Rao",
            "Ligang Huang",
            "Zanyang Zhong",
            "Jinhan Dong",
            "Jingjun Tan",
            "Wenhao Lu",
            "Renxin Zhong"
        ],
        "submitted": "2026-01-07 08:46:09",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ADEPT: Adaptive Dynamic Early-Exit Process for Transformers",
        "abstract": "The inference of large language models imposes significant computational workloads, often requiring the processing of billions of parameters. Although early-exit strategies have proven effective in reducing computational demands by halting inference earlier, they apply either to only the first token in the generation phase or at the prompt level in the prefill phase. Thus, the Key-Value (KV) cache for skipped layers remains a bottleneck for subsequent token generation, limiting the benefits of early exit. We introduce ADEPT (Adaptive Dynamic Early-exit Process for Transformers), a novel approach designed to overcome this issue and enable dynamic early exit in both the prefill and generation phases. The proposed adaptive token-level early-exit mechanism adjusts computation dynamically based on token complexity, optimizing efficiency without compromising performance. ADEPT further enhances KV generation procedure by decoupling sequential dependencies in skipped layers, making token-level early exit more practical. Experimental results demonstrate that ADEPT improves efficiency by up to 25% in language generation tasks and achieves a 4x speed-up in downstream classification tasks, with up to a 45% improvement in performance.",
        "url": "http://arxiv.org/abs/2601.03700v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03700v1",
        "arxiv_id": "2601.03700v1",
        "authors": [
            "Sangmin Yoo",
            "Srikanth Malla",
            "Chiho Choi",
            "Wei D. Lu",
            "Joon Hee Choi"
        ],
        "submitted": "2026-01-07 08:34:41",
        "source": "arxiv",
        "comment": "11 figures, 8 tables, 22 pages"
    },
    {
        "title": "RedBench: A Universal Dataset for Comprehensive Red Teaming of Large Language Models",
        "abstract": "As large language models (LLMs) become integral to safety-critical applications, ensuring their robustness against adversarial prompts is paramount. However, existing red teaming datasets suffer from inconsistent risk categorizations, limited domain coverage, and outdated evaluations, hindering systematic vulnerability assessments. To address these challenges, we introduce RedBench, a universal dataset aggregating 37 benchmark datasets from leading conferences and repositories, comprising 29,362 samples across attack and refusal prompts. RedBench employs a standardized taxonomy with 22 risk categories and 19 domains, enabling consistent and comprehensive evaluations of LLM vulnerabilities. We provide a detailed analysis of existing datasets, establish baselines for modern LLMs, and open-source the dataset and evaluation code. Our contributions facilitate robust comparisons, foster future research, and promote the development of secure and reliable LLMs for real-world deployment. Code: https://github.com/knoveleng/redeval",
        "url": "http://arxiv.org/abs/2601.03699v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03699v1",
        "arxiv_id": "2601.03699v1",
        "authors": [
            "Quy-Anh Dang",
            "Chris Ngo",
            "Truong-Son Hy"
        ],
        "submitted": "2026-01-07 08:34:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Evaluation Framework for AI Creativity: A Case Study Based on Story Generation",
        "abstract": "Evaluating creative text generation remains a challenge because existing reference-based metrics fail to capture the subjective nature of creativity. We propose a structured evaluation framework for AI story generation comprising four components (Novelty, Value, Adherence, and Resonance) and eleven sub-components. Using controlled story generation via ``Spike Prompting'' and a crowdsourced study of 115 readers, we examine how different creative components shape both immediate and reflective human creativity judgments. Our findings show that creativity is evaluated hierarchically rather than cumulatively, with different dimensions becoming salient at different stages of judgment, and that reflective evaluation substantially alters both ratings and inter-rater agreement. Together, these results support the effectiveness of our framework in revealing dimensions of creativity that are obscured by reference-based evaluation.",
        "url": "http://arxiv.org/abs/2601.03698v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03698v1",
        "arxiv_id": "2601.03698v1",
        "authors": [
            "Pharath Sathya",
            "Yin Jou Huang",
            "Fei Cheng"
        ],
        "submitted": "2026-01-07 08:31:08",
        "source": "arxiv",
        "comment": "Work in progress"
    },
    {
        "title": "From Implicit to Explicit: Token-Efficient Logical Supervision for Mathematical Reasoning in LLMs",
        "abstract": "Recent studies reveal that large language models (LLMs) exhibit limited logical reasoning abilities in mathematical problem-solving, instead often relying on pattern-matching and memorization. We systematically analyze this limitation, focusing on logical relationship understanding, which is a core capability underlying genuine logical reasoning, and reveal that errors related to this capability account for over 90\\% of incorrect predictions, with Chain-of-Thought Supervised Fine-Tuning (CoT-SFT) failing to substantially reduce these errors. To address this bottleneck, we propose First-Step Logical Reasoning (FSLR), a lightweight training framework targeting logical relationship understanding. Our key insight is that the first planning step-identifying which variables to use and which operation to apply-encourages the model to derive logical relationships directly from the problem statement. By training models on this isolated step, FSLR provides explicit supervision for logical relationship understanding, unlike CoT-SFT which implicitly embeds such relationships within complete solution trajectories. Extensive experiments across multiple models and datasets demonstrate that FSLR consistently outperforms CoT-SFT under both in-distribution and out-of-distribution settings, with average improvements of 3.2\\% and 4.6\\%, respectively. Moreover, FSLR achieves 4-6x faster training and reduces training token consumption by over 80\\%.",
        "url": "http://arxiv.org/abs/2601.03682v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03682v1",
        "arxiv_id": "2601.03682v1",
        "authors": [
            "Shaojie Wang",
            "Liang Zhang"
        ],
        "submitted": "2026-01-07 08:15:01",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Towards Compositional Generalization of LLMs via Skill Taxonomy Guided Data Synthesis",
        "abstract": "Large Language Models (LLMs) and agent-based systems often struggle with compositional generalization due to a data bottleneck in which complex skill combinations follow a long-tailed, power-law distribution, limiting both instruction-following performance and generalization in agent-centric tasks. To address this challenge, we propose STEPS, a Skill Taxonomy guided Entropy-based Post-training data Synthesis framework for generating compositionally challenging data. STEPS explicitly targets compositional generalization by uncovering latent relationships among skills and organizing them into an interpretable, hierarchical skill taxonomy using structural information theory. Building on this taxonomy, we formulate data synthesis as a constrained information maximization problem, selecting skill combinations that maximize marginal structural information within the hierarchy while preserving semantic coherence. Experiments on challenging instruction-following benchmarks show that STEPS outperforms existing data synthesis baselines, while also yielding improved compositional generalization in downstream agent-based evaluations.",
        "url": "http://arxiv.org/abs/2601.03676v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03676v1",
        "arxiv_id": "2601.03676v1",
        "authors": [
            "Yifan Wei",
            "Li Du",
            "Xiaoyan Yu",
            "Yang Feng",
            "Angsheng Li"
        ],
        "submitted": "2026-01-07 07:58:51",
        "source": "arxiv",
        "comment": "The code and data for our methods and experiments are available at https://github.com/weiyifan1023/STEPS"
    },
    {
        "title": "Sandwich Reasoning: An Answer-Reasoning-Answer Approach for Low-Latency Query Correction",
        "abstract": "Query correction is a critical entry point in modern search pipelines, demanding high accuracy strictly within real-time latency constraints. Chain-of-Thought (CoT) reasoning improves accuracy but incurs prohibitive latency for real-time query correction. A potential solution is to output an answer before reasoning to reduce latency; however, under autoregressive decoding, the early answer is independent of subsequent reasoning, preventing the model from leveraging its reasoning capability to improve accuracy. To address this issue, we propose Sandwich Reasoning (SandwichR), a novel approach that explicitly aligns a fast initial answer with post-hoc reasoning, enabling low-latency query correction without sacrificing reasoning-aware accuracy. SandwichR follows an Answer-Reasoning-Answer paradigm, producing an initial correction, an explicit reasoning process, and a final refined correction. To align the initial answer with post-reasoning insights, we design a consistency-aware reinforcement learning (RL) strategy: a dedicated consistency reward enforces alignment between the initial and final corrections, while margin-based rejection sampling prioritizes borderline samples where reasoning drives the most impactful corrective gains. Additionally, we construct a high-quality query correction dataset, addressing the lack of specialized benchmarks for complex query correction. Experimental results demonstrate that SandwichR achieves SOTA accuracy comparable to standard CoT while delivering a 40-70% latency reduction, resolving the latency-accuracy trade-off in online search.",
        "url": "http://arxiv.org/abs/2601.03672v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03672v1",
        "arxiv_id": "2601.03672v1",
        "authors": [
            "Chen Zhang",
            "Kepu Zhang",
            "Jiatong Zhang",
            "Xiao Zhang",
            "Jun Xu"
        ],
        "submitted": "2026-01-07 07:52:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "NeuronScope: A Multi-Agent Framework for Explaining Polysemantic Neurons in Language Models",
        "abstract": "Neuron-level interpretation in large language models (LLMs) is fundamentally challenged by widespread polysemanticity, where individual neurons respond to multiple distinct semantic concepts. Existing single-pass interpretation methods struggle to faithfully capture such multi-concept behavior. In this work, we propose NeuronScope, a multi-agent framework that reformulates neuron interpretation as an iterative, activation-guided process. NeuronScope explicitly deconstructs neuron activations into atomic semantic components, clusters them into distinct semantic modes, and iteratively refines each explanation using neuron activation feedback. Experiments demonstrate that NeuronScope uncovers hidden polysemanticity and produces explanations with significantly higher activation correlation compared to single-pass baselines.",
        "url": "http://arxiv.org/abs/2601.03671v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03671v1",
        "arxiv_id": "2601.03671v1",
        "authors": [
            "Weiqi Liu",
            "Yongliang Miao",
            "Haiyan Zhao",
            "Yanguang Liu",
            "Mengnan Du"
        ],
        "submitted": "2026-01-07 07:50:47",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "DisastQA: A Comprehensive Benchmark for Evaluating Question Answering in Disaster Management",
        "abstract": "Accurate question answering (QA) in disaster management requires reasoning over uncertain and conflicting information, a setting poorly captured by existing benchmarks built on clean evidence. We introduce DisastQA, a large-scale benchmark of 3,000 rigorously verified questions (2,000 multiple-choice and 1,000 open-ended) spanning eight disaster types. The benchmark is constructed via a human-LLM collaboration pipeline with stratified sampling to ensure balanced coverage. Models are evaluated under varying evidence conditions, from closed-book to noisy evidence integration, enabling separation of internal knowledge from reasoning under imperfect information. For open-ended QA, we propose a human-verified keypoint-based evaluation protocol emphasizing factual completeness over verbosity. Experiments with 20 models reveal substantial divergences from general-purpose leaderboards such as MMLU-Pro. While recent open-weight models approach proprietary systems in clean settings, performance degrades sharply under realistic noise, exposing critical reliability gaps for disaster response. All code, data, and evaluation resources are available at https://github.com/TamuChen18/DisastQA_open.",
        "url": "http://arxiv.org/abs/2601.03670v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03670v1",
        "arxiv_id": "2601.03670v1",
        "authors": [
            "Zhitong Chen",
            "Kai Yin",
            "Xiangjue Dong",
            "Chengkai Liu",
            "Xiangpeng Li",
            "Yiming Xiao",
            "Bo Li",
            "Junwei Ma",
            "Ali Mostafavi",
            "James Caverlee"
        ],
        "submitted": "2026-01-07 07:46:42",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "eTracer: Towards Traceable Text Generation via Claim-Level Grounding",
        "abstract": "How can system-generated responses be efficiently verified, especially in the high-stakes biomedical domain? To address this challenge, we introduce eTracer, a plug-and-play framework that enables traceable text generation by grounding claims against contextual evidence. Through post-hoc grounding, each response claim is aligned with contextual evidence that either supports or contradicts it. Building on claim-level grounding results, eTracer not only enables users to precisely trace responses back to their contextual source but also quantifies response faithfulness, thereby enabling the verifiability and trustworthiness of generated responses. Experiments show that our claim-level grounding approach alleviates the limitations of conventional grounding methods in aligning generated statements with contextual sentence-level evidence, resulting in substantial improvements in overall grounding quality and user verification efficiency. The code and data are available at https://github.com/chubohao/eTracer.",
        "url": "http://arxiv.org/abs/2601.03669v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03669v1",
        "arxiv_id": "2601.03669v1",
        "authors": [
            "Bohao Chu",
            "Qianli Wang",
            "Hendrik Damm",
            "Hui Wang",
            "Ula Muhabbek",
            "Elisabeth Livingstone",
            "Christoph M. Friedrich",
            "Norbert Fuhr"
        ],
        "submitted": "2026-01-07 07:44:30",
        "source": "arxiv",
        "comment": "ACL 2026 Conference Submission (8 main pages)"
    },
    {
        "title": "e5-omni: Explicit Cross-modal Alignment for Omni-modal Embeddings",
        "abstract": "Modern information systems often involve different types of items, e.g., a text query, an image, a video clip, or an audio segment. This motivates omni-modal embedding models that map heterogeneous modalities into a shared space for direct comparison. However, most recent omni-modal embeddings still rely heavily on implicit alignment inherited from pretrained vision-language model (VLM) backbones. In practice, this causes three common issues: (i) similarity logits have modality-dependent sharpness, so scores are not on a consistent scale; (ii) in-batch negatives become less effective over time because mixed-modality batches create an imbalanced hardness distribution; as a result, many negatives quickly become trivial and contribute little gradient; and (iii) embeddings across modalities show mismatched first- and second-order statistics, which makes rankings less stable. To tackle these problems, we propose e5-omni, a lightweight explicit alignment recipe that adapts off-the-shelf VLMs into robust omni-modal embedding models. e5-omni combines three simple components: (1) modality-aware temperature calibration to align similarity scales, (2) a controllable negative curriculum with debiasing to focus on confusing negatives while reducing the impact of false negatives, and (3) batch whitening with covariance regularization to better match cross-modal geometry in the shared embedding space. Experiments on MMEB-V2 and AudioCaps show consistent gains over strong bi-modal and omni-modal baselines, and the same recipe also transfers well to other VLM backbones. We release our model checkpoint at https://huggingface.co/Haon-Chen/e5-omni-7B.",
        "url": "http://arxiv.org/abs/2601.03666v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03666v1",
        "arxiv_id": "2601.03666v1",
        "authors": [
            "Haonan Chen",
            "Sicheng Gao",
            "Radu Timofte",
            "Tetsuya Sakai",
            "Zhicheng Dou"
        ],
        "submitted": "2026-01-07 07:39:40",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SyncThink: A Training-Free Strategy to Align Inference Termination with Reasoning Saturation",
        "abstract": "Chain-of-Thought (CoT) prompting improves reasoning but often produces long and redundant traces that substantially increase inference cost. We present SyncThink, a training-free and plug-and-play decoding method that reduces CoT overhead without modifying model weights. We find that answer tokens attend weakly to early reasoning and instead focus on the special token \"/think\", indicating an information bottleneck. Building on this observation, SyncThink monitors the model's own reasoning-transition signal and terminates reasoning. Experiments on GSM8K, MMLU, GPQA, and BBH across three DeepSeek-R1 distilled models show that SyncThink achieves 62.00 percent average Top-1 accuracy using 656 generated tokens and 28.68 s latency, compared to 61.22 percent, 2141 tokens, and 92.01 s for full CoT decoding. On long-horizon tasks such as GPQA, SyncThink can further yield up to +8.1 absolute accuracy by preventing over-thinking.",
        "url": "http://arxiv.org/abs/2601.03649v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03649v1",
        "arxiv_id": "2601.03649v1",
        "authors": [
            "Gengyang Li",
            "Wang Cai",
            "Yifeng Gao",
            "Yunfang Wu"
        ],
        "submitted": "2026-01-07 07:00:15",
        "source": "arxiv",
        "comment": "14 pages, 8 figures"
    },
    {
        "title": "ELO: Efficient Layer-Specific Optimization for Continual Pretraining of Multilingual LLMs",
        "abstract": "We propose an efficient layer-specific optimization (ELO) method designed to enhance continual pretraining (CP) for specific languages in multilingual large language models (MLLMs). This approach addresses the common challenges of high computational cost and degradation of source language performance associated with traditional CP. The ELO method consists of two main stages: (1) ELO Pretraining, where a small subset of specific layers, identified in our experiments as the critically important first and last layers, are detached from the original MLLM and trained with the target language. This significantly reduces not only the number of trainable parameters but also the total parameters computed during the forward pass, minimizing GPU memory consumption and accelerating the training process. (2) Layer Alignment, where the newly trained layers are reintegrated into the original model, followed by a brief full fine-tuning step on a small dataset to align the parameters. Experimental results demonstrate that the ELO method achieves a training speedup of up to 6.46 times compared to existing methods, while improving target language performance by up to 6.2\\% on qualitative benchmarks and effectively preserving source language (English) capabilities.",
        "url": "http://arxiv.org/abs/2601.03648v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03648v1",
        "arxiv_id": "2601.03648v1",
        "authors": [
            "HanGyeol Yoo",
            "ChangSu Choi",
            "Minjun Kim",
            "Seohyun Song",
            "SeungWoo Song",
            "Inho Won",
            "Jongyoul Park",
            "Cheoneum Park",
            "KyungTae Lim"
        ],
        "submitted": "2026-01-07 06:55:29",
        "source": "arxiv",
        "comment": "12 pages, Accepted to EACL 2026 (Industrial Track)"
    },
    {
        "title": "LLM-MC-Affect: LLM-Based Monte Carlo Modeling of Affective Trajectories and Latent Ambiguity for Interpersonal Dynamic Insight",
        "abstract": "Emotional coordination is a core property of human interaction that shapes how relational meaning is constructed in real time. While text-based affect inference has become increasingly feasible, prior approaches often treat sentiment as a deterministic point estimate for individual speakers, failing to capture the inherent subjectivity, latent ambiguity, and sequential coupling found in mutual exchanges. We introduce LLM-MC-Affect, a probabilistic framework that characterizes emotion not as a static label, but as a continuous latent probability distribution defined over an affective space. By leveraging stochastic LLM decoding and Monte Carlo estimation, the methodology approximates these distributions to derive high-fidelity sentiment trajectories that explicitly quantify both central affective tendencies and perceptual ambiguity. These trajectories enable a structured analysis of interpersonal coupling through sequential cross-correlation and slope-based indicators, identifying leading or lagging influences between interlocutors. To validate the interpretive capacity of this approach, we utilize teacher-student instructional dialogues as a representative case study, where our quantitative indicators successfully distill high-level interaction insights such as effective scaffolding. This work establishes a scalable and deployable pathway for understanding interpersonal dynamics, offering a generalizable solution that extends beyond education to broader social and behavioral research.",
        "url": "http://arxiv.org/abs/2601.03645v1",
        "pdf_url": "https://arxiv.org/pdf/2601.03645v1",
        "arxiv_id": "2601.03645v1",
        "authors": [
            "Yu-Zheng Lin",
            "Bono Po-Jen Shih",
            "John Paul Martin Encinas",
            "Elizabeth Victoria Abraham Achom",
            "Karan Himanshu Patel",
            "Jesus Horacio Pacheco",
            "Sicong Shao",
            "Jyotikrishna Dass",
            "Soheil Salehi",
            "Pratik Satam"
        ],
        "submitted": "2026-01-07 06:50:41",
        "source": "arxiv",
        "comment": null
    }
]