[
    {
        "title": "Evolutionary Strategies lead to Catastrophic Forgetting in LLMs",
        "abstract": "One of the biggest missing capabilities in current AI systems is the ability to learn continuously after deployment. Implementing such continually learning systems have several challenges, one of which is the large memory requirement of gradient-based algorithms that are used to train state-of-the-art LLMs. Evolutionary Strategies (ES) have recently re-emerged as a gradient-free alternative to traditional learning algorithms and have shown encouraging performance on specific tasks in LLMs. In this paper, we perform a comprehensive analysis of ES and specifically evaluate its forgetting curves when training for an increasing number of update steps. We first find that ES is able to reach performance numbers close to GRPO for math and reasoning tasks with a comparable compute budget. However, and most importantly for continual learning, the performance gains in ES is accompanied by significant forgetting of prior abilities, limiting its applicability for training models online. We also explore the reason behind this behavior and show that the updates made using ES are much less sparse and have orders of magnitude larger $\\ell_2$ norm compared to corresponding GRPO updates, explaining the contrasting forgetting curves between the two algorithms. With this study, we aim to highlight the issue of forgetting in gradient-free algorithms like ES and hope to inspire future work to mitigate these issues.",
        "url": "http://arxiv.org/abs/2601.20861v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20861v1",
        "arxiv_id": "2601.20861v1",
        "authors": [
            "Immanuel Abdi",
            "Akshat Gupta",
            "Micah Mok",
            "Alexander Lu",
            "Nicholas Lee",
            "Gopala Anumanchipalli"
        ],
        "submitted": "2026-01-28 18:59:34",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "When Flores Bloomz Wrong: Cross-Direction Contamination in Machine Translation Evaluation",
        "abstract": "Large language models (LLMs) can be benchmark-contaminated, resulting in inflated scores that mask memorization as generalization, and in multilingual settings, this memorization can even transfer to \"uncontaminated\" languages. Using the FLORES-200 translation benchmark as a diagnostic, we study two 7-8B instruction-tuned multilingual LLMs: Bloomz, which was trained on FLORES, and Llama as an uncontaminated control. We confirm Bloomz's FLORES contamination and demonstrate that machine translation contamination can be cross-directional, artificially boosting performance in unseen translation directions due to target-side memorization. Further analysis shows that recall of memorized references often persists despite various source-side perturbation efforts like paraphrasing and named entity replacement. However, replacing named entities leads to a consistent decrease in BLEU, suggesting an effective probing method for memorization in contaminated models.",
        "url": "http://arxiv.org/abs/2601.20858v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20858v1",
        "arxiv_id": "2601.20858v1",
        "authors": [
            "David Tan",
            "Pinzhen Chen",
            "Josef van Genabith",
            "Koel Dutta Chowdhury"
        ],
        "submitted": "2026-01-28 18:56:21",
        "source": "arxiv",
        "comment": "5 pages of content, 15 total. 5 figures, 12 tables total. Accepted to EACL 2026 main conference. Code can be found here: github.com/Mr-Ao-25/cross-ling-contamination"
    },
    {
        "title": "Post-Training Fairness Control: A Single-Train Framework for Dynamic Fairness in Recommendation",
        "abstract": "Despite growing efforts to mitigate unfairness in recommender systems, existing fairness-aware methods typically fix the fairness requirement at training time and provide limited post-training flexibility. However, in real-world scenarios, diverse stakeholders may demand differing fairness requirements over time, so retraining for different fairness requirements becomes prohibitive. To address this limitation, we propose Cofair, a single-train framework that enables post-training fairness control in recommendation. Specifically, Cofair introduces a shared representation layer with fairness-conditioned adapter modules to produce user embeddings specialized for varied fairness levels, along with a user-level regularization term that guarantees user-wise monotonic fairness improvements across these levels. We theoretically establish that the adversarial objective of Cofair upper bounds demographic parity and the regularization term enforces progressive fairness at user level. Comprehensive experiments on multiple datasets and backbone models demonstrate that our framework provides dynamic fairness at different levels, delivering comparable or better fairness-accuracy curves than state-of-the-art baselines, without the need to retrain for each new fairness requirement. Our code is publicly available at https://github.com/weixinchen98/Cofair.",
        "url": "http://arxiv.org/abs/2601.20848v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20848v1",
        "arxiv_id": "2601.20848v1",
        "authors": [
            "Weixin Chen",
            "Li Chen",
            "Yuhan Zhao"
        ],
        "submitted": "2026-01-28 18:48:43",
        "source": "arxiv",
        "comment": "Accepted to WWW 2026 Workshop on HCRS (Oral Presentation)"
    },
    {
        "title": "$\\mathbb{R}^{2k}$ is Theoretically Large Enough for Embedding-based Top-$k$ Retrieval",
        "abstract": "This paper studies the minimal dimension required to embed subset memberships ($m$ elements and ${m\\choose k}$ subsets of at most $k$ elements) into vector spaces, denoted as Minimal Embeddable Dimension (MED). The tight bounds of MED are derived theoretically and supported empirically for various notions of \"distances\" or \"similarities,\" including the $\\ell_2$ metric, inner product, and cosine similarity. In addition, we conduct numerical simulation in a more achievable setting, where the ${m\\choose k}$ subset embeddings are chosen as the centroid of the embeddings of the contained elements. Our simulation easily realizes a logarithmic dependency between the MED and the number of elements to embed. These findings imply that embedding-based retrieval limitations stem primarily from learnability challenges, not geometric constraints, guiding future algorithm design.",
        "url": "http://arxiv.org/abs/2601.20844v2",
        "pdf_url": "https://arxiv.org/pdf/2601.20844v2",
        "arxiv_id": "2601.20844v2",
        "authors": [
            "Zihao Wang",
            "Hang Yin",
            "Lihui Liu",
            "Hanghang Tong",
            "Yangqiu Song",
            "Ginny Wong",
            "Simon See"
        ],
        "submitted": "2026-01-28 18:45:43",
        "source": "arxiv",
        "comment": "v2: fix broken citation"
    },
    {
        "title": "Reward Models Inherit Value Biases from Pretraining",
        "abstract": "Reward models (RMs) are central to aligning large language models (LLMs) with human values but have received less attention than pre-trained and post-trained LLMs themselves. Because RMs are initialized from LLMs, they inherit representations that shape their behavior, but the nature and extent of this influence remain understudied. In a comprehensive study of 10 leading open-weight RMs using validated psycholinguistic corpora, we show that RMs exhibit significant differences along multiple dimensions of human value as a function of their base model. Using the \"Big Two\" psychological axes, we show a robust preference of Llama RMs for \"agency\" and a corresponding robust preference of Gemma RMs for \"communion.\" This phenomenon holds even when the preference data and finetuning process are identical, and we trace it back to the logits of the respective instruction-tuned and pre-trained models. These log-probability differences themselves can be formulated as an implicit RM; we derive usable implicit reward scores and show that they exhibit the very same agency/communion difference. We run experiments training RMs with ablations for preference data source and quantity, which demonstrate that this effect is not only repeatable but surprisingly durable. Despite RMs being designed to represent human preferences, our evidence shows that their outputs are influenced by the pretrained LLMs on which they are based. This work underscores the importance of safety and alignment efforts at the pretraining stage, and makes clear that open-source developers' choice of base model is as much a consideration of values as of performance.",
        "url": "http://arxiv.org/abs/2601.20838v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20838v1",
        "arxiv_id": "2601.20838v1",
        "authors": [
            "Brian Christian",
            "Jessica A. F. Thompson",
            "Elle Michelle Yang",
            "Vincent Adam",
            "Hannah Rose Kirk",
            "Christopher Summerfield",
            "Tsvetomira Dumbalska"
        ],
        "submitted": "2026-01-28 18:40:29",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Linear representations in language models can change dramatically over a conversation",
        "abstract": "Language model representations often contain linear directions that correspond to high-level concepts. Here, we study the dynamics of these representations: how representations evolve along these dimensions within the context of (simulated) conversations. We find that linear representations can change dramatically over a conversation; for example, information that is represented as factual at the beginning of a conversation can be represented as non-factual at the end and vice versa. These changes are content-dependent; while representations of conversation-relevant information may change, generic information is generally preserved. These changes are robust even for dimensions that disentangle factuality from more superficial response patterns, and occur across different model families and layers of the model. These representation changes do not require on-policy conversations; even replaying a conversation script written by an entirely different model can produce similar changes. However, adaptation is much weaker from simply having a sci-fi story in context that is framed more explicitly as such. We also show that steering along a representational direction can have dramatically different effects at different points in a conversation. These results are consistent with the idea that representations may evolve in response to the model playing a particular role that is cued by a conversation. Our findings may pose challenges for interpretability and steering -- in particular, they imply that it may be misleading to use static interpretations of features or directions, or probes that assume a particular range of features consistently corresponds to a particular ground-truth value. However, these types of representational dynamics also point to exciting new research directions for understanding how models adapt to context.",
        "url": "http://arxiv.org/abs/2601.20834v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20834v1",
        "arxiv_id": "2601.20834v1",
        "authors": [
            "Andrew Kyle Lampinen",
            "Yuxuan Li",
            "Eghbal Hosseini",
            "Sangnie Bhardwaj",
            "Murray Shanahan"
        ],
        "submitted": "2026-01-28 18:33:17",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Training Reasoning Models on Saturated Problems via Failure-Prefix Conditioning",
        "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) has substantially improved the reasoning abilities of large language models (LLMs), yet training often stalls as problems become saturated. We identify the core challenge as the poor accessibility of informative failures: learning signals exist but are rarely encountered during standard rollouts. To address this, we propose failure-prefix conditioning, a simple and effective method for learning from saturated problems. Rather than starting from the original question, our approach reallocates exploration by conditioning training on prefixes derived from rare incorrect reasoning trajectories, thereby exposing the model to failure-prone states. We observe that failure-prefix conditioning yields performance gains matching those of training on medium-difficulty problems, while preserving token efficiency. Furthermore, we analyze the model's robustness, finding that our method reduces performance degradation under misleading failure prefixes, albeit with a mild trade-off in adherence to correct early reasoning. Finally, we demonstrate that an iterative approach, which refreshes failure prefixes during training, unlocks additional gains after performance plateaus. Overall, our results suggest that failure-prefix conditioning offers an effective pathway to extend RLVR training on saturated problems.",
        "url": "http://arxiv.org/abs/2601.20829v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20829v1",
        "arxiv_id": "2601.20829v1",
        "authors": [
            "Minwu Kim",
            "Safal Shrestha",
            "Keith Ross"
        ],
        "submitted": "2026-01-28 18:29:21",
        "source": "arxiv",
        "comment": "16 pages"
    },
    {
        "title": "Structured Semantic Information Helps Retrieve Better Examples for In-Context Learning in Few-Shot Relation Extraction",
        "abstract": "This paper presents several strategies to automatically obtain additional examples for in-context learning of one-shot relation extraction. Specifically, we introduce a novel strategy for example selection, in which new examples are selected based on the similarity of their underlying syntactic-semantic structure to the provided one-shot example. We show that this method results in complementary word choices and sentence structures when compared to LLM-generated examples. When these strategies are combined, the resulting hybrid system achieves a more holistic picture of the relations of interest than either method alone. Our framework transfers well across datasets (FS-TACRED and FS-FewRel) and LLM families (Qwen and Gemma). Overall, our hybrid selection method consistently outperforms alternative strategies and achieves state-of-the-art performance on FS-TACRED and strong gains on a customized FewRel subset.",
        "url": "http://arxiv.org/abs/2601.20803v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20803v1",
        "arxiv_id": "2601.20803v1",
        "authors": [
            "Aunabil Chakma",
            "Mihai Surdeanu",
            "Eduardo Blanco"
        ],
        "submitted": "2026-01-28 17:48:58",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Dissecting Multimodal In-Context Learning: Modality Asymmetries and Circuit Dynamics in modern Transformers",
        "abstract": "Transformer-based multimodal large language models often exhibit in-context learning (ICL) abilities. Motivated by this phenomenon, we ask: how do transformers learn to associate information across modalities from in-context examples? We investigate this question through controlled experiments on small transformers trained on synthetic classification tasks, enabling precise manipulation of data statistics and model architecture. We begin by revisiting core principles of unimodal ICL in modern transformers. While several prior findings replicate, we find that Rotary Position Embeddings (RoPE) increases the data complexity threshold for ICL. Extending to the multimodal setting reveals a fundamental learning asymmetry: when pretrained on high-diversity data from a primary modality, surprisingly low data complexity in the secondary modality suffices for multimodal ICL to emerge. Mechanistic analysis shows that both settings rely on an induction-style mechanism that copies labels from matching in-context exemplars; multimodal training refines and extends these circuits across modalities. Our findings provide a mechanistic foundation for understanding multimodal ICL in modern transformers and introduce a controlled testbed for future investigation.",
        "url": "http://arxiv.org/abs/2601.20796v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20796v1",
        "arxiv_id": "2601.20796v1",
        "authors": [
            "Yiran Huang",
            "Karsten Roth",
            "Quentin Bouniot",
            "Wenjia Xu",
            "Zeynep Akata"
        ],
        "submitted": "2026-01-28 17:37:28",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Jurisdiction as Structural Barrier: How Privacy Policy Organization May Reduce Visibility of Substantive Disclosures",
        "abstract": "Privacy policies are supposed to provide notice. But what if substantive information appears only where users skip it? We identify a structural pattern we call jurisdiction-siloed disclosure: information about data practices appearing in specific, actionable form only within regional compliance sections labeled \"California Residents\" or \"EU/UK Users,\" while general sections use vague or qualified language for the same practices.\n  Our audit of 123 major companies identifies 282 potential instances across 77 companies (62.6% of this purposive sample). A conservative estimate restricted to practice categories validated against OPP-115 human annotations finds 138 instances across 54 companies (44%); post-2018 categories central to our findings await independent validation. If users skip jurisdiction-labeled sections as information foraging theory predicts, users outside regulated jurisdictions would receive less specific information about practices affecting them--a transparency failure operating through document architecture rather than omission.\n  We propose universal substantive disclosure: practices affecting all users should appear in the main policy body, with regional sections containing only procedural rights information. This standard finds support in analogous disclosure regimes (securities, truth-in-lending, nutritional labeling) where material information must reach all affected parties. Regulators could operationalize this through the FTC's \"clear and conspicuous\" standard and GDPR transparency principles.\n  This work is hypothesis-generating: we establish that the structural pattern exists and ground the transparency concern in behavioral theory, but direct measurement of jurisdiction-specific section skipping remains the critical validation priority. We release our methodology and annotated dataset to enable replication.",
        "url": "http://arxiv.org/abs/2601.20792v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20792v1",
        "arxiv_id": "2601.20792v1",
        "authors": [
            "Thomas Brackin"
        ],
        "submitted": "2026-01-28 17:29:59",
        "source": "arxiv",
        "comment": "25 pages, 2 figures, 5 tables"
    },
    {
        "title": "SERA: Soft-Verified Efficient Repository Agents",
        "abstract": "Open-weight coding agents should hold a fundamental advantage over closed-source systems: they can be specialized to private codebases, encoding repository-specific information directly in their weights. Yet the cost and complexity of training has kept this advantage theoretical. We show it is now practical. We present Soft-Verified Efficient Repository Agents (SERA), an efficient method for training coding agents that enables the rapid and cheap creation of agents specialized to private codebases. Using only supervised finetuning (SFT), SERA achieves state-of-the-art results among fully open-source (open data, method, code) models while matching the performance of frontier open-weight models like Devstral-Small-2. Creating SERA models is 26x cheaper than reinforcement learning and 57x cheaper than previous synthetic data methods to reach equivalent performance. Our method, Soft Verified Generation (SVG), generates thousands of trajectories from a single code repository. Combined with cost-efficiency, this enables specialization to private codebases. Beyond repository specialization, we apply SVG to a larger corpus of codebases, generating over 200,000 synthetic trajectories. We use this dataset to provide detailed analysis of scaling laws, ablations, and confounding factors for training coding agents. Overall, we believe our work will greatly accelerate research on open coding agents and showcase the advantage of open-source models that can specialize to private codebases. We release SERA as the first model in Ai2's Open Coding Agents series, along with all our code, data, and Claude Code integration to support the research community.",
        "url": "http://arxiv.org/abs/2601.20789v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20789v1",
        "arxiv_id": "2601.20789v1",
        "authors": [
            "Ethan Shen",
            "Danny Tormoen",
            "Saurabh Shah",
            "Ali Farhadi",
            "Tim Dettmers"
        ],
        "submitted": "2026-01-28 17:27:08",
        "source": "arxiv",
        "comment": "21 main pages, 7 pages appendix"
    },
    {
        "title": "Persona Prompting as a Lens on LLM Social Reasoning",
        "abstract": "For socially sensitive tasks like hate speech detection, the quality of explanations from Large Language Models (LLMs) is crucial for factors like user trust and model alignment. While Persona prompting (PP) is increasingly used as a way to steer model towards user-specific generation, its effect on model rationales remains underexplored. We investigate how LLM-generated rationales vary when conditioned on different simulated demographic personas. Using datasets annotated with word-level rationales, we measure agreement with human annotations from different demographic groups, and assess the impact of PP on model bias and human alignment. Our evaluation across three LLMs results reveals three key findings: (1) PP improving classification on the most subjective task (hate speech) but degrading rationale quality. (2) Simulated personas fail to align with their real-world demographic counterparts, and high inter-persona agreement shows models are resistant to significant steering. (3) Models exhibit consistent demographic biases and a strong tendency to over-flag content as harmful, regardless of PP. Our findings reveal a critical trade-off: while PP can improve classification in socially-sensitive tasks, it often comes at the cost of rationale quality and fails to mitigate underlying biases, urging caution in its application.",
        "url": "http://arxiv.org/abs/2601.20757v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20757v1",
        "arxiv_id": "2601.20757v1",
        "authors": [
            "Jing Yang",
            "Moritz Hechtbauer",
            "Elisabeth Khalilov",
            "Evelyn Luise Brinkmann",
            "Vera Schmitt",
            "Nils Feldhus"
        ],
        "submitted": "2026-01-28 16:41:17",
        "source": "arxiv",
        "comment": "9 Pages, EACL main"
    },
    {
        "title": "Like a Therapist, But Not: Reddit Narratives of AI in Mental Health Contexts",
        "abstract": "Large language models (LLMs) are increasingly used for emotional support and mental health-related interactions outside clinical settings, yet little is known about how people evaluate and relate to these systems in everyday use. We analyze 5,126 Reddit posts from 47 mental health communities describing experiential or exploratory use of AI for emotional support or therapy. Grounded in the Technology Acceptance Model and therapeutic alliance theory, we develop a theory-informed annotation framework and apply a hybrid LLM-human pipeline to analyze evaluative language, adoption-related attitudes, and relational alignment at scale. Our results show that engagement is shaped primarily by narrated outcomes, trust, and response quality, rather than emotional bond alone. Positive sentiment is most strongly associated with task and goal alignment, while companionship-oriented use more often involves misaligned alliances and reported risks such as dependence and symptom escalation. Overall, this work demonstrates how theory-grounded constructs can be operationalized in large-scale discourse analysis and highlights the importance of studying how users interpret language technologies in sensitive, real-world contexts.",
        "url": "http://arxiv.org/abs/2601.20747v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20747v1",
        "arxiv_id": "2601.20747v1",
        "authors": [
            "Elham Aghakhani",
            "Rezvaneh Rezapour"
        ],
        "submitted": "2026-01-28 16:23:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "QueerGen: How LLMs Reflect Societal Norms on Gender and Sexuality in Sentence Completion Tasks",
        "abstract": "This paper examines how Large Language Models (LLMs) reproduce societal norms, particularly heterocisnormativity, and how these norms translate into measurable biases in their text generations. We investigate whether explicit information about a subject's gender or sexuality influences LLM responses across three subject categories: queer-marked, non-queer-marked, and the normalized \"unmarked\" category. Representational imbalances are operationalized as measurable differences in English sentence completions across four dimensions: sentiment, regard, toxicity, and prediction diversity. Our findings show that Masked Language Models (MLMs) produce the least favorable sentiment, higher toxicity, and more negative regard for queer-marked subjects. Autoregressive Language Models (ARLMs) partially mitigate these patterns, while closed-access ARLMs tend to produce more harmful outputs for unmarked subjects. Results suggest that LLMs reproduce normative social assumptions, though the form and degree of bias depend strongly on specific model characteristics, which may redistribute, but not eliminate, representational harms.",
        "url": "http://arxiv.org/abs/2601.20731v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20731v1",
        "arxiv_id": "2601.20731v1",
        "authors": [
            "Mae Sosto",
            "Delfina Sol Martinez Pandiani",
            "Laura Hollink"
        ],
        "submitted": "2026-01-28 16:06:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "AgentLongBench: A Controllable Long Benchmark For Long-Contexts Agents via Environment Rollouts",
        "abstract": "The evolution of Large Language Models (LLMs) into autonomous agents necessitates the management of extensive, dynamic contexts. Current benchmarks, however, remain largely static, relying on passive retrieval tasks that fail to simulate the complexities of agent-environment interaction, such as non-linear reasoning and iterative feedback. To address this, we introduce \\textbf{AgentLongBench}, which evaluates agents through simulated environment rollouts based on Lateral Thinking Puzzles. This framework generates rigorous interaction trajectories across knowledge-intensive and knowledge-free scenarios. Experiments with state-of-the-art models and memory systems (32K to 4M tokens) expose a critical weakness: while adept at static retrieval, agents struggle with the dynamic information synthesis essential for workflows. Our analysis indicates that this degradation is driven by the minimum number of tokens required to resolve a query. This factor explains why the high information density inherent in massive tool responses poses a significantly greater challenge than the memory fragmentation typical of long-turn dialogues.",
        "url": "http://arxiv.org/abs/2601.20730v2",
        "pdf_url": "https://arxiv.org/pdf/2601.20730v2",
        "arxiv_id": "2601.20730v2",
        "authors": [
            "Shicheng Fang",
            "Yuxin Wang",
            "XiaoRan Liu",
            "Jiahao Lu",
            "Chuanyuan Tan",
            "Xinchi Chen",
            "Yining Zheng",
            "Xuanjing Huang",
            "Xipeng Qiu"
        ],
        "submitted": "2026-01-28 16:05:44",
        "source": "arxiv",
        "comment": "26 pages"
    },
    {
        "title": "MedViz: An Agent-based, Visual-guided Research Assistant for Navigating Biomedical Literature",
        "abstract": "Biomedical researchers face increasing challenges in navigating millions of publications in diverse domains. Traditional search engines typically return articles as ranked text lists, offering little support for global exploration or in-depth analysis. Although recent advances in generative AI and large language models have shown promise in tasks such as summarization, extraction, and question answering, their dialog-based implementations are poorly integrated with literature search workflows. To address this gap, we introduce MedViz, a visual analytics system that integrates multiple AI agents with interactive visualization to support the exploration of the large-scale biomedical literature. MedViz combines a semantic map of millions of articles with agent-driven functions for querying, summarizing, and hypothesis generation, allowing researchers to iteratively refine questions, identify trends, and uncover hidden connections. By bridging intelligent agents with interactive visualization, MedViz transforms biomedical literature search into a dynamic, exploratory process that accelerates knowledge discovery.",
        "url": "http://arxiv.org/abs/2601.20709v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20709v1",
        "arxiv_id": "2601.20709v1",
        "authors": [
            "Huan He",
            "Xueqing Peng",
            "Yutong Xie",
            "Qijia Liu",
            "Chia-Hsuan Chang",
            "Lingfei Qian",
            "Brian Ondov",
            "Qiaozhu Mei",
            "Hua Xu"
        ],
        "submitted": "2026-01-28 15:41:07",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Polite But Boring? Trade-offs Between Engagement and Psychological Reactance to Chatbot Feedback Styles",
        "abstract": "As conversational agents become increasingly common in behaviour change interventions, understanding optimal feedback delivery mechanisms becomes increasingly important. However, choosing a style that both lessens psychological reactance (perceived threats to freedom) while simultaneously eliciting feelings of surprise and engagement represents a complex design problem. We explored how three different feedback styles: 'Direct', 'Politeness', and 'Verbal Leakage' (slips or disfluencies to reveal a desired behaviour) affect user perceptions and behavioural intentions. Matching expectations from literature, the 'Direct' chatbot led to lower behavioural intentions and higher reactance, while the 'Politeness' chatbot evoked higher behavioural intentions and lower reactance. However, 'Politeness' was also seen as unsurprising and unengaging by participants. In contrast, 'Verbal Leakage' evoked reactance, yet also elicited higher feelings of surprise, engagement, and humour. These findings highlight that effective feedback requires navigating trade-offs between user reactance and engagement, with novel approaches such as 'Verbal Leakage' offering promising alternative design opportunities.",
        "url": "http://arxiv.org/abs/2601.20683v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20683v1",
        "arxiv_id": "2601.20683v1",
        "authors": [
            "Samuel Rhys Cox",
            "Joel Wester",
            "Niels van Berkel"
        ],
        "submitted": "2026-01-28 15:10:59",
        "source": "arxiv",
        "comment": "To appear at ACM CHI 2026. 21 pages, 7 figures, 5 tables"
    },
    {
        "title": "Online Density-Based Clustering for Real-Time Narrative Evolution Monitorin",
        "abstract": "Automated narrative intelligence systems for social media monitoring face significant scalability challenges when processing continuous data streams using traditional batch clustering algorithms. We investigate the replacement of HDBSCAN (offline clustering) with online (streaming/incremental) clustering methods in a production narrative report generation pipeline. The proposed system employs a three-stage architecture (data collection, modeling, dashboard generation) that processes thousands of multilingual social media documents daily. While HDBSCAN excels at discovering hierarchical density-based clusters and handling noise, its batch-only nature necessitates complete retraining for each time window, resulting in memory constraints, computational inefficiency, and inability to adapt to evolving narratives in real-time. This work evaluates a bunch of online clustering algorithms across dimensions of cluster quality preservation, computational efficiency, memory footprint, and integration compatibility with existing workflows. We propose evaluation criteria that balance traditional clustering metrics (Silhouette Coefficient, Davies-Bouldin Index) with narrative metrics (narrative distinctness, contingency and variance). Our methodology includes sliding-window simulations on historical datasets from Ukraine information space, enabling comparative analysis of algorithmic trade-offs in realistic operational contexts. This research addresses a critical gap between batch-oriented topic modeling frameworks and the streaming nature of social media monitoring, with implications for computational social science, crisis informatics, and narrative surveillance systems.",
        "url": "http://arxiv.org/abs/2601.20680v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20680v1",
        "arxiv_id": "2601.20680v1",
        "authors": [
            "Ostap Vykhopen",
            "Viktoria Skorik",
            "Maxim Tereschenko",
            "Veronika Solopova"
        ],
        "submitted": "2026-01-28 15:07:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "ShieldedCode: Learning Robust Representations for Virtual Machine Protected Code",
        "abstract": "Large language models (LLMs) have achieved remarkable progress in code generation, yet their potential for software protection remains largely untapped. Reverse engineering continues to threaten software security, while traditional virtual machine protection (VMP) relies on rigid, rule-based transformations that are costly to design and vulnerable to automated analysis. In this work, we present the first protection-aware framework that learns robust representations of VMP-protected code. Our approach builds large-scale paired datasets of source code and normalized VM implementations, and introduces hierarchical dependency modeling at intra-, preceding-, and inter-instruction levels. We jointly optimize language modeling with functionality-aware and protection-aware contrastive objectives to capture both semantic equivalence and protection strength. To further assess resilience, we propose a protection effectiveness optimization task that quantifies and ranks different VM variants derived from the same source. Coupled with a two-stage continual pre-training and fine-tuning pipeline, our method enables models to generate, compare, and reason over protected code. Extensive experiments show that our framework significantly improves robustness across diverse protection levels, opening a new research direction for learning-based software defense. In this work, we present ShieldedCode, the first protection-aware framework that learns robust representations of VMP-protected code. Our method achieves 26.95% Pass@1 on L0 VM code generation compared to 22.58% for GPT-4o., and improves binary similarity detection Recall@1 by 10% over state of art methods like jTrans.",
        "url": "http://arxiv.org/abs/2601.20679v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20679v1",
        "arxiv_id": "2601.20679v1",
        "authors": [
            "Mingqiao Mo",
            "Yunlong Tan",
            "Hao Zhang",
            "Heng Zhang",
            "Yangfan He"
        ],
        "submitted": "2026-01-28 15:07:08",
        "source": "arxiv",
        "comment": "Accepted to ICLR 2026"
    },
    {
        "title": "Efficient Multimodal Planning Agent for Visual Question-Answering",
        "abstract": "Visual Question-Answering (VQA) is a challenging multimodal task that requires integrating visual and textual information to generate accurate responses. While multimodal Retrieval-Augmented Generation (mRAG) has shown promise in enhancing VQA systems by providing more evidence on both image and text sides, the default procedure that addresses VQA queries, especially the knowledge-intensive ones, often relies on multi-stage pipelines of mRAG with inherent dependencies. To mitigate the inefficiency limitations while maintaining VQA task performance, this paper proposes a method that trains a multimodal planning agent, dynamically decomposing the mRAG pipeline to solve the VQA task. Our method optimizes the trade-off between efficiency and effectiveness by training the agent to intelligently determine the necessity of each mRAG step. In our experiments, the agent can help reduce redundant computations, cutting search time by over 60\\% compared to existing methods and decreasing costly tool calls. Meanwhile, experiments demonstrate that our method outperforms all baselines, including a Deep Research agent and a carefully designed prompt-based method, on average over six various datasets. Code will be released.",
        "url": "http://arxiv.org/abs/2601.20676v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20676v1",
        "arxiv_id": "2601.20676v1",
        "authors": [
            "Zhuo Chen",
            "Xinyu Geng",
            "Xinyu Wang",
            "Yong Jiang",
            "Zhen Zhang",
            "Pengjun Xie",
            "Kewei Tu"
        ],
        "submitted": "2026-01-28 14:58:59",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Harnessing Large Language Models for Precision Querying and Retrieval-Augmented Knowledge Extraction in Clinical Data Science",
        "abstract": "This study applies Large Language Models (LLMs) to two foundational Electronic Health Record (EHR) data science tasks: structured data querying (using programmatic languages, Python/Pandas) and information extraction from unstructured clinical text via a Retrieval Augmented Generation (RAG) pipeline. We test the ability of LLMs to interact accurately with large structured datasets for analytics and the reliability of LLMs in extracting semantically correct information from free text health records when supported by RAG. To this end, we presented a flexible evaluation framework that automatically generates synthetic question and answer pairs tailored to the characteristics of each dataset or task. Experiments were conducted on a curated subset of MIMIC III, (four structured tables and one clinical note type), using a mix of locally hosted and API-based LLMs. Evaluation combined exact-match metrics, semantic similarity, and human judgment. Our findings demonstrate the potential of LLMs to support precise querying and accurate information extraction in clinical workflows.",
        "url": "http://arxiv.org/abs/2601.20674v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20674v1",
        "arxiv_id": "2601.20674v1",
        "authors": [
            "Juan Jose Rubio Jan",
            "Jack Wu",
            "Julia Ive"
        ],
        "submitted": "2026-01-28 14:57:36",
        "source": "arxiv",
        "comment": "11 pages, 5 figures"
    },
    {
        "title": "Overview of the TREC 2025 Tip-of-the-Tongue track",
        "abstract": "Tip-of-the-tongue (ToT) known-item retrieval involves re-finding an item for which the searcher does not reliably recall an identifier. ToT information requests (or queries) are verbose and tend to include several complex phenomena, making them especially difficult for existing information retrieval systems. The TREC 2025 ToT track focused on a single ad-hoc retrieval task. This year, we extended the track to general domain and incorporated different sets of test queries from diverse sources, namely from the MS-ToT dataset, manual topic development, and LLM-based synthetic query generation. This year, 9 groups (including the track coordinators) submitted 32 runs.",
        "url": "http://arxiv.org/abs/2601.20671v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20671v1",
        "arxiv_id": "2601.20671v1",
        "authors": [
            "Jaime Arguello",
            "Fernando Diaz",
            "Maik Fröebe",
            "To Eun Kim",
            "Bhaskar Mitra"
        ],
        "submitted": "2026-01-28 14:51:52",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "A Dialectic Pipeline for Improving LLM Robustness",
        "abstract": "Assessing ways in which Language Models can reduce their hallucinations and improve the outputs' quality is crucial to ensure their large-scale use.\n  However, methods such as fine-tuning on domain-specific data or the training of a separate \\textit{ad hoc} verifier require demanding computational resources (not feasible for many user applications) and constrain the models to specific fields of knowledge.\n  In this thesis, we propose a dialectic pipeline that preserves LLMs' generalization abilities while improving the quality of its answer via self-dialogue, enabling it to reflect upon and correct tentative wrong answers.\n  We experimented with different pipeline settings, testing our proposed method on different datasets and on different families of models. All the pipeline stages are enriched with the relevant context (in an oracle-RAG setting) and a study on the impact of its summarization or its filtering is conducted.\n  We find that our proposed dialectic pipeline is able to outperform by significative margins the standard model answers and that it consistently achieves higher performances than Chain-of-Thought only prompting.",
        "url": "http://arxiv.org/abs/2601.20659v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20659v1",
        "arxiv_id": "2601.20659v1",
        "authors": [
            "Sara Candussio"
        ],
        "submitted": "2026-01-28 14:42:49",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "P2S: Probabilistic Process Supervision for General-Domain Reasoning Question Answering",
        "abstract": "While reinforcement learning with verifiable rewards (RLVR) has advanced LLM reasoning in structured domains like mathematics and programming, its application to general-domain reasoning tasks remains challenging due to the absence of verifiable reward signals. To this end, methods like Reinforcement Learning with Reference Probability Reward (RLPR) have emerged, leveraging the probability of generating the final answer as a reward signal. However, these outcome-focused approaches neglect crucial step-by-step supervision of the reasoning process itself. To address this gap, we introduce Probabilistic Process Supervision (P2S), a novel self-supervision framework that provides fine-grained process rewards without requiring a separate reward model or human-annotated reasoning steps. During reinforcement learning, P2S synthesizes and filters a high-quality reference reasoning chain (gold-CoT). The core of our method is to calculate a Path Faithfulness Reward (PFR) for each reasoning step, which is derived from the conditional probability of generating the gold-CoT's suffix, given the model's current reasoning prefix. Crucially, this PFR can be flexibly integrated with any outcome-based reward, directly tackling the reward sparsity problem by providing dense guidance. Extensive experiments on reading comprehension and medical Question Answering benchmarks show that P2S significantly outperforms strong baselines.",
        "url": "http://arxiv.org/abs/2601.20649v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20649v1",
        "arxiv_id": "2601.20649v1",
        "authors": [
            "Wenlin Zhong",
            "Chengyuan Liu",
            "Yiquan Wu",
            "Bovin Tan",
            "Changlong Sun",
            "Yi Wang",
            "Xiaozhong Liu",
            "Kun Kuang"
        ],
        "submitted": "2026-01-28 14:35:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "TGSBM: Transformer-Guided Stochastic Block Model for Link Prediction",
        "abstract": "Link prediction is a cornerstone of the Web ecosystem, powering applications from recommendation and search to knowledge graph completion and collaboration forecasting. However, large-scale networks present unique challenges: they contain hundreds of thousands of nodes and edges with heterogeneous and overlapping community structures that evolve over time. Existing approaches face notable limitations: traditional graph neural networks struggle to capture global structural dependencies, while recent graph transformers achieve strong performance but incur quadratic complexity and lack interpretable latent structure. We propose \\textbf{TGSBM} (Transformer-Guided Stochastic Block Model), a framework that integrates the principled generative structure of Overlapping Stochastic Block Models with the representational power of sparse Graph Transformers. TGSBM comprises three main components: (i) \\emph{expander-augmented sparse attention} that enables near-linear complexity and efficient global mixing, (ii) a \\emph{neural variational encoder} that infers structured posteriors over community memberships and strengths, and (iii) a \\emph{neural edge decoder} that reconstructs links via OSBM's generative process, preserving interpretability. Experiments across diverse benchmarks demonstrate competitive performance (mean rank 1.6 under HeaRT protocol), superior scalability (up to $6\\times$ faster training), and interpretable community structures. These results position TGSBM as a practical approach that strikes a balance between accuracy, efficiency, and transparency for large-scale link prediction.",
        "url": "http://arxiv.org/abs/2601.20646v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20646v1",
        "arxiv_id": "2601.20646v1",
        "authors": [
            "Zhejian Yang",
            "Songwei Zhao",
            "Zilin Zhao",
            "Hechang Chen"
        ],
        "submitted": "2026-01-28 14:32:24",
        "source": "arxiv",
        "comment": "12 pages, 4 figures"
    },
    {
        "title": "When Vision Meets Texts in Listwise Reranking",
        "abstract": "Recent advancements in information retrieval have highlighted the potential of integrating visual and textual information, yet effective reranking for image-text documents remains challenging due to the modality gap and scarcity of aligned datasets. Meanwhile, existing approaches often rely on large models (7B to 32B parameters) with reasoning-based distillation, incurring unnecessary computational overhead while primarily focusing on textual modalities. In this paper, we propose Rank-Nexus, a multimodal image-text document reranker that performs listwise qualitative reranking on retrieved lists incorporating both images and texts. To bridge the modality gap, we introduce a progressive cross-modal training strategy. We first train modalities separately: leveraging abundant text reranking data, we distill knowledge into the text branch. For images, where data is scarce, we construct distilled pairs from multimodal large language model (MLLM) captions on image retrieval benchmarks. Subsequently, we distill a joint image-text reranking dataset. Rank-Nexus achieves outstanding performance on text reranking benchmarks (TREC, BEIR) and the challenging image reranking benchmark (INQUIRE, MMDocIR), using only a lightweight 2B pretrained visual-language model. This efficient design ensures strong generalization across diverse multimodal scenarios without excessive parameters or reasoning overhead.",
        "url": "http://arxiv.org/abs/2601.20623v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20623v1",
        "arxiv_id": "2601.20623v1",
        "authors": [
            "Hongyi Cai"
        ],
        "submitted": "2026-01-28 13:57:14",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "GDCNet: Generative Discrepancy Comparison Network for Multimodal Sarcasm Detection",
        "abstract": "Multimodal sarcasm detection (MSD) aims to identify sarcasm within image-text pairs by modeling semantic incongruities across modalities. Existing methods often exploit cross-modal embedding misalignment to detect inconsistency but struggle when visual and textual content are loosely related or semantically indirect. While recent approaches leverage large language models (LLMs) to generate sarcastic cues, the inherent diversity and subjectivity of these generations often introduce noise. To address these limitations, we propose the Generative Discrepancy Comparison Network (GDCNet). This framework captures cross-modal conflicts by utilizing descriptive, factually grounded image captions generated by Multimodal LLMs (MLLMs) as stable semantic anchors. Specifically, GDCNet computes semantic and sentiment discrepancies between the generated objective description and the original text, alongside measuring visual-textual fidelity. These discrepancy features are then fused with visual and textual representations via a gated module to adaptively balance modality contributions. Extensive experiments on MSD benchmarks demonstrate GDCNet's superior accuracy and robustness, establishing a new state-of-the-art on the MMSD2.0 benchmark.",
        "url": "http://arxiv.org/abs/2601.20618v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20618v1",
        "arxiv_id": "2601.20618v1",
        "authors": [
            "Shuguang Zhang",
            "Junhong Lian",
            "Guoxin Yu",
            "Baoxun Xu",
            "Xiang Ao"
        ],
        "submitted": "2026-01-28 13:51:34",
        "source": "arxiv",
        "comment": "Accepted to 2026 IEEE International Conference on Acoustics, Speech, and Signal Processing (ICASSP 2026)"
    },
    {
        "title": "Harder Is Better: Boosting Mathematical Reasoning via Difficulty-Aware GRPO and Multi-Aspect Question Reformulation",
        "abstract": "Reinforcement Learning with Verifiable Rewards (RLVR) offers a robust mechanism for enhancing mathematical reasoning in large models. However, we identify a systematic lack of emphasis on more challenging questions in existing methods from both algorithmic and data perspectives, despite their importance for refining underdeveloped capabilities. Algorithmically, widely used Group Relative Policy Optimization (GRPO) suffers from an implicit imbalance where the magnitude of policy updates is lower for harder questions. Data-wise, augmentation approaches primarily rephrase questions to enhance diversity without systematically increasing intrinsic difficulty. To address these issues, we propose a two-dual MathForge framework to improve mathematical reasoning by targeting harder questions from both perspectives, which comprises a Difficulty-Aware Group Policy Optimization (DGPO) algorithm and a Multi-Aspect Question Reformulation (MQR) strategy. Specifically, DGPO first rectifies the implicit imbalance in GRPO via difficulty-balanced group advantage estimation, and further prioritizes harder questions by difficulty-aware question-level weighting. Meanwhile, MQR reformulates questions across multiple aspects to increase difficulty while maintaining the original gold answer. Overall, MathForge forms a synergistic loop: MQR expands the data frontier, and DGPO effectively learns from the augmented data. Extensive experiments show that MathForge significantly outperforms existing methods on various mathematical reasoning tasks. The code and augmented data are all available at https://github.com/AMAP-ML/MathForge.",
        "url": "http://arxiv.org/abs/2601.20614v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20614v1",
        "arxiv_id": "2601.20614v1",
        "authors": [
            "Yanqi Dai",
            "Yuxiang Ji",
            "Xiao Zhang",
            "Yong Wang",
            "Xiangxiang Chu",
            "Zhiwu Lu"
        ],
        "submitted": "2026-01-28 13:49:23",
        "source": "arxiv",
        "comment": "Accepted for ICLR 2026"
    },
    {
        "title": "AgentIF-OneDay: A Task-level Instruction-Following Benchmark for General AI Agents in Daily Scenarios",
        "abstract": "The capacity of AI agents to effectively handle tasks of increasing duration and complexity continues to grow, demonstrating exceptional performance in coding, deep research, and complex problem-solving evaluations. However, in daily scenarios, the perception of these advanced AI capabilities among general users remains limited. We argue that current evaluations prioritize increasing task difficulty without sufficiently addressing the diversity of agentic tasks necessary to cover the daily work, life, and learning activities of a broad demographic. To address this, we propose AgentIF-OneDay, aimed at determining whether general users can utilize natural language instructions and AI agents to complete a diverse array of daily tasks. These tasks require not only solving problems through dialogue but also understanding various attachment types and delivering tangible file-based results. The benchmark is structured around three user-centric categories: Open Workflow Execution, which assesses adherence to explicit and complex workflows; Latent Instruction, which requires agents to infer implicit instructions from attachments; and Iterative Refinement, which involves modifying or expanding upon ongoing work. We employ instance-level rubrics and a refined evaluation pipeline that aligns LLM-based verification with human judgment, achieving an 80.1% agreement rate using Gemini-3-Pro. AgentIF-OneDay comprises 104 tasks covering 767 scoring points. We benchmarked four leading general AI agents and found that agent products built based on APIs and ChatGPT agents based on agent RL remain in the first tier simultaneously. Leading LLM APIs and open-source models have internalized agentic capabilities, enabling AI application teams to develop cutting-edge Agent products.",
        "url": "http://arxiv.org/abs/2601.20613v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20613v1",
        "arxiv_id": "2601.20613v1",
        "authors": [
            "Kaiyuan Chen",
            "Qimin Wu",
            "Taiyu Hou",
            "Tianhao Tang",
            "Xueyu Hu",
            "Yuchen Hou",
            "Bikun Li",
            "Chengming Qian",
            "Guoyin Wang",
            "Haolin Chen",
            "Haotong Tian",
            "Haoye Zhang",
            "Haoyu Bian",
            "Hongbing Pan",
            "Hongkang Zhang",
            "Hongyi Zhou",
            "Jiaqi Cai",
            "Jiewu Rao",
            "Jiyuan Ren",
            "Keduan Huang",
            "Lucia Zhu Huang",
            "Mingyu Yuan",
            "Naixu Guo",
            "Qicheng Tang",
            "Qinyan Zhang",
            "Shuai Chen",
            "Siheng Chen",
            "Ting Ting Li",
            "Xiaoxing Guo",
            "Yaocheng Zuo",
            "Yaoqi Guo",
            "Yinan Wang",
            "Yinzhou Yu",
            "Yize Wang",
            "Yuan Jiang",
            "Yuan Tian",
            "Yuanshuo Zhang",
            "Yuxuan Liu",
            "Yvette Yan Zeng",
            "Zenyu Shan",
            "Zihan Yin",
            "Xiaobo Hu",
            "Yang Liu",
            "Yixin Ren",
            "Yuan Gong"
        ],
        "submitted": "2026-01-28 13:49:18",
        "source": "arxiv",
        "comment": "17 pages, 8 figures"
    },
    {
        "title": "A Computational Approach to Language Contact -- A Case Study of Persian",
        "abstract": "We investigate structural traces of language contact in the intermediate representations of a monolingual language model. Focusing on Persian (Farsi) as a historically contact-rich language, we probe the representations of a Persian-trained model when exposed to languages with varying degrees and types of contact with Persian. Our methodology quantifies the amount of linguistic information encoded in intermediate representations and assesses how this information is distributed across model components for different morphosyntactic features. The results show that universal syntactic information is largely insensitive to historical contact, whereas morphological features such as Case and Gender are strongly shaped by language-specific structure, suggesting that contact effects in monolingual language models are selective and structurally constrained.",
        "url": "http://arxiv.org/abs/2601.20592v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20592v1",
        "arxiv_id": "2601.20592v1",
        "authors": [
            "Ali Basirat",
            "Danial Namazifard",
            "Navid Baradaran Hemmati"
        ],
        "submitted": "2026-01-28 13:27:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Single-Nodal Spontaneous Symmetry Breaking in NLP Models",
        "abstract": "Spontaneous symmetry breaking in statistical mechanics primarily occurs during phase transitions at the thermodynamic limit where the Hamiltonian preserves inversion symmetry, yet the low-temperature free energy exhibits reduced symmetry. Herein, we demonstrate the emergence of spontaneous symmetry breaking in natural language processing (NLP) models during both pre-training and fine-tuning, even under deterministic dynamics and within a finite training architecture. This phenomenon occurs at the level of individual attention heads and is scaled-down to its small subset of nodes and also valid at a single-nodal level, where nodes acquire the capacity to learn a limited set of tokens after pre-training or labels after fine-tuning for a specific classification task. As the number of nodes increases, a crossover in learning ability occurs, governed by the tradeoff between a decrease following random-guess among increased possible outputs, and enhancement following nodal cooperation, which exceeds the sum of individual nodal capabilities. In contrast to spin-glass systems, where a microscopic state of frozen spins cannot be directly linked to the free-energy minimization goal, each nodal function in this framework contributes explicitly to the global network task and can be upper-bounded using convex hull analysis. Results are demonstrated using BERT-6 architecture pre-trained on Wikipedia dataset and fine-tuned on the FewRel classification task.",
        "url": "http://arxiv.org/abs/2601.20582v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20582v1",
        "arxiv_id": "2601.20582v1",
        "authors": [
            "Shalom Rosner",
            "Ronit D. Gross",
            "Ella Koresh",
            "Ido Kanter"
        ],
        "submitted": "2026-01-28 13:20:02",
        "source": "arxiv",
        "comment": "23 pages, 6 figures, 1 table"
    },
    {
        "title": "Beyond Divergent Creativity: A Human-Based Evaluation of Creativity in Large Language Models",
        "abstract": "Large language models (LLMs) are increasingly used in verbal creative tasks. However, previous assessments of the creative capabilities of LLMs remain weakly grounded in human creativity theory and are thus hard to interpret. The widely used Divergent Association Task (DAT) focuses on novelty, ignoring appropriateness, a core component of creativity. We evaluate a range of state-of-the-art LLMs on DAT and show that their scores on the task are lower than those of two baselines that do not possess any creative abilities, undermining its validity for model evaluation. Grounded in human creativity theory, which defines creativity as the combination of novelty and appropriateness, we introduce Conditional Divergent Association Task (CDAT). CDAT evaluates novelty conditional on contextual appropriateness, separating noise from creativity better than DAT, while remaining simple and objective. Under CDAT, smaller model families often show the most creativity, whereas advanced families favor appropriateness at lower novelty. We hypothesize that training and alignment likely shift models along this frontier, making outputs more appropriate but less creative. We release the dataset and code.",
        "url": "http://arxiv.org/abs/2601.20546v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20546v1",
        "arxiv_id": "2601.20546v1",
        "authors": [
            "Kumiko Nakajima",
            "Jan Zuiderveld",
            "Sandro Pezzelle"
        ],
        "submitted": "2026-01-28 12:41:32",
        "source": "arxiv",
        "comment": "Accepted to Findings of EACL 2026"
    },
    {
        "title": "PathWise: Planning through World Model for Automated Heuristic Design via Self-Evolving LLMs",
        "abstract": "Large Language Models (LLMs) have enabled automated heuristic design (AHD) for combinatorial optimization problems (COPs), but existing frameworks' reliance on fixed evolutionary rules and static prompt templates often leads to myopic heuristic generation, redundant evaluations, and limited reasoning about how new heuristics should be derived. We propose a novel multi-agent reasoning framework, referred to as Planning through World Model for Automated Heuristic Design via Self-Evolving LLMs (PathWise), which formulates heuristic generation as a sequential decision process over an entailment graph serving as a compact, stateful memory of the search trajectory. This approach allows the system to carry forward past decisions and reuse or avoid derivation information across generations. A policy agent plans evolutionary actions, a world model agent generates heuristic rollouts conditioned on those actions, and critic agents provide routed reflections summarizing lessons from prior steps, shifting LLM-based AHD from trial-and-error evolution toward state-aware planning through reasoning. Experiments across diverse COPs show that PathWise converges faster to better heuristics, generalizes across different LLM backbones, and scales to larger problem sizes.",
        "url": "http://arxiv.org/abs/2601.20539v2",
        "pdf_url": "https://arxiv.org/pdf/2601.20539v2",
        "arxiv_id": "2601.20539v2",
        "authors": [
            "Oguzhan Gungordu",
            "Siheng Xiong",
            "Faramarz Fekri"
        ],
        "submitted": "2026-01-28 12:34:50",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "On Every Note a Griff: Looking for a Useful Representation of Basso Continuo Performance Style",
        "abstract": "Basso continuo is a baroque improvisatory accompaniment style which involves improvising multiple parts above a given bass line in a musical score on a harpsichord or organ. Basso continuo is not merely a matter of history; moreover, it is a historically inspired living practice, and The Aligned Continuo Dataset (ACoRD) records the first sample of modern-day basso continuo playing in the symbolic domain. This dataset, containing 175 MIDI recordings of 5 basso continuo scores performed by 7 players, allows us to start observing and analyzing the variety that basso continuo improvisation brings. A recently proposed basso continuo performance-to-score alignment system provides a way of mapping improvised performance notes to score notes. In order to study aligned basso continuo performances, we need an appropriate feature representation. We propose griff, a representation inspired by historical basso continuo treatises. It enables us to encode both pitch content and structure of a basso continuo realization in a transposition-invariant way. Griffs are directly extracted from aligned basso continuo performances by grouping together performance notes aligned to the same score note in a onset-time ordered way, and they provide meaningful tokens that form a feature space in which we can analyze basso continuo performance styles. We statistically describe griffs extracted from the ACoRD dataset recordings, and show in two experiments how griffs can be used for statistical analysis of individuality of different players' basso continuo performance styles. We finally present an argument why it is desirable to preserve the structure of a basso continuo improvisation in order to conduct a refined analysis of personal performance styles of individual basso continuo practitioners, and why griffs can provide a meaningful historically informed feature space worthy of a more robust empirical validation.",
        "url": "http://arxiv.org/abs/2601.20478v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20478v1",
        "arxiv_id": "2601.20478v1",
        "authors": [
            "Adam Štefunko",
            "Carlos Eduardo Cancino-Chacón",
            "Jan Hajič"
        ],
        "submitted": "2026-01-28 10:47:42",
        "source": "arxiv",
        "comment": "6 pages, 5 figures, accepted to the Music Encoding Conference (MEC) 2026"
    },
    {
        "title": "Can We Improve Educational Diagram Generation with In-Context Examples? Not if a Hallucination Spoils the Bunch",
        "abstract": "Generative artificial intelligence (AI) has found a widespread use in computing education; at the same time, quality of generated materials raises concerns among educators and students. This study addresses this issue by introducing a novel method for diagram code generation with in-context examples based on the Rhetorical Structure Theory (RST), which aims to improve diagram generation by aligning models' output with user expectations. Our approach is evaluated by computer science educators, who assessed 150 diagrams generated with large language models (LLMs) for logical organization, connectivity, layout aesthetic, and AI hallucination. The assessment dataset is additionally investigated for its utility in automated diagram evaluation. The preliminary results suggest that our method decreases the rate of factual hallucination and improves diagram faithfulness to provided context; however, due to LLMs' stochasticity, the quality of the generated diagrams varies. Additionally, we present an in-depth analysis and discussion on the connection between AI hallucination and the quality of generated diagrams, which reveals that text contexts of higher complexity lead to higher rates of hallucination and LLMs often fail to detect mistakes in their output.",
        "url": "http://arxiv.org/abs/2601.20476v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20476v1",
        "arxiv_id": "2601.20476v1",
        "authors": [
            "Evanfiya Logacheva",
            "Arto Hellas",
            "Tsvetomila Mihaylova",
            "Juha Sorva",
            "Ava Heinonen",
            "Juho Leinonen"
        ],
        "submitted": "2026-01-28 10:45:28",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CtrlCoT: Dual-Granularity Chain-of-Thought Compression for Controllable Reasoning",
        "abstract": "Chain-of-thought (CoT) prompting improves LLM reasoning but incurs high latency and memory cost due to verbose traces, motivating CoT compression with preserved correctness. Existing methods either shorten CoTs at the semantic level, which is often conservative, or prune tokens aggressively, which can miss task-critical cues and degrade accuracy. Moreover, combining the two is non-trivial due to sequential dependency, task-agnostic pruning, and distribution mismatch. We propose \\textbf{CtrlCoT}, a dual-granularity CoT compression framework that harmonizes semantic abstraction and token-level pruning through three components: Hierarchical Reasoning Abstraction produces CoTs at multiple semantic granularities; Logic-Preserving Distillation trains a logic-aware pruner to retain indispensable reasoning cues (e.g., numbers and operators) across pruning ratios; and Distribution-Alignment Generation aligns compressed traces with fluent inference-time reasoning styles to avoid fragmentation. On MATH-500 with Qwen2.5-7B-Instruct, CtrlCoT uses 30.7\\% fewer tokens while achieving 7.6 percentage points higher than the strongest baseline, demonstrating more efficient and reliable reasoning. Our code will be publicly available at https://github.com/fanzhenxuan/Ctrl-CoT.",
        "url": "http://arxiv.org/abs/2601.20467v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20467v1",
        "arxiv_id": "2601.20467v1",
        "authors": [
            "Zhenxuan Fan",
            "Jie Cao",
            "Yang Dai",
            "Zheqi Lv",
            "Wenqiao Zhang",
            "Zhongle Xie",
            "Peng LU",
            "Beng Chin Ooi"
        ],
        "submitted": "2026-01-28 10:38:49",
        "source": "arxiv",
        "comment": "16 pages, 9 figures, 11 tables"
    },
    {
        "title": "BMAM: Brain-inspired Multi-Agent Memory Framework",
        "abstract": "Language-model-based agents operating over extended interaction horizons face persistent challenges in preserving temporally grounded information and maintaining behavioral consistency across sessions, a failure mode we term soul erosion. We present BMAM (Brain-inspired Multi-Agent Memory), a general-purpose memory architecture that models agent memory as a set of functionally specialized subsystems rather than a single unstructured store. Inspired by cognitive memory systems, BMAM decomposes memory into episodic, semantic, salience-aware, and control-oriented components that operate at complementary time scales. To support long-horizon reasoning, BMAM organizes episodic memories along explicit timelines and retrieves evidence by fusing multiple complementary signals. Experiments on the LoCoMo benchmark show that BMAM achieves 78.45 percent accuracy under the standard long-horizon evaluation setting, and ablation analyses confirm that the hippocampus-inspired episodic memory subsystem plays a critical role in temporal reasoning.",
        "url": "http://arxiv.org/abs/2601.20465v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20465v1",
        "arxiv_id": "2601.20465v1",
        "authors": [
            "Yang Li",
            "Jiaxiang Liu",
            "Yusong Wang",
            "Yujie Wu",
            "Mingkun Xu"
        ],
        "submitted": "2026-01-28 10:36:03",
        "source": "arxiv",
        "comment": "Submitted to ACL (ARR 2026 January submission); non-anonymous preprint"
    },
    {
        "title": "MuVaC: AVariational Causal Framework for Multimodal Sarcasm Understanding in Dialogues",
        "abstract": "The prevalence of sarcasm in multimodal dialogues on the social platforms presents a crucial yet challenging task for understanding the true intent behind online content. Comprehensive sarcasm analysis requires two key aspects: Multimodal Sarcasm Detection (MSD) and Multimodal Sarcasm Explanation (MuSE). Intuitively, the act of detection is the result of the reasoning process that explains the sarcasm. Current research predominantly focuses on addressing either MSD or MuSE as a single task. Even though some recent work has attempted to integrate these tasks, their inherent causal dependency is often overlooked. To bridge this gap, we propose MuVaC, a variational causal inference framework that mimics human cognitive mechanisms for understanding sarcasm, enabling robust multimodal feature learning to jointly optimize MSD and MuSE. Specifically, we first model MSD and MuSE from the perspective of structural causal models, establishing variational causal pathways to define the objectives for joint optimization. Next, we design an alignment-then-fusion approach to integrate multimodal features, providing robust fusion representations for sarcasm detection and explanation generation. Finally, we enhance the reasoning trustworthiness by ensuring consistency between detection results and explanations. Experimental results demonstrate the superiority of MuVaC in public datasets, offering a new perspective for understanding multimodal sarcasm.",
        "url": "http://arxiv.org/abs/2601.20451v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20451v1",
        "arxiv_id": "2601.20451v1",
        "authors": [
            "Diandian Guo",
            "Fangfang Yuan",
            "Cong Cao",
            "Xixun Lin",
            "Chuan Zhou",
            "Hao Peng",
            "Yanan Cao",
            "Yanbing Liu"
        ],
        "submitted": "2026-01-28 10:19:42",
        "source": "arxiv",
        "comment": "12 pages, 7 figures. Accepted by WWW 2026"
    },
    {
        "title": "Text-only adaptation in LLM-based ASR through text denoising",
        "abstract": "Adapting automatic speech recognition (ASR) systems based on large language models (LLMs) to new domains using text-only data is a significant yet underexplored challenge. Standard fine-tuning of the LLM on target-domain text often disrupts the critical alignment between speech and text modalities learned by the projector, degrading performance. We introduce a novel text-only adaptation method that emulates the audio projection task by treating it as a text denoising task. Our approach thus trains the LLM to recover clean transcripts from noisy inputs. This process effectively adapts the model to a target domain while preserving cross-modal alignment. Our solution is lightweight, requiring no architectural changes or additional parameters. Extensive evaluation on two datasets demonstrates up to 22.1% relative improvement, outperforming recent state-of-the-art text-only adaptation methods.",
        "url": "http://arxiv.org/abs/2601.20900v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20900v1",
        "arxiv_id": "2601.20900v1",
        "authors": [
            "Sergio Burdisso",
            "Esaú Villatoro-Tello",
            "Andrés Carofilis",
            "Shashi Kumar",
            "Kadri Hacioglu",
            "Srikanth Madikeri",
            "Pradeep Rangappa",
            "Manjunath K E",
            "Petr Motlicek",
            "Shankar Venkatesan",
            "Andreas Stolcke"
        ],
        "submitted": "2026-01-28 10:18:23",
        "source": "arxiv",
        "comment": "Paper accepted at ICASSP 2026"
    },
    {
        "title": "Reducing Prompt Sensitivity in LLM-based Speech Recognition Through Learnable Projection",
        "abstract": "LLM-based automatic speech recognition (ASR), a well-established approach, connects speech foundation models to large language models (LLMs) through a speech-to-LLM projector, yielding promising results. A common design choice in these architectures is the use of a fixed, manually defined prompt during both training and inference. This setup not only enables applicability across a range of practical scenarios, but also helps maximize model performance. However, the impact of prompt design remains underexplored. This paper presents a comprehensive analysis of commonly used prompts across diverse datasets, showing that prompt choice significantly affects ASR performance and introduces instability, with no single prompt performing best across all cases. Inspired by the speech-to-LLM projector, we propose a prompt projector module, a simple, model-agnostic extension that learns to project prompt embeddings to more effective regions of the LLM input space, without modifying the underlying LLM-based ASR model. Experiments on four datasets show that the addition of a prompt projector consistently improves performance, reduces variability, and outperforms the best manually selected prompts.",
        "url": "http://arxiv.org/abs/2601.20898v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20898v1",
        "arxiv_id": "2601.20898v1",
        "authors": [
            "Sergio Burdisso",
            "Esaú Villatoro-Tello",
            "Shashi Kumar",
            "Srikanth Madikeri",
            "Andrés Carofilis",
            "Pradeep Rangappa",
            "Manjunath K E",
            "Kadri Hacioglu",
            "Petr Motlicek",
            "Andreas Stolcke"
        ],
        "submitted": "2026-01-28 09:50:34",
        "source": "arxiv",
        "comment": "Paper accepted at ICASSP 2026"
    },
    {
        "title": "PEARL: Plan Exploration and Adaptive Reinforcement Learning for Multihop Tool Use",
        "abstract": "Large Language Models show great potential with external tools, but face significant challenges in complex, multi-turn tool invocation. They often exhibit weak planning, tool hallucination, erroneous parameter generation, and struggle with robust interaction. To tackle these issues, we present PEARL, a novel framework to enhance LLM planning and execution for sophisticated tool use. PEARL adopts a two-stage approach: an offline phase where the agent explores tools to learn valid usage patterns and failure conditions, and an online reinforcement learning phase. In the online phase, a dedicated Planner is trained via group Relative Policy Optimization (GRPO) with a carefully designed reward function that provides distinct signals for planning quality. Experiments on the ToolHop and T-Eval benchmarks show PEARL significantly outperforms existing methods, achieving a new state-of-the-art success rate of \\textbf{56.5\\%} on ToolHop while maintaining a low invocation error rate. Our work marks a key advance in addressing the complex planning challenges of tool use, contributing to the development of more robust and reliable LLM-based agents.",
        "url": "http://arxiv.org/abs/2601.20439v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20439v1",
        "arxiv_id": "2601.20439v1",
        "authors": [
            "Qihao Wang",
            "Mingzhe Lu",
            "Jiayue Wu",
            "Yue Hu",
            "Yanbing Liu"
        ],
        "submitted": "2026-01-28 09:49:43",
        "source": "arxiv",
        "comment": "Accepted to PRICAI25"
    },
    {
        "title": "Hopes and Fears -- Emotion Distribution in the Topic Landscape of Finnish Parliamentary Speech 2000-2020",
        "abstract": "Existing research often treats parliamentary discourse as a homogeneous whole, overlooking topic-specific patterns. Parliamentary speeches address a wide range of topics, some of which evoke stronger emotions than others. While everyone has intuitive assumptions about what the most emotive topics in a parliament may be, there has been little research into the emotions typically linked to different topics. This paper strives to fill this gap by examining emotion expression among the topics of parliamentary speeches delivered in Eduskunta, the Finnish Parliament, between 2000 and 2020. An emotion analysis model is used to investigate emotion expression in topics, from both synchronic and diachronic perspectives. The results strengthen evidence of increasing positivity in parliamentary speech and provide further insights into topic-specific emotion expression within parliamentary debate.",
        "url": "http://arxiv.org/abs/2601.20424v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20424v1",
        "arxiv_id": "2601.20424v1",
        "authors": [
            "Anna Ristilä",
            "Otto Tarkka",
            "Veronika Laippala",
            "Kimmo Elo"
        ],
        "submitted": "2026-01-28 09:32:41",
        "source": "arxiv",
        "comment": "27 pages (40 including appendices), 5 figures (13 including sub-figures), 1 table, 1 formula, 3 appendices; submitted to JDMDH"
    },
    {
        "title": "SpeechMapper: Speech-to-text Embedding Projector for LLMs",
        "abstract": "Current speech LLMs bridge speech foundation models to LLMs using projection layers, training all of these components on speech instruction data. This strategy is computationally intensive and susceptible to task and prompt overfitting. We present SpeechMapper, a cost-efficient speech-to-LLM-embedding training approach that mitigates overfitting, enabling more robust and generalizable models. Our model is first pretrained without the LLM on inexpensive hardware, and then efficiently attached to the target LLM via a brief 1K-step instruction tuning (IT) stage. Through experiments on speech translation and spoken question answering, we demonstrate the versatility of SpeechMapper's pretrained block, presenting results for both task-agnostic IT, an ASR-based adaptation strategy that does not train in the target task, and task-specific IT. In task-agnostic settings, Speechmapper rivals the best instruction-following speech LLM from IWSLT25, despite never being trained on these tasks, while in task-specific settings, it outperforms this model across many datasets, despite requiring less data and compute. Overall, SpeechMapper offers a practical and scalable approach for efficient, generalizable speech-LLM integration without large-scale IT.",
        "url": "http://arxiv.org/abs/2601.20417v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20417v1",
        "arxiv_id": "2601.20417v1",
        "authors": [
            "Biswesh Mohapatra",
            "Marcely Zanon Boito",
            "Ioan Calapodescu"
        ],
        "submitted": "2026-01-28 09:22:58",
        "source": "arxiv",
        "comment": "Accepted to ICASSP 2026"
    },
    {
        "title": "Beyond Accuracy: A Cognitive Load Framework for Mapping the Capability Boundaries of Tool-use Agents",
        "abstract": "The ability of Large Language Models (LLMs) to use external tools unlocks powerful real-world interactions, making rigorous evaluation essential. However, current benchmarks primarily report final accuracy, revealing what models can do but obscuring the cognitive bottlenecks that define their true capability boundaries. To move from simple performance scoring to a diagnostic tool, we introduce a framework grounded in Cognitive Load Theory. Our framework deconstructs task complexity into two quantifiable components: Intrinsic Load, the inherent structural complexity of the solution path, formalized with a novel Tool Interaction Graph; and Extraneous Load, the difficulty arising from ambiguous task presentation. To enable controlled experiments, we construct ToolLoad-Bench, the first benchmark with parametrically adjustable cognitive load. Our evaluation reveals distinct performance cliffs as cognitive load increases, allowing us to precisely map each model's capability boundary. We validate that our framework's predictions are highly calibrated with empirical results, establishing a principled methodology for understanding an agent's limits and a practical foundation for building more efficient systems.",
        "url": "http://arxiv.org/abs/2601.20412v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20412v1",
        "arxiv_id": "2601.20412v1",
        "authors": [
            "Qihao Wang",
            "Yue Hu",
            "Mingzhe Lu",
            "Jiayue Wu",
            "Yanbing Liu",
            "Yuanmin Tang"
        ],
        "submitted": "2026-01-28 09:17:51",
        "source": "arxiv",
        "comment": "Accepted to AAAI 2026"
    },
    {
        "title": "Eliminating Hallucination in Diffusion-Augmented Interactive Text-to-Image Retrieval",
        "abstract": "Diffusion-Augmented Interactive Text-to-Image Retrieval (DAI-TIR) is a promising paradigm that improves retrieval performance by generating query images via diffusion models and using them as additional ``views'' of the user's intent. However, these generative views can be incorrect because diffusion generation may introduce hallucinated visual cues that conflict with the original query text. Indeed, we empirically demonstrate that these hallucinated cues can substantially degrade DAI-TIR performance. To address this, we propose Diffusion-aware Multi-view Contrastive Learning (DMCL), a hallucination-robust training framework that casts DAI-TIR as joint optimization over representations of query intent and the target image. DMCL introduces semantic-consistency and diffusion-aware contrastive objectives to align textual and diffusion-generated query views while suppressing hallucinated query signals. This yields an encoder that acts as a semantic filter, effectively mapping hallucinated cues into a null space, improving robustness to spurious cues and better representing the user's intent. Attention visualization and geometric embedding-space analyses corroborate this filtering behavior. Across five standard benchmarks, DMCL delivers consistent improvements in multi-round Hits@10, reaching as high as 7.37\\% over prior fine-tuned and zero-shot baselines, which indicates it is a general and robust training framework for DAI-TIR.",
        "url": "http://arxiv.org/abs/2601.20391v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20391v1",
        "arxiv_id": "2601.20391v1",
        "authors": [
            "Zhuocheng Zhang",
            "Kangheng Liang",
            "Guanxuan Li",
            "Paul Henderson",
            "Richard Mccreadie",
            "Zijun Long"
        ],
        "submitted": "2026-01-28 08:58:57",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "LLM-AutoDP: Automatic Data Processing via LLM Agents for Model Fine-tuning",
        "abstract": "Large Language Models (LLMs) can be fine-tuned on domain-specific data to enhance their performance in specialized fields. However, such data often contains numerous low-quality samples, necessitating effective data processing (DP). In practice, DP strategies are typically developed through iterative manual analysis and trial-and-error adjustment. These processes inevitably incur high labor costs and may lead to privacy issues in high-privacy domains like healthcare due to direct human access to sensitive data. Thus, achieving automated data processing without exposing the raw data has become a critical challenge. To address this challenge, we propose LLM-AutoDP, a novel framework that leverages LLMs as agents to automatically generate and optimize data processing strategies. Our method generates multiple candidate strategies and iteratively refines them using feedback signals and comparative evaluations. This iterative in-context learning mechanism enables the agent to converge toward high-quality processing pipelines without requiring direct human intervention or access to the underlying data. To further accelerate strategy search, we introduce three key techniques: Distribution Preserving Sampling, which reduces data volume while maintaining distributional integrity; Processing Target Selection, which uses a binary classifier to identify low-quality samples for focused processing; Cache-and-Reuse Mechanism}, which minimizes redundant computations by reusing prior processing results. Results show that models trained on data processed by our framework achieve over 80% win rates against models trained on unprocessed data. Compared to AutoML baselines based on LLM agents, LLM-AutoDP achieves approximately a 65% win rate. Moreover, our acceleration techniques reduce the total searching time by up to 10 times, demonstrating both effectiveness and efficiency.",
        "url": "http://arxiv.org/abs/2601.20375v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20375v1",
        "arxiv_id": "2601.20375v1",
        "authors": [
            "Wei Huang",
            "Anda Cheng",
            "Yinggui Wang",
            "Lei Wang",
            "Tao Wei"
        ],
        "submitted": "2026-01-28 08:37:34",
        "source": "arxiv",
        "comment": "Accepted by VLDB2026"
    },
    {
        "title": "TABED: Test-Time Adaptive Ensemble Drafting for Robust Speculative Decoding in LVLMs",
        "abstract": "Speculative decoding (SD) has proven effective for accelerating LLM inference by quickly generating draft tokens and verifying them in parallel. However, SD remains largely unexplored for Large Vision-Language Models (LVLMs), which extend LLMs to process both image and text prompts. To address this gap, we benchmark existing inference methods with small draft models on 11 datasets across diverse input scenarios and observe scenario-specific performance fluctuations. Motivated by these findings, we propose Test-time Adaptive Batched Ensemble Drafting (TABED), which dynamically ensembles multiple drafts obtained via batch inference by leveraging deviations from past ground truths available in the SD setting. The dynamic ensemble method achieves an average robust walltime speedup of 1.74x over autoregressive decoding and a 5% improvement over single drafting methods, while remaining training-free and keeping ensembling costs negligible through parameter sharing. With its plug-and-play compatibility, we further enhance TABED by integrating advanced verification and alternative drafting methods. Code and custom-trained models are available at https://github.com/furiosa-ai/TABED.",
        "url": "http://arxiv.org/abs/2601.20357v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20357v1",
        "arxiv_id": "2601.20357v1",
        "authors": [
            "Minjae Lee",
            "Wonjun Kang",
            "Byeongkeun Ahn",
            "Christian Classen",
            "Kevin Galim",
            "Seunghyuk Oh",
            "Minghao Yan",
            "Hyung Il Koo",
            "Kangwook Lee"
        ],
        "submitted": "2026-01-28 08:16:57",
        "source": "arxiv",
        "comment": "Accepted to Findings of EACL 2026"
    },
    {
        "title": "Improving Diffusion Language Model Decoding through Joint Search in Generation Order and Token Space",
        "abstract": "Diffusion Language Models (DLMs) offer order-agnostic generation that can explore many possible decoding trajectories. However, current decoding methods commit to a single trajectory, limiting exploration in trajectory space. We introduce Order-Token Search to explore this space through jointly searching over generation order and token values. Its core is a likelihood estimator that scores denoising actions, enabling stable pruning and efficient exploration of diverse trajectories. Across mathematical reasoning and coding benchmarks, Order-Token Search consistently outperforms baselines on GSM8K, MATH500, Countdown, and HumanEval (3.1%, 3.8%, 7.9%, and 6.8% absolute over backbone), matching or surpassing diffu-GRPO post-trained d1-LLaDA. Our work establishes joint search as a key component for advancing decoding in DLMs.",
        "url": "http://arxiv.org/abs/2601.20339v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20339v1",
        "arxiv_id": "2601.20339v1",
        "authors": [
            "Yangyi Shen",
            "Tianjian Feng",
            "Jiaqi Han",
            "Wen Wang",
            "Tianlang Chen",
            "Chunhua Shen",
            "Jure Leskovec",
            "Stefano Ermon"
        ],
        "submitted": "2026-01-28 07:55:07",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MobileBench-OL: A Comprehensive Chinese Benchmark for Evaluating Mobile GUI Agents in Real-World Environment",
        "abstract": "Recent advances in mobile Graphical User Interface (GUI) agents highlight the growing need for comprehensive evaluation benchmarks. While new online benchmarks offer more realistic testing than offline ones, they tend to focus on the agents' task instruction-following ability while neglecting their reasoning and exploration ability. Moreover, these benchmarks do not consider the random noise in real-world mobile environments. This leads to a gap between benchmarks and real-world environments. To addressing these limitations, we propose MobileBench-OL, an online benchmark with 1080 tasks from 80 Chinese apps. It measures task execution, complex reasoning, and noise robustness of agents by including 5 subsets, which set multiple evaluation dimensions. We also provide an auto-eval framework with a reset mechanism, enabling stable and repeatable real-world benchmarking. Evaluating 12 leading GUI agents on MobileBench-OL shows significant room for improvement to meet real-world requirements. Human evaluation further confirms that MobileBench-OL can reliably measure the performance of leading GUI agents in real environments. Our data and code will be released upon acceptance.",
        "url": "http://arxiv.org/abs/2601.20335v2",
        "pdf_url": "https://arxiv.org/pdf/2601.20335v2",
        "arxiv_id": "2601.20335v2",
        "authors": [
            "Qinzhuo Wu",
            "Zhizhuo Yang",
            "Hanhao Li",
            "Pengzhi Gao",
            "Wei Liu",
            "Jian Luan"
        ],
        "submitted": "2026-01-28 07:49:48",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "PsychePass: Calibrating LLM Therapeutic Competence via Trajectory-Anchored Tournaments",
        "abstract": "While large language models show promise in mental healthcare, evaluating their therapeutic competence remains challenging due to the unstructured and longitudinal nature of counseling. We argue that current evaluation paradigms suffer from an unanchored defect, leading to two forms of instability: process drift, where unsteered client simulation wanders away from specific counseling goals, and standard drift, where static pointwise scoring lacks the stability for reliable judgment. To address this, we introduce Ps, a unified framework that calibrates the therapeutic competence of LLMs via trajectory-anchored tournaments. We first anchor the interaction trajectory in simulation, where clients precisely control the fluid consultation process to probe multifaceted capabilities. We then anchor the battle trajectory in judgments through an efficient Swiss-system tournament, utilizing dynamic pairwise battles to yield robust Elo ratings. Beyond ranking, we demonstrate that tournament trajectories can be transformed into credible reward signals, enabling on-policy reinforcement learning to enhance LLMs' performance. Extensive experiments validate the effectiveness of PsychePass and its strong consistency with human expert judgments.",
        "url": "http://arxiv.org/abs/2601.20330v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20330v1",
        "arxiv_id": "2601.20330v1",
        "authors": [
            "Zhuang Chen",
            "Dazhen Wan",
            "Zhangkai Zheng",
            "Guanqun Bi",
            "Xiyao Xiao",
            "Binghang Li",
            "Minlie Huang"
        ],
        "submitted": "2026-01-28 07:48:39",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "CE-RM: A Pointwise Generative Reward Model Optimized via Two-Stage Rollout and Unified Criteria",
        "abstract": "Automatic evaluation is crucial yet challenging for open-ended natural language generation, especially when rule-based metrics are infeasible. Compared with traditional methods, the recent LLM-as-a-Judge paradigms enable better and more flexible evaluation, and show promise as generative reward models for reinforcement learning. However, prior work has revealed a notable gap between their seemingly impressive benchmark performance and actual effectiveness in RL practice. We attribute this issue to some limitations in existing studies, including the dominance of pairwise evaluation and inadequate optimization of evaluation criteria. Therefore, we propose CE-RM-4B, a pointwise generative reward model trained with a dedicated two-stage rollout method, and adopting unified query-based criteria. Using only about 5.7K high-quality data curated from the open-source preference dataset, our CE-RM-4B achieves superior performance on diverse reward model benchmarks, especially in Best-of-N scenarios, and delivers more effective improvements in downstream RL practice.",
        "url": "http://arxiv.org/abs/2601.20327v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20327v1",
        "arxiv_id": "2601.20327v1",
        "authors": [
            "Xinyu Hu",
            "Yancheng He",
            "Weixun Wang",
            "Tao Feng",
            "Li Lin",
            "Jiashun Liu",
            "Wenbo Su",
            "Bo Zheng",
            "Xiaojun Wan"
        ],
        "submitted": "2026-01-28 07:46:13",
        "source": "arxiv",
        "comment": "Under Review"
    },
    {
        "title": "Beyond Speedup -- Utilizing KV Cache for Sampling and Reasoning",
        "abstract": "KV caches, typically used only to speed up autoregressive decoding, encode contextual information that can be reused for downstream tasks at no extra cost. We propose treating the KV cache as a lightweight representation, eliminating the need to recompute or store full hidden states. Despite being weaker than dedicated embeddings, KV-derived representations are shown to be sufficient for two key applications: \\textbf{(i) Chain-of-Embedding}, where they achieve competitive or superior performance on Llama-3.1-8B-Instruct and Qwen2-7B-Instruct; and \\textbf{(ii) Fast/Slow Thinking Switching}, where they enable adaptive reasoning on Qwen3-8B and DeepSeek-R1-Distil-Qwen-14B, reducing token generation by up to $5.7\\times$ with minimal accuracy loss. Our findings establish KV caches as a free, effective substrate for sampling and reasoning, opening new directions for representation reuse in LLM inference. Code: https://github.com/cmd2001/ICLR2026_KV-Embedding.",
        "url": "http://arxiv.org/abs/2601.20326v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20326v1",
        "arxiv_id": "2601.20326v1",
        "authors": [
            "Zeyu Xing",
            "Xing Li",
            "Hui-Ling Zhen",
            "Mingxuan Yuan",
            "Sinno Jialin Pan"
        ],
        "submitted": "2026-01-28 07:44:52",
        "source": "arxiv",
        "comment": "Accepted by ICLR26"
    },
    {
        "title": "Less is More: Benchmarking LLM Based Recommendation Agents",
        "abstract": "Large Language Models (LLMs) are increasingly deployed for personalized product recommendations, with practitioners commonly assuming that longer user purchase histories lead to better predictions. We challenge this assumption through a systematic benchmark of four state of the art LLMs GPT-4o-mini, DeepSeek-V3, Qwen2.5-72B, and Gemini 2.5 Flash across context lengths ranging from 5 to 50 items using the REGEN dataset.\n  Surprisingly, our experiments with 50 users in a within subject design reveal no significant quality improvement with increased context length. Quality scores remain flat across all conditions (0.17--0.23). Our findings have significant practical implications: practitioners can reduce inference costs by approximately 88\\% by using context (5--10 items) instead of longer histories (50 items), without sacrificing recommendation quality. We also analyze latency patterns across providers and find model specific behaviors that inform deployment decisions. This work challenges the existing ``more context is better'' paradigm and provides actionable guidelines for cost effective LLM based recommendation systems.",
        "url": "http://arxiv.org/abs/2601.20316v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20316v1",
        "arxiv_id": "2601.20316v1",
        "authors": [
            "Kargi Chauhan",
            "Mahalakshmi Venkateswarlu"
        ],
        "submitted": "2026-01-28 07:08:51",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SAPO: Self-Adaptive Process Optimization Makes Small Reasoners Stronger",
        "abstract": "Existing self-evolution methods overlook the influence of fine-grained reasoning steps, which leads to the reasoner-verifier gap. The computational inefficiency of Monte Carlo (MC) process supervision further exacerbates the difficulty in mitigating the gap. Motivated by the Error-Related Negativity (ERN), which the reasoner can localize error following incorrect decisions, guiding rapid adjustments, we propose a Self-Adaptive Process Optimization (SAPO) method for self-improvement in Small Language Models (SLMs). SAPO adaptively and efficiently introduces process supervision signals by actively minimizing the reasoner-verifier gap rather than relying on inefficient MC estimations. Extensive experiments demonstrate that the proposed method outperforms most existing self-evolution methods on two challenging task types: mathematics and code. Additionally, to further investigate SAPO's impact on verifier performance, this work introduces two new benchmarks for process reward models in both mathematical and coding tasks.",
        "url": "http://arxiv.org/abs/2601.20312v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20312v1",
        "arxiv_id": "2601.20312v1",
        "authors": [
            "Kaiyuan Chen",
            "Guangmin Zheng",
            "Jin Wang",
            "Xiaobing Zhou",
            "Xuejie Zhang"
        ],
        "submitted": "2026-01-28 07:04:30",
        "source": "arxiv",
        "comment": "Accepted by AAAI 2026"
    },
    {
        "title": "MiLorE-SSL: Scaling Multilingual Capabilities in Self-Supervised Models without Forgetting",
        "abstract": "Self-supervised learning (SSL) has greatly advanced speech representation learning, but multilingual SSL models remain constrained to languages encountered during pretraining. Retraining from scratch to incorporate new languages is computationally expensive, while sequential training without migitation strategies often leads to catastrophic forgetting. To address this, we propose MiLorE-SSL, a lightweight framework that combines LoRA modules with a soft mixture-of-experts (MoE) mechanism for efficient continual multilingual training. LoRA provides efficient low-rank adaptation, while soft MoE promotes flexible expert sharing across languages, reducing cross-lingual interference. To further mitigate forgetting, we introduce limited replay data from existing languages, avoiding reliance on large historical corpora. Experiments on ML-SUPERB demonstrate that MiLorE-SSL achieves strong performance in new languages and improves the ability in existing ones with only 2.14% trainable parameters.",
        "url": "http://arxiv.org/abs/2601.20300v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20300v1",
        "arxiv_id": "2601.20300v1",
        "authors": [
            "Jing Xu",
            "Minglin Wu",
            "Xueyuan Chen",
            "Xixin Wu",
            "Helen Meng"
        ],
        "submitted": "2026-01-28 06:48:52",
        "source": "arxiv",
        "comment": "Accepted by ICASSP2026"
    },
    {
        "title": "Truthfulness Despite Weak Supervision: Evaluating and Training LLMs Using Peer Prediction",
        "abstract": "The evaluation and post-training of large language models (LLMs) rely on supervision, but strong supervision for difficult tasks is often unavailable, especially when evaluating frontier models. In such cases, models are demonstrated to exploit evaluations built on such imperfect supervision, leading to deceptive results. However, underutilized in LLM research, a wealth of mechanism design research focuses on game-theoretic incentive compatibility, i.e., eliciting honest and informative answers with weak supervision. Drawing from this literature, we introduce the peer prediction method for model evaluation and post-training. It rewards honest and informative answers over deceptive and uninformative ones, using a metric based on mutual predictability and without requiring ground truth labels. We demonstrate the method's effectiveness and resistance to deception, with both theoretical guarantees and empirical validation on models with up to 405B parameters. We show that training an 8B model with peer prediction-based reward recovers most of the drop in truthfulness due to prior malicious finetuning, even when the reward is produced by a 0.135B language model with no finetuning. On the evaluation front, in contrast to LLM-as-a-Judge which requires strong and trusted judges, we discover an inverse scaling property in peer prediction, where, surprisingly, resistance to deception is strengthened as the capability gap between the experts and participants widens, enabling reliable evaluation of strong models with weak supervision. In particular, LLM-as-a-Judge become worse than random guess when facing deceptive models 5-20x the judge's size, while peer prediction thrives when such gaps are large, including in cases with over 100x size difference.",
        "url": "http://arxiv.org/abs/2601.20299v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20299v1",
        "arxiv_id": "2601.20299v1",
        "authors": [
            "Tianyi Alex Qiu",
            "Micah Carroll",
            "Cameron Allen"
        ],
        "submitted": "2026-01-28 06:47:46",
        "source": "arxiv",
        "comment": "ICLR 2026"
    },
    {
        "title": "One Word is Enough: Minimal Adversarial Perturbations for Neural Text Ranking",
        "abstract": "Neural ranking models (NRMs) achieve strong retrieval effectiveness, yet prior work has shown they are vulnerable to adversarial perturbations. We revisit this robustness question with a minimal, query-aware attack that promotes a target document by inserting or substituting a single, semantically aligned word - the query center. We study heuristic and gradient-guided variants, including a white-box method that identifies influential insertion points. On TREC-DL 2019/2020 with BERT and monoT5 re-rankers, our single-word attacks achieve up to 91% success while modifying fewer than two tokens per document on average, achieving competitive rank and score boosts with far fewer edits under a comparable white-box setup to ensure fair evaluation against PRADA. We also introduce new diagnostic metrics to analyze attack sensitivity beyond aggregate success rates. Our analysis reveals a Goldilocks zone in which mid-ranked documents are most vulnerable. These findings demonstrate practical risks and motivate future defenses for robust neural ranking.",
        "url": "http://arxiv.org/abs/2601.20283v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20283v1",
        "arxiv_id": "2601.20283v1",
        "authors": [
            "Tanmay Karmakar",
            "Sourav Saha",
            "Debapriyo Majumdar",
            "Surjyanee Halder"
        ],
        "submitted": "2026-01-28 05:58:53",
        "source": "arxiv",
        "comment": "To appear at ECIR 2026"
    },
    {
        "title": "Beyond the Needle's Illusion: Decoupled Evaluation of Evidence Access and Use under Semantic Interference at 326M-Token Scale",
        "abstract": "Long-context LLM agents must access the right evidence from large environments and use it faithfully. However, the popular Needle-in-a-Haystack (NIAH) evaluation mostly measures benign span localization. The needle is near-unique, and the haystack is largely irrelevant. We introduce EverMemBench-S (EMB-S), an adversarial NIAH-style benchmark built on a 326M-token MemoryBank. While the full MemoryBank spans 326M tokens for retrieval-based (RAG) evaluation, we evaluate native long-context models only at scales that fit within each model's context window (up to 1M tokens in this work) to ensure a fair comparison. EMB-S pairs queries with collision-tested near-miss hard negatives and gold evidence sets spanning one or more documents, validated via human screening and LLM verification. We also propose a decoupled diagnostic protocol that reports evidence access (document-ID localization) separately from end-to-end QA quality under full-context prompting. This enables consistent diagnosis for both native long-context prompting and retrieval pipelines. Across a reference-corpus ladder from domain-isolated 64K contexts to a globally shared 326M-token environment, we observe a clear reality gap. Systems that saturate benign NIAH degrade sharply in evidence access under semantic interference. These results indicate that semantic discrimination, not context length alone, is the dominant bottleneck for long-context memory at scale.",
        "url": "http://arxiv.org/abs/2601.20276v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20276v1",
        "arxiv_id": "2601.20276v1",
        "authors": [
            "Tianwei Lin",
            "Zuyi Zhou",
            "Xinda Zhao",
            "Chenke Wang",
            "Xiaohong Li",
            "Yu Chen",
            "Chuanrui Hu",
            "Jian Pei",
            "Yafeng Deng"
        ],
        "submitted": "2026-01-28 05:44:00",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "RusLICA: A Russian-Language Platform for Automated Linguistic Inquiry and Category Analysis",
        "abstract": "Defining psycholinguistic characteristics in written texts is a task gaining increasing attention from researchers. One of the most widely used tools in the current field is Linguistic Inquiry and Word Count (LIWC) that originally was developed to analyze English texts and translated into multiple languages. Our approach offers the adaptation of LIWC methodology for the Russian language, considering its grammatical and cultural specificities. The suggested approach comprises 96 categories, integrating syntactic, morphological, lexical, general statistical features, and results of predictions obtained using pre-trained language models (LMs) for text analysis. Rather than applying direct translation to existing thesauri, we built the dictionary specifically for the Russian language based on the content from several lexicographic resources, semantic dictionaries and corpora. The paper describes the process of mapping lemmas to 42 psycholinguistic categories and the implementation of the analyzer as part of RusLICA web service.",
        "url": "http://arxiv.org/abs/2601.20275v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20275v1",
        "arxiv_id": "2601.20275v1",
        "authors": [
            "Elina Sigdel",
            "Anastasia Panfilova"
        ],
        "submitted": "2026-01-28 05:43:40",
        "source": "arxiv",
        "comment": "The link to the platform: https://ruslica.ipran.ru"
    },
    {
        "title": "SoftHateBench: Evaluating Moderation Models Against Reasoning-Driven, Policy-Compliant Hostility",
        "abstract": "Online hate on social media ranges from overt slurs and threats (\\emph{hard hate speech}) to \\emph{soft hate speech}: discourse that appears reasonable on the surface but uses framing and value-based arguments to steer audiences toward blaming or excluding a target group. We hypothesize that current moderation systems, largely optimized for surface toxicity cues, are not robust to this reasoning-driven hostility, yet existing benchmarks do not measure this gap systematically. We introduce \\textbf{\\textsc{SoftHateBench}}, a generative benchmark that produces soft-hate variants while preserving the underlying hostile standpoint. To generate soft hate, we integrate the \\emph{Argumentum Model of Topics} (AMT) and \\emph{Relevance Theory} (RT) in a unified framework: AMT provides the backbone argument structure for rewriting an explicit hateful standpoint into a seemingly neutral discussion while preserving the stance, and RT guides generation to keep the AMT chain logically coherent. The benchmark spans \\textbf{7} sociocultural domains and \\textbf{28} target groups, comprising \\textbf{4,745} soft-hate instances. Evaluations across encoder-based detectors, general-purpose LLMs, and safety models show a consistent drop from hard to soft tiers: systems that detect explicit hostility often fail when the same stance is conveyed through subtle, reasoning-based language. \\textcolor{red}{\\textbf{Disclaimer.} Contains offensive examples used solely for research.}",
        "url": "http://arxiv.org/abs/2601.20256v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20256v1",
        "arxiv_id": "2601.20256v1",
        "authors": [
            "Xuanyu Su",
            "Diana Inkpen",
            "Nathalie Japkowicz"
        ],
        "submitted": "2026-01-28 05:04:18",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "HE-SNR: Uncovering Latent Logic via Entropy for Guiding Mid-Training on SWE-BENCH",
        "abstract": "SWE-bench has emerged as the premier benchmark for evaluating Large Language Models on complex software engineering tasks. While these capabilities are fundamentally acquired during the mid-training phase and subsequently elicited during Supervised Fine-Tuning (SFT), there remains a critical deficit in metrics capable of guiding mid-training effectively. Standard metrics such as Perplexity (PPL) are compromised by the \"Long-Context Tax\" and exhibit weak correlation with downstream SWE performance. In this paper, we bridge this gap by first introducing a rigorous data filtering strategy. Crucially, we propose the Entropy Compression Hypothesis, redefining intelligence not by scalar Top-1 compression, but by the capacity to structure uncertainty into Entropy-Compressed States of low orders (\"reasonable hesitation\"). Grounded in this fine-grained entropy analysis, we formulate a novel metric, HE-SNR (High-Entropy Signal-to-Noise Ratio). Validated on industrial-scale Mixture-of-Experts (MoE) models across varying context windows (32K/128K), our approach demonstrates superior robustness and predictive power. This work provides both the theoretical foundation and practical tools for optimizing the latent potential of LLMs in complex engineering domains.",
        "url": "http://arxiv.org/abs/2601.20255v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20255v1",
        "arxiv_id": "2601.20255v1",
        "authors": [
            "Yueyang Wang",
            "Jiawei Fu",
            "Baolong Bi",
            "Xili Wang",
            "Xiaoqing Liu"
        ],
        "submitted": "2026-01-28 05:03:24",
        "source": "arxiv",
        "comment": "21 pages, 15 figures"
    },
    {
        "title": "Automated Benchmark Generation from Domain Guidelines Informed by Bloom's Taxonomy",
        "abstract": "Open-ended question answering (QA) evaluates a model's ability to perform contextualized reasoning beyond factual recall. This challenge is especially acute in practice-based domains, where knowledge is procedural and grounded in professional judgment, while most existing LLM benchmarks depend on pre-existing human exam datasets that are often unavailable in such settings. We introduce a framework for automated benchmark generation from expert-authored guidelines informed by Bloom's Taxonomy. It converts expert practices into implicit violation-based scenarios and expands them into auto-graded multiple-choice questions (MCQs) and multi-turn dialogues across four cognitive levels, enabling deterministic, reproducible, and scalable evaluation. Applied to three applied domains: teaching, dietetics, and caregiving, we find differences between model and human-like reasoning: LLMs sometimes perform relatively better on higher-order reasoning (Analyze) but fail more frequently on lower-level items (Remember). We produce large-scale, psychometrically informed benchmarks that surface these non-intuitive model behaviors and enable evaluation of contextualized reasoning in real-world settings.",
        "url": "http://arxiv.org/abs/2601.20253v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20253v1",
        "arxiv_id": "2601.20253v1",
        "authors": [
            "Si Chen",
            "Le Huy Khiem",
            "Annalisa Szymanski",
            "Ronald Metoyer",
            "Ting Hua",
            "Nitesh V. Chawla"
        ],
        "submitted": "2026-01-28 05:01:11",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "SW-ASR: A Context-Aware Hybrid ASR Pipeline for Robust Single Word Speech Recognition",
        "abstract": "Single-word Automatic Speech Recognition (ASR) is a challenging task due to the lack of linguistic context and sensitivity to noise, pronunciation variation, and channel artifacts, especially in low-resource, communication-critical domains such as healthcare and emergency response. This paper reviews recent deep learning approaches and proposes a modular framework for robust single-word detection. The system combines denoising and normalization with a hybrid ASR front end (Whisper + Vosk) and a verification layer designed to handle out-of-vocabulary words and degraded audio. The verification layer supports multiple matching strategies, including embedding similarity, edit distance, and LLM-based matching with optional contextual guidance. We evaluate the framework on the Google Speech Commands dataset and a curated real-world dataset collected from telephony and messaging platforms under bandwidth-limited conditions. Results show that while the hybrid ASR front end performs well on clean audio, the verification layer significantly improves accuracy on noisy and compressed channels. Context-guided and LLM-based matching yield the largest gains, demonstrating that lightweight verification and context mechanisms can substantially improve single-word ASR robustness without sacrificing latency required for real-time telephony applications.",
        "url": "http://arxiv.org/abs/2601.20890v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20890v1",
        "arxiv_id": "2601.20890v1",
        "authors": [
            "Manali Sharma",
            "Riya Naik",
            "Buvaneshwari G"
        ],
        "submitted": "2026-01-28 04:50:04",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MALLOC: Benchmarking the Memory-aware Long Sequence Compression for Large Sequential Recommendation",
        "abstract": "The scaling law, which indicates that model performance improves with increasing dataset and model capacity, has fueled a growing trend in expanding recommendation models in both industry and academia. However, the advent of large-scale recommenders also brings significantly higher computational costs, particularly under the long-sequence dependencies inherent in the user intent of recommendation systems. Current approaches often rely on pre-storing the intermediate states of the past behavior for each user, thereby reducing the quadratic re-computation cost for the following requests. Despite their effectiveness, these methods often treat memory merely as a medium for acceleration, without adequately considering the space overhead it introduces. This presents a critical challenge in real-world recommendation systems with billions of users, each of whom might initiate thousands of interactions and require massive memory for state storage. Fortunately, there have been several memory management strategies examined for compression in LLM, while most have not been evaluated on the recommendation task. To mitigate this gap, we introduce MALLOC, a comprehensive benchmark for memory-aware long sequence compression. MALLOC presents a comprehensive investigation and systematic classification of memory management techniques applicable to large sequential recommendations. These techniques are integrated into state-of-the-art recommenders, enabling a reproducible and accessible evaluation platform. Through extensive experiments across accuracy, efficiency, and complexity, we demonstrate the holistic reliability of MALLOC in advancing large-scale recommendation. Code is available at https://anonymous.4open.science/r/MALLOC.",
        "url": "http://arxiv.org/abs/2601.20234v2",
        "pdf_url": "https://arxiv.org/pdf/2601.20234v2",
        "arxiv_id": "2601.20234v2",
        "authors": [
            "Qihang Yu",
            "Kairui Fu",
            "Zhaocheng Du",
            "Yuxuan Si",
            "Kaiyuan Li",
            "Weihao Zhao",
            "Zhicheng Zhang",
            "Jieming Zhu",
            "Quanyu Dai",
            "Zhenhua Dong",
            "Shengyu Zhang",
            "Kun Kuang",
            "Fei Wu"
        ],
        "submitted": "2026-01-28 04:11:50",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Unit-Based Agent for Semi-Cascaded Full-Duplex Dialogue Systems",
        "abstract": "Full-duplex voice interaction is crucial for natural human computer interaction. We present a framework that decomposes complex dialogue into minimal conversational units, enabling the system to process each unit independently and predict when to transit to the next. This framework is instantiated as a semi-cascaded full-duplex dialogue system built around a multimodal large language model, supported by auxiliary modules such as voice activity detection (VAD) and text-to-speech (TTS) synthesis. The resulting system operates in a train-free, plug-and-play manner. Experiments on the HumDial dataset demonstrate the effectiveness of our framework, which ranks second among all teams on the test set of the Human-like Spoken Dialogue Systems Challenge (Track 2: Full-Duplex Interaction). Code is available at the GitHub repository https://github.com/yu-haoyuan/fd-badcat.",
        "url": "http://arxiv.org/abs/2601.20230v2",
        "pdf_url": "https://arxiv.org/pdf/2601.20230v2",
        "arxiv_id": "2601.20230v2",
        "authors": [
            "Haoyuan Yu",
            "Yuxuan Chen",
            "Minjie Cai"
        ],
        "submitted": "2026-01-28 04:00:37",
        "source": "arxiv",
        "comment": "ICASSP 2026 (Grant Challenge). https://github.com/yu-haoyuan/fd-badcat"
    },
    {
        "title": "Scaling Medical Reasoning Verification via Tool-Integrated Reinforcement Learning",
        "abstract": "Large language models have achieved strong performance on medical reasoning benchmarks, yet their deployment in clinical settings demands rigorous verification to ensure factual accuracy. While reward models offer a scalable approach for reasoning trace verification, existing methods face two limitations: they produce only scalar reward values without explicit justification, and they rely on single-pass retrieval that precludes adaptive knowledge access as verification unfolds. We introduce $\\method$, an agentic framework that addresses these limitations by training medical reasoning verifiers to iteratively query external medical corpora during evaluation. Our approach combines tool-augmented verification with an iterative reinforcement learning paradigm that requires only trace-level supervision, alongside an adaptive curriculum mechanism that dynamically adjusts training data distribution. Across four medical reasoning benchmarks, $\\method$ achieves substantial gains over existing methods, improving MedQA accuracy by 23.5% and MedXpertQA by 32.0% relative to the base generator in particular. Crucially, $\\method$ demonstrates an $\\mathbf{8\\times}$ reduction in sampling budget requirement compared to prior reward model baselines. These findings establish that grounding verification in dynamically retrieved evidence offers a principled path toward more reliable medical reasoning systems.",
        "url": "http://arxiv.org/abs/2601.20221v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20221v1",
        "arxiv_id": "2601.20221v1",
        "authors": [
            "Hang Zhang",
            "Ruheng Wang",
            "Yuelyu Ji",
            "Mingu Kwak",
            "Xizhi Wu",
            "Chenyu Li",
            "Li Zhang",
            "Wenqi Shi",
            "Yifan Peng",
            "Yanshan Wang"
        ],
        "submitted": "2026-01-28 03:44:20",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Towards End-to-End Alignment of User Satisfaction via Questionnaire in Video Recommendation",
        "abstract": "Short-video recommender systems typically optimize ranking models using dense user behavioral signals, such as clicks and watch time. However, these signals are only indirect proxies of user satisfaction and often suffer from noise and bias. Recently, explicit satisfaction feedback collected through questionnaires has emerged as a high-quality direct alignment supervision, but is extremely sparse and easily overwhelmed by abundant behavioral data, making it difficult to incorporate into online recommendation models. To address these challenges, we propose a novel framework which is towards End-to-End Alignment of user Satisfaction via Questionaire, named EASQ, to enable real-time alignment of ranking models with true user satisfaction. Specifically, we first construct an independent parameter pathway for sparse questionnaire signals by combining a multi-task architecture and a lightweight LoRA module. The multi-task design separates sparse satisfaction supervision from dense behavioral signals, preventing the former from being overwhelmed. The LoRA module pre-inject these preferences in a parameter-isolated manner, ensuring stability in the backbone while optimizing user satisfaction. Furthermore, we employ a DPO-based optimization objective tailored for online learning, which aligns the main model outputs with sparse satisfaction signals in real time. This design enables end-to-end online learning, allowing the model to continuously adapt to new questionnaire feedback while maintaining the stability and effectiveness of the backbone. Extensive offline experiments and large-scale online A/B tests demonstrate that EASQ consistently improves user satisfaction metrics across multiple scenarios. EASQ has been successfully deployed in a production short-video recommendation system, delivering significant and stable business gains.",
        "url": "http://arxiv.org/abs/2601.20215v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20215v1",
        "arxiv_id": "2601.20215v1",
        "authors": [
            "Na Li",
            "Jiaqi Yu",
            "Minzhi Xie",
            "Tiantian He",
            "Xiaoxiao Xu",
            "Zixiu Wang",
            "Lantao Hu",
            "Yongqi Liu",
            "Han Li",
            "Kaiqiao Zhan",
            "Kun Gai"
        ],
        "submitted": "2026-01-28 03:32:21",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "High-Resolution Mapping of Port Dynamics from Open-Access AIS Data in Tokyo Bay",
        "abstract": "Knowledge about vessel activity in port areas and around major industrial zones provides insights into economic trends, supports decision-making for shipping and port operators, and contributes to maritime safety. Vessel data from terrestrial receivers of the Automatic Identification System (AIS) have become increasingly openly available, and we demonstrate that such data can be used to infer port activities at high resolution and with precision comparable to official statistics. We analyze open-access AIS data from a three-month period in 2024 for Tokyo Bay, located in Japan's most densely populated urban region. Accounting for uneven data coverage, we reconstruct vessel activity in Tokyo Bay at $\\sim\\,$30~m resolution and identify 161 active berths across seven major port areas in the bay. During the analysis period, we find an average of $35\\pm17_{\\text{stat}}$ vessels moving within the bay at any given time, and $293\\pm22_{\\text{stat}}+65_{\\text{syst}}-10_{\\text{syst}}$ vessels entering or leaving the bay daily, with an average gross tonnage of $11{,}860^{+280}_{-\\;\\,50}$. These figures indicate an accelerating long-term trend toward fewer but larger vessels in Tokyo Bay's commercial traffic. Furthermore, we find that in dense urban environments, radio shadows in vessel AIS data can reveal the precise locations of inherently passive receiver stations.",
        "url": "http://arxiv.org/abs/2601.20211v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20211v1",
        "arxiv_id": "2601.20211v1",
        "authors": [
            "Moritz Hütten"
        ],
        "submitted": "2026-01-28 03:22:13",
        "source": "arxiv",
        "comment": "29 pages, 18 figures, and 7 tables, matching the version published in Geomatics. Accompanying research data are available at https://dx.doi.org/10.6084/m9.figshare.29037401"
    },
    {
        "title": "Spark: Strategic Policy-Aware Exploration via Dynamic Branching for Long-Horizon Agentic Learning",
        "abstract": "Reinforcement learning has empowered large language models to act as intelligent agents, yet training them for long-horizon tasks remains challenging due to the scarcity of high-quality trajectories, especially under limited resources. Existing methods typically scale up rollout sizes and indiscriminately allocate computational resources among intermediate steps. Such attempts inherently waste substantial computation budget on trivial steps while failing to guarantee sample quality. To address this, we propose \\textbf{Spark} (\\textbf{S}trategic \\textbf{P}olicy-\\textbf{A}ware explo\\textbf{R}ation via \\textbf{K}ey-state dynamic branching), a novel framework that selectively branches at critical decision states for resource-efficient exploration. Our key insight is to activate adaptive branching exploration at critical decision points to probe promising trajectories, thereby achieving precise resource allocation that prioritizes sampling quality over blind coverage. This design leverages the agent's intrinsic decision-making signals to reduce dependence on human priors, enabling the agent to autonomously expand exploration and achieve stronger generalization. Experiments across diverse tasks (e.g., embodied planning), demonstrate that \\textsc{Spark} achieves superior success rates with significantly fewer training samples, exhibiting robust generalization even in unseen scenarios.",
        "url": "http://arxiv.org/abs/2601.20209v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20209v1",
        "arxiv_id": "2601.20209v1",
        "authors": [
            "Jinyang Wu",
            "Shuo Yang",
            "Changpeng Yang",
            "Yuhao Shen",
            "Shuai Zhang",
            "Zhengqi Wen",
            "Jianhua Tao"
        ],
        "submitted": "2026-01-28 03:15:34",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "MERGE: Next-Generation Item Indexing Paradigm for Large-Scale Streaming Recommendation",
        "abstract": "Item indexing, which maps a large corpus of items into compact discrete representations, is critical for both discriminative and generative recommender systems, yet existing Vector Quantization (VQ)-based approaches struggle with the highly skewed and non-stationary item distributions common in streaming industry recommenders, leading to poor assignment accuracy, imbalanced cluster occupancy, and insufficient cluster separation. To address these challenges, we propose MERGE, a next-generation item indexing paradigm that adaptively constructs clusters from scratch, dynamically monitors cluster occupancy, and forms hierarchical index structures via fine-to-coarse merging. Extensive experiments demonstrate that MERGE significantly improves assignment accuracy, cluster uniformity, and cluster separation compared with existing indexing methods, while online A/B tests show substantial gains in key business metrics, highlighting its potential as a foundational indexing approach for large-scale recommendation.",
        "url": "http://arxiv.org/abs/2601.20199v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20199v1",
        "arxiv_id": "2601.20199v1",
        "authors": [
            "Jing Yan",
            "Yimeng Bai",
            "Zongyu Liu",
            "Yahui Liu",
            "Junwei Wang",
            "Jingze Huang",
            "Haoda Li",
            "Sihao Ding",
            "Shaohui Ruan",
            "Yang Zhang"
        ],
        "submitted": "2026-01-28 02:56:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Improving X-Codec-2.0 for Multi-Lingual Speech: 25 Hz Latent Rate and 24 kHz Sampling",
        "abstract": "X-Codec-2.0 has shown strong performance in neural audio compression and multilingual speech modeling, operating at a 50 Hz latent rate and a 16 kHz sampling rate using frozen HuBERT features. While effective, this configuration limits temporal efficiency and audio fidelity. In this work, we explore a simple and effective modification by introducing additional pooling and increasing the decoder hop size. This reduces the latent rate from 50 Hz to 25 Hz and simultaneously raises the output sampling rate from 16 kHz to 24 kHz, improving efficiency and perceptual quality without altering the core architecture. Evaluated on the multilingual Common Voice 17 test set, the proposed configuration achieves a 0.29 MOS improvement over the original X-Codec-2.0 baseline based on UTMOSv2, and attains the best reported performance among all codecs operating at 25 Hz. The source code, checkpoints, and generation comparisons are released at \\href{https://huggingface.co/Scicom-intl/xcodec2-25TPS-24k}{https://huggingface.co/Scicom-intl/xcodec2-25TPS-24k}.",
        "url": "http://arxiv.org/abs/2601.20185v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20185v1",
        "arxiv_id": "2601.20185v1",
        "authors": [
            "Husein Zolkepli"
        ],
        "submitted": "2026-01-28 02:36:30",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "What's the plan? Metrics for implicit planning in LLMs and their application to rhyme generation and question answering",
        "abstract": "Prior work suggests that language models, while trained on next token prediction, show implicit planning behavior: they may select the next token in preparation to a predicted future token, such as a likely rhyming word, as supported by a prior qualitative study of Claude 3.5 Haiku using a cross-layer transcoder. We propose much simpler techniques for assessing implicit planning in language models. With case studies on rhyme poetry generation and question answering, we demonstrate that our methodology easily scales to many models. Across models, we find that the generated rhyme (e.g. \"-ight\") or answer to a question (\"whale\") can be manipulated by steering at the end of the preceding line with a vector, affecting the generation of intermediate tokens leading up to the rhyme or answer word. We show that implicit planning is a universal mechanism, present in smaller models than previously thought, starting from 1B parameters. Our methodology offers a widely applicable direct way to study implicit planning abilities of LLMs. More broadly, understanding planning abilities of language models can inform decisions in AI safety and control.",
        "url": "http://arxiv.org/abs/2601.20164v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20164v1",
        "arxiv_id": "2601.20164v1",
        "authors": [
            "Jim Maar",
            "Denis Paperno",
            "Callum Stuart McDougall",
            "Neel Nanda"
        ],
        "submitted": "2026-01-28 01:47:10",
        "source": "arxiv",
        "comment": "41 pages, 34 figures, Accepted at ICLR 2026, Code available at https://github.com/Jim-Maar/implicit-planning-in-llms"
    },
    {
        "title": "Me-Agent: A Personalized Mobile Agent with Two-Level User Habit Learning for Enhanced Interaction",
        "abstract": "Large Language Model (LLM)-based mobile agents have made significant performance advancements. However, these agents often follow explicit user instructions while overlooking personalized needs, leading to significant limitations for real users, particularly without personalized context: (1) inability to interpret ambiguous instructions, (2) lack of learning from user interaction history, and (3) failure to handle personalized instructions. To alleviate the above challenges, we propose Me-Agent, a learnable and memorable personalized mobile agent. Specifically, Me-Agent incorporates a two-level user habit learning approach. At the prompt level, we design a user preference learning strategy enhanced with a Personal Reward Model to improve personalization performance. At the memory level, we design a Hierarchical Preference Memory, which stores users' long-term memory and app-specific memory in different level memory. To validate the personalization capabilities of mobile agents, we introduce User FingerTip, a new benchmark featuring numerous ambiguous instructions for daily life. Extensive experiments on User FingerTip and general benchmarks demonstrate that Me-Agent achieves state-of-the-art performance in personalization while maintaining competitive instruction execution performance.",
        "url": "http://arxiv.org/abs/2601.20162v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20162v1",
        "arxiv_id": "2601.20162v1",
        "authors": [
            "Shuoxin Wang",
            "Chang Liu",
            "Gowen Loo",
            "Lifan Zheng",
            "Kaiwen Wei",
            "Xinyi Zeng",
            "Jingyuan Zhang",
            "Yu Tian"
        ],
        "submitted": "2026-01-28 01:44:19",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Trajectory2Task: Training Robust Tool-Calling Agents with Synthesized Yet Verifiable Data for Complex User Intents",
        "abstract": "Tool-calling agents are increasingly deployed in real-world customer-facing workflows. Yet most studies on tool-calling agents focus on idealized settings with general, fixed, and well-specified tasks. In real-world applications, user requests are often (1) ambiguous, (2) changing over time, or (3) infeasible due to policy constraints, and training and evaluation data that cover these diverse, complex interaction patterns remain under-represented. To bridge the gap, we present Trajectory2Task, a verifiable data generation pipeline for studying tool use at scale under three realistic user scenarios: ambiguous intent, changing intent, and infeasible intents. The pipeline first conducts multi-turn exploration to produce valid tool-call trajectories. It then converts these trajectories into user-facing tasks with controlled intent adaptations. This process yields verifiable task that support closed-loop evaluation and training. We benchmark seven state-of-the-art LLMs on the generated complex user scenario tasks and observe frequent failures. Finally, using successful trajectories obtained from task rollouts, we fine-tune lightweight LLMs and find consistent improvements across all three conditions, along with better generalization to unseen tool-use domains, indicating stronger general tool-calling ability.",
        "url": "http://arxiv.org/abs/2601.20144v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20144v1",
        "arxiv_id": "2601.20144v1",
        "authors": [
            "Ziyi Wang",
            "Yuxuan Lu",
            "Yimeng Zhang",
            "Jing Huang",
            "Jiri Gesi",
            "Xianfeng Tang",
            "Chen Luo",
            "Yisi Sang",
            "Hanqing Lu",
            "Manling Li",
            "Dakuo Wang"
        ],
        "submitted": "2026-01-28 00:36:13",
        "source": "arxiv",
        "comment": null
    },
    {
        "title": "Mind the Shift: Using Delta SSL Embeddings to Enhance Child ASR",
        "abstract": "Self-supervised learning (SSL) models have achieved impressive results across many speech tasks, yet child automatic speech recognition (ASR) remains challenging due to limited data and pretraining domain mismatch. Fine-tuning SSL models on child speech induces shifts in the representation space. We hypothesize that delta SSL embeddings, defined as the differences between embeddings from a finetuned model and those from its pretrained counterpart, encode task-specific information that complements finetuned features from another SSL model. We evaluate multiple fusion strategies on the MyST childrens corpus using different models. Results show that delta embedding fusion with WavLM yields up to a 10 percent relative WER reduction for HuBERT and a 4.4 percent reduction for W2V2, compared to finetuned embedding fusion. Notably, fusing WavLM with delta W2V2 embeddings achieves a WER of 9.64, setting a new state of the art among SSL models on the MyST corpus. These findings demonstrate the effectiveness of delta embeddings and highlight feature fusion as a promising direction for advancing child ASR.",
        "url": "http://arxiv.org/abs/2601.20142v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20142v1",
        "arxiv_id": "2601.20142v1",
        "authors": [
            "Zilai Wang",
            "Natarajan Balaji Shankar",
            "Kaiyuan Zhang",
            "Zihan Wang",
            "Abeer Alwan"
        ],
        "submitted": "2026-01-28 00:32:52",
        "source": "arxiv",
        "comment": "ICASSP 2026"
    },
    {
        "title": "Taxonomy of the Retrieval System Framework: Pitfalls and Paradigms",
        "abstract": "Designing an embedding retrieval system requires navigating a complex design space of conflicting trade-offs between efficiency and effectiveness. This work structures these decisions as a vertical traversal of the system design stack. We begin with the Representation Layer by examining how loss functions and architectures, specifically Bi-encoders and Cross-encoders, define semantic relevance and geometric projection. Next, we analyze the Granularity Layer and evaluate how segmentation strategies like Atomic and Hierarchical chunking mitigate information bottlenecks in long-context documents. Moving to the Orchestration Layer, we discuss methods that transcend the single-vector paradigm, including hierarchical retrieval, agentic decomposition, and multi-stage reranking pipelines to resolve capacity limitations. Finally, we address the Robustness Layer by identifying architectural mitigations for domain generalization failures, lexical blind spots, and the silent degradation of retrieval quality due to temporal drift. By categorizing these limitations and design choices, we provide a comprehensive framework for practitioners to optimize the efficiency-effectiveness frontier in modern neural search systems.",
        "url": "http://arxiv.org/abs/2601.20131v1",
        "pdf_url": "https://arxiv.org/pdf/2601.20131v1",
        "arxiv_id": "2601.20131v1",
        "authors": [
            "Deep Shah",
            "Sanket Badhe",
            "Nehal Kathrotia"
        ],
        "submitted": "2026-01-27 23:49:46",
        "source": "arxiv",
        "comment": null
    }
]